NetBSD/src/usr.sbin/config.old/config.old.8
.\" Copyright (c) 1980, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)config.8	6.5 (Berkeley) 3/16/91
.\"	$Id: config.old.8,v 1.7 1995/04/28 07:00:59 cgd Exp $
.\"
.Dd March 16, 1991
.Dt CONFIG.OLD 8
.Os BSD 4
.Sh NAME
.Nm config.old
.Nd build system configuration files
.Sh SYNOPSIS
.Nm config.old
.Op Fl gkp
.Ar SYSTEM_NAME
.Sh DESCRIPTION
.Pp
.Nm config.old
builds a set of system configuration files from the file
.Ar SYSTEM_NAME
which describes
the system to configure.
A second file
tells
.Nm config.old
what files are needed to generate a system and
can be augmented by configuration specific set of files
that give alternate files for a specific machine.
(see the
.Sx FILES
section below)
.Pp
Available option and operand:
.Pp
.Bl -tag -width SYSTEM_NAME
.It Fl g
If the
.Fl g
option is supplied, 
.Nm config.old
will configure a system for debugging.
.It Fl k
If the
.Fl k
option is supplied, 
.Nm config.old
will not fail immediately on detection of a configuration error.
.It Fl p
If the
.Fl p
option is supplied, 
.Nm config.old
will configure a system for profiling; for example,
.Xr kgmon 8
and
.Xr gprof 1 .

.It Ar SYSTEM_NAME
specifies the name of the system configuration file
containing device specifications, configuration options
and other system parameters for one system configuration.
.El
.Pp
.Nm config.old
should be run from the
.Pa conf
subdirectory of the system source (usually
.Pa /sys/arch/ARCH/conf ) .
.Nm Config.old
assumes the directory
.Pa ../compile/SYSTEM_NAME
exists and places all output files there.  
The output of
.Nm config.old
consists of a number of files; for the
.Tn i386 ,
they are:
.Pa ioconf.c ,
a description
of what I/O devices are attached to the system;
.Pa vector.s ,
a set of interrupt service routines for devices
attached to the bus plus
offsets into a structure used for counting per-device interrupts;
.Pa Makefile ,
used by
.Xr make 1
in building the system;
header files,
definitions of
the number of various devices that will be compiled into the system;
swap configuration files,
definitions for
the disk areas to be used for swapping, the root file system,
argument processing, and system dumps.
.Pp
After running
.Nm config.old ,
it is necessary to run
.Dq Li make depend
in the directory where the new makefile
was created.
.Nm Config.old
prints a reminder of this when it completes.
.Pp
If any other error messages are produced by
.Nm config.old ,
the problems in the configuration file should be corrected and
.Nm config.old
should be run again.
Attempts to compile a system that had configuration errors
are likely to fail.
.Sh FILES
.Bl -tag -width /sys/arch/i386/conf/Makefile.i386 -compact
.It Pa /sys/arch/i386/conf/Makefile.i386
generic makefile for the
.Tn i386
.It Pa /sys/conf/files
list of common files system is built from
.It Pa /sys/arch/i386/conf/files.i386
list of
.Tn i386
specific files
.It Pa /sys/arch/i386/conf/devices.i386
name to major device mapping file for the
.Tn i386
.It Pa /sys/arch/i386/conf/files. Ns Em ERNIE
list of files specific to
.Em ERNIE
system
.El
.Sh SEE ALSO
The SYNOPSIS portion of each device in section 4.
.Rs
.%T "Building 4.3 BSD UNIX System with Config"
.Re
.Sh BUGS
The line numbers reported in error messages are usually off by one.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.1 .
