NetBSD/src/usr.sbin/btuartd/btuartd.8
.\" $NetBSD: btuartd.8,v 1.1 2007/02/20 16:59:36 kiyohara Exp $
.\"
.\" Copyright (c) 2007 KIYOHARA Takashi
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $Id: btuartd.8,v 1.1 2007/02/20 16:59:36 kiyohara Exp $
.\"
.Dd February 19, 2007
.Dt BTUARTD 8
.Os
.Sh NAME
.Nm btuartd
.Nd Bluetooth HCI UART (H4) daemon.
.Sh SYNOPSIS
.Nm
.Op Fl d
.Op Fl c Ar conffile
.Nm
.Op Fl f
.Op Fl i Ar init_speed
.Op Ar type
.Ar comdev speed
.Sh DESCRIPTION
The
.Nm
daemon configure and attach Bluetooth HCI UART devices.  It opens
.Ar comdev
like
.Xr com 4
and compatible devices, also configure
.Ar speed
and flow.  The
.Nm
daemon support HCI UART.  The former is read the configuration file.  And
working on the daemon mode.  The latter sets the device given by the
argument. 
.Pp
When the SIGHUP is received in the daemon mode, all devices are closed.
And, it works reading the configuration file again. 
.Pp
If the
.Ar type
is given, then
.Nm
set
.Ar type
to
.Xr btuart 4 .
The
.Ar type
supports:
.Bl -tag -width XXXXXX
.It Cm ericsson
Ericsson based modules
.It Cm digi
Digianswer based cards
.It Cm texas
Texas Instruments
.It Cm csr
Cambridge Silicon Radio Casira serial adapter or BrainBoxes serial dongle
(BL642)
.It Cm swave
Silicon Wave kits
.It Cm st
ST Microelectronics minikits based on STLC2410/STLC2415
.It Cm stlc2500
ST Microelectronics minikits based on STLC2500
.It Cm bt2000c
AmbiCom BT2000C Bluetooth PC/CF Card
.It Cm bcm2035
Broadcom BCM2035
.It Cm *
Unspecified HCI UART interface
.El
.Pp
The command line options are as follows:
.Bl -tag -width XXXX
.It Fl c Ar conffile
Specify the configuration file.
The default is
.Pa /etc/bluetooth/btuartd.conf .
.It Fl d
Run in foreground (do not detach).
.It Fl f
Enable flow control as
.Xr com 4 .
.It Fl i Ar init_speed
Specify the initial speed for Bluetooth module.
.El
.Sh FILES
.Bl -tag -compact
.It Pa /etc/bluetooth/btuartd.conf
.It Pa /var/run/btuartd.pid
.El
.Sh SEE ALSO
.Xr btuart 4 ,
.Xr bluetooth 4 ,
.Xr btconfig 8
.Sh HISTORY
The
.Nm
daemon was writen for
.Nx 4.0 .
.Sh AUTHORS
.An KIYOHARA Takashi Aq kiyohara@kk.iij4u.or.jp
