NetBSD/src/sbin/mount_puffs/mount_puffs.8
.\"	$NetBSD: mount_puffs.8,v 1.3 2016/11/24 12:38:32 wiz Exp $
.\"
.\" Copyright (c) 2010 Antti Kantee.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 23, 2016
.Dt MOUNT_PUFFS 8
.Os
.Sh NAME
.Nm mount_puffs
.Nd helper utility for mounting puffs/refuse file systems
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Ar program Ns Op # Ns Ar source
.Ar mount_point
.Sh DESCRIPTION
The
.Nm
utility simply executes the given
.Ar program ,
allowing to mount
.Xr puffs 4
and
.Xr refuse 3
based file systems via
.Ic mount -a
or the
.Xr fstab 5
file.
.Pp
This command is usually only executed by
.Xr mount 8 ,
as users can directly execute file servers to mount them.
The
.Ar program
parameter is either the path to the file server or the file name of
it.
In the latter case the
.Ar program
is searched in the
.Ev PATH
variable.
The
.Ar source
parameter, when specified, will be passed to the
.Ar program
as its first non-option argument, with
.Ar mount_point
being the second one.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
They are passed to the
.Ar program
without any modifications except for
.Cm getargs ,
which is typically used by
.Ic mount -vv .
When there is
.Cm getargs
in the list,
.Nm
discards all the other options and prints the kernel arguments for a
.Xr puffs 4
file system already mounted at
.Ar mount_point .
.El
.Sh EXAMPLES
Mount
.Ic dmesgfs
at
.Pa /dmesg :
.Dl # mount_puffs dmesgfs /dmesg
.Pp
Or in
.Xr fstab 5 :
.Bd -literal -offset indent -compact
dmesgfs  /dmesg  puffs  rw
.Ed
.Pp
These are equivalent to:
.Dl # dmesgfs /dmesg
.Pp
Mount
.Pa /usr/bin/rot13fs
for
.Pa /home/foo
at
.Pa /mnt/rot13
with option
.Fl o Cm rdonly :
.Dl # mount_puffs -o rdonly /usr/bin/rot13fs#/home/foo /mnt/rot13
.Pp
Or in
.Xr fstab 5 :
.Bd -literal -offset indent -compact
/usr/bin/rot13fs#/home/foo  /mnt/rot13  puffs  rdonly
.Ed
.Pp
These are equivalent to:
.Dl # /usr/bin/rot13fs -o rdonly /home/foo /mnt/rot13
.Sh SEE ALSO
.Xr refuse 3 ,
.Xr puffs 4 ,
.Xr fusermount 8 ,
.Xr mount 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 6.0 .
