NetBSD/src/usr.sbin/pkg_install/view/pkg_view.1
.\"	$NetBSD: pkg_view.1,v 1.1.2.3 2003/07/14 22:53:13 jlam Exp $
.\"
.\" Copyright (c) 2003 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 13, 2003
.Dt PKG_VIEW 1
.Os
.Sh NAME
.Nm pkg_view
.Nd a utility for managing package views
.Sh SYNOPSIS
.Nm
.Op Ar options
.Ar command
.Ar package ...
.Sh DESCRIPTION
The
.Nm
command is used to add and delete packages in
.Ar stowdir
into a
.Ar view
in the
.Ar prefix
directory.
.Pp
The following command-line options are supported:
.Bl -tag -width indent
.It Fl d Ar stowdir
Set
.Ar stowdir
as the directory in which the installed packages can be found.
The default
.Ar stowdir
is the
.Pa packages
directory under
.Ar prefix .
.It Fl i Ar ignore
Add
.Ar ignore
to the list of files in
.Ar package
that should ignored when adding or removing the package from
.Ar view .
.It Fl p Ar prefix
Set
.Ar prefix
as the directory in which all the views are managed.
The default
.Ar prefix
directory is
.Pa /usr/pkg
but may be overridden by the
.Ev PREFIX
environment variable.
.It Fl V
Print the version number and exit.
.It Fl v Ar view
Set
.Ar view
as the directory in
.Ar prefix
in which the packages should be added or removed.
The default
.Ar view
is the empty view but may be overridden by the
.Ev PKG_VIEW
environment variable.
.El
.Pp
The following commands are supported:
.Bl -tag -width indent
.It Ar add
Add the listed packages into
.Ar view .
.It Ar check
Check whether the listed packages are present in
.Ar view .
If they are not present, then return 0, otherwise return 1.
.It Ar delete
Delete the listed packages from
.Ar view .
.El
.Sh ENVIRONMENT
.Bl -tag -width indent
.It Ev PKG_DBDIR
The standard package database directory,
.Pa /var/db/pkg ,
can be overridden by specifying an alternative directory in the
.Ev PKG_DBDIR
environment variable.
.It Ev PLIST_IGNORE_FILES
This can be used to specify the files in
.Ar package
that should ignored when adding or removing the package from
.Ar view .
.Ev PLIST_IGNORE_FILES
is a space-separated list of pathnames relative to the
.Ar package
directory.
.It Ev PKG_VIEW
The default view can be specified in the
.Ev PKG_VIEW
environment variable.
.It Ev PREFIX
The standard prefix directory,
.Pa /usr/pkg ,
can be overridden by specifying an alternative directory in the
.Ev PREFIX
environment variable.
.El
.Sh SEE ALSO
.Xr pkg_delete 1 ,
.Xr linkfarm 1
.Sh BUGS
Only the empty view is supported.
.Sh AUTHORS
The
.Nm
utility was written by
.An Alistair G. Crooks Aq agc@netbsd.org .
