NetBSD/src/lib/libc/time/tzfile.5
.\"	$NetBSD: tzfile.5,v 1.25.2.1 2018/10/20 06:58:22 pgoyette Exp $
.\"
.\" This file is in the public domain, so clarified as of
.\" 1996-06-05 by Arthur David Olson (arthur_david_olson@nih.gov).
.Dd October 19, 2018
.Dt TZFILE 5
.Os
.Sh NAME
.Nm tzfile
.Nd time zone information
.Sh DESCRIPTION
The timezone information files used by
.Xr tzset 3
are typically found under a directory with a name like
.Pa /usr/share/zoneinfo .
These files beging with a 44-byte header containing the following fields:
.Bl -bullet
.It
The magic four-byte ASCII sequence begin with the magic characters
.Dq TZif .
identifies the file as a timezone information file.
.It
A byte identifying the version of the file's format (as of 2017, either
an ASCII
.Dv NUL ,
or
.Dq 2 ,
or
.Dq 3 ).
.It
Fifteen bytes containing zeros reserved for future use.
.It
Six four-byte integer values written in a standard byte order
(the high-order byte of the value is written first).
These values are, in order:
.Bl -inset
.It Va tzh_ttisgmtcnt
The number of UT/local indicators stored in the file.
.It Va tzh_ttisstdcnt
The number of standard/wall indicators stored in the file.
.It Va tzh_leapcnt
The number of leap seconds for which data entries are stored in the file.
.It Va tzh_timecnt
The number of transition times for which data entries are stored
in the file.
.It Va tzh_typecnt
The number of local time types for which data entries are stored
in the file (must not be zero).
.It Va tzh_charcnt
The number of bytes of timezone abbreviation strings
stored in the file.
.El
.It
The above header is followed by the following fields, whose lengths
depend on the contents of the header:
.Bl -inset
.It Va tzh_timecnt
four-byte signed integer values sorted in ascending order.
These values are written in
These values are written in standard byte order.
Each is used as a transition time (as returned by
.Xr time 3 )
at which the rules for computing local time change.
.It Va tzh_timecnt
one-byte unsigned integer values;
each one but the last tells which of the different types of local time types
described in the file is associated with the time period
starting with the same-indexed transition time
and continuing up to but not including the next transition time.
(The last time type is present only for consistency checking with the
POSIX-style TZ string described below.)
These values serve as indices into the next field.
.It Va tzh_typecnt
.Va ttinfo
entries, each defined as follows:
.Bd -literal
struct ttinfo {
	int32_t		tt_gmtoff;
	unsigned char	tt_isdst;
	unsigned char	tt_abbrind;
};
.Ed
.Pp
Each structure is written as a four-byte signed integer value for
.Va tt_gmtoff
in a standard byte order, followed by a one-byte value for
.Va tt_isdst
and a one-byte value for
.Va tt_abbrind .
In each structure,
.Va tt_gmtoff
gives the number of seconds to be added to UT,
.Va tt_isdst
tells whether
.Va tm_isdst
should be set by
.Xr localtime 3
and
.Va tt_abbrind
serves as an index into the array of timezone abbreviation bytes
that follow the
.Va ttinfo
structure(s) in the file.
.It Va tzh_leapcnt
pairs of four-byte values, written in standard byte order;
the first value of each pair gives the time
(as returned by
.Xr time 3 )
at which a leap second occurs;
the second gives the
.Em total
number of leap seconds to be applied during the time period
starting at the given time.
The pairs of values are sorted in ascending order by time.
Each transition is for one leap second, either positive or negative;
transitions always separated by at least 28 days minus 1 second.
.It Va tzh_ttisstdcnt
standard/wall indicators, each stored as a one-byte value;
they tell whether the transition times associated with local time types
were specified as standard time or wall clock time,
and are used when a timezone file is used in handling POSIX-style
timezone environment variables.
.It Va tzh_ttisgmtcnt
UT/local indicators, each stored as a one-byte value;
they tell whether the transition times associated with local time types
were specified as UT or local time,
and are used when a timezone file is used in handling POSIX-style
timezone environment variables.
.Pp
The
.Xr localtime 3
function uses the first standard-time
.Fa ttinfo
structure in the file
(or simply the first
.Fa ttinfo
structure in the absence of a standard-time structure)
if either
.Va tzh_timecnt
is zero or the time argument is less than the first transition time recorded
in the file.
.El
.El
.Ss Version 2 format
For version-2-format timezone files,
the above header and data are followed by a second header and data,
identical in format except that
eight bytes are used for each transition time or leap second time.
(Leap second counts remain four bytes.)
After the second header and data comes a newline-enclosed,
POSIX-TZ-environment-variable-style string for use in handling instants
after the last transition time stored in the file
or for all instants if the file has no transitions.
The POSIX-style TZ string is empty (i.e., nothing between the newlines)
if there is no POSIX representation for such instants.
If nonempty, the POSIX-style TZ string must agree with the local time
type after the last transition time if present in the eight-byte data;
for example, given the string
.Dq WET0WEST,M3.5.0,M10.5.0/3
then if a last transition time is in July, the transition's local time
type must specify a daylight-saving time abbreviated
.Dq WEST
that is one hour east of UT.
Also, if there is at least one transition, time type 0 is associated
with the time period from the indefinite past up to but not including
the earliest transition time.
.Ss Version 3 format
For version-3-format timezone files, the POSIX-TZ-style string may
use two minor extensions to the POSIX TZ format, as described in
.Xr tzset 3 .
First, the hours part of its transition times may be signed and range from
\-167 through 167 instead of the POSIX-required unsigned values
from 0 through 24.
Second, DST is in effect all year if it starts
January 1 at 00:00 and ends December 31 at 24:00 plus the difference
between daylight saving and standard time.
.Pp
Future changes to the format may append more data.
.Sh SEE ALSO
.Xr ctime 3 ,
.Xr localtime 3 ,
.Xr time 3 ,
.Xr tzset 3 ,
.Xr zdump 8
.Xr zic 8
.\" @(#)tzfile.5	8.3
.\" This file is in the public domain, so clarified as of
.\" 1996-06-05 by Arthur David Olson.
