NetBSD/src/games/wtf/wtf.6
.\"	$NetBSD: wtf.6,v 1.13.6.1 2012/10/30 18:58:27 yamt Exp $
.\"
.\" Public Domain
.\"
.Dd October 3, 2012
.Dt WTF 6
.Os
.Sh NAME
.Nm wtf
.Nd translate acronyms
.Sh SYNOPSIS
.Nm
.Op Fl f Ar dbfile
.Op Ar is
.Ar acronym ...
.Sh DESCRIPTION
The
.Nm
utility displays the expansion of one or more acronyms
specified on the command line.
If an acronym is not in any of the acronym databases,
which are expected to be in the format
.Dq acronym[tab]meaning ,
.Nm
will check to see if it is known by
.Xr whatis 1 ,
.Xr pkg_info 1 ,
or via pkgsrc's internal help mechanism,
.Dq make help topic=XXX .
.Pp
If
.Dq is
is specified on the command line, it will be ignored, allowing the
fairly natural
.Dq wtf is WTF
usage.
.Pp
The following options are available:
.Bl -tag -width flag
.It Fl f Ar dbfile
Overrides the default list of acronym databases, bypassing the value of the
.Ev ACRONYMDB
variable.
Unlike this variable the
.Fl f
option only accepts one file name as an argument,
but it may be given multiple times to specify more than one file to use.
.El
.Sh ENVIRONMENT
.Bl -tag -width ACRONYMDB
.It Ev ACRONYMDB
The default list of acronym databases may be overridden by setting the
environment variable
.Ev ACRONYMDB
to the name of one or more space-separated file names of
acronym databases.
.El
.Sh FILES
.Bl -tag -width /usr/share/misc/acronyms.XXXX -compact
.It Pa /usr/share/misc/acronyms
default acronym database.
.It Pa /usr/share/misc/acronyms.comp
default computer-related acronym database.
.El
.Sh SEE ALSO
.Xr make 1 ,
.Xr pkg_info 1 ,
.Xr whatis 1
.Sh HISTORY
.Nm
first appeared in
.Nx 1.5 .
