NetBSD/src/games/wtf/wtf.6
.\"	$NetBSD: wtf.6,v 1.8 2003/04/25 19:08:31 jmmv Exp $
.\"
.\" Public Domain
.\"
.Dd April 25, 2003
.Dt WTF 6
.Os
.Sh NAME
.Nm wtf
.Nd translates acronyms for you
.Sh SYNOPSIS
.Nm
.Op Fl f Ar dbfile
.Op Fl t Ar type
.Op Ar is
.Ar acronym Ar ...
.Sh DESCRIPTION
The
.Nm
utility displays the expansion of the acronyms
specified on the command line.
If the acronym is unknown,
.Nm
will check to see if the acronym is known by the
.Xr whatis 1
command.
.Pp
If
.Dq is
is specified on the command line, it will be ignored, allowing the
fairly natural
.Dq wtf is WTF
usage.
.Pp
The following options are available:
.Bl -tag -width flag
.It Fl f Ar dbfile
Overrides the default acronym database, bypassing the value of the
.Ev ACRONYMDB
variable.
.It Fl t Ar type
Specifies the acronym's type.
Simply put, it makes the program use the acronyms database named
.Pa /usr/share/misc/acronyms.type ,
where
.Ar type
is given by the argument.
.El
.Sh ENVIRONMENT
.Bl -tag -width ACRONYMDB
.It Ev ACRONYMDB
The default acronym database may be overridden by setting the
environment variable
.Ev ACRONYMDB
to the name of a file in the proper format (acronym[tab]meaning).
.El
.Sh FILES
.Bl -tag -width /usr/share/misc/acronyms.XXXX -compact
.It Pa /usr/share/misc/acronyms
default acronym database.
.It Pa /usr/share/misc/acronyms.comp
computer-related acronym database.
.El
.Sh SEE ALSO
.Xr whatis 1
.Sh HISTORY
.Nm
first appeared in
.Nx 1.5 .
