NetBSD/src/games/wtf/wtf.6
.\"	$NetBSD: wtf.6,v 1.2 1999/07/25 20:02:48 thorpej Exp $
.\"
.\" Public Domain
.\"
.Dd July 21, 1999
.Dt WTF 6
.Os
.Sh NAME
.Nm wtf
.Nd translates acronyms for you
.Sh SYNOPSIS
.Nm
.Op Ar is
.Ar acronym Ar ...
.Sh DESCRIPTION
The
.Nm
utility displays the expansion of the acronyms 
specified on the command line.
.Pp
If
.Dq is
is specified on the command line, it will be ignored, allowing the
fairly natural 
.Dq wtf is WTF
usage.
.Sh ENVIRONMENT
.Bl -tag -width ACRONYMDB
.It Ev ACRONYMDB
The default acronym database may be overridden by setting the
environment variable
.Ev ACRONYMDB
to the name of a file in the proper format (acronym[tab]meaning).
.El
.Sh FILES
.Bl -tag -width /usr/share/misc/acronyms -compact
.It Pa /usr/share/misc/acronyms
default acronym database.
.El
.Sh HISTORY
.Nm
first appeared in
.Nx 1.5 .
