NetBSD/src/share/man/man4/man4.hpcarm/j720kbd.4
.\"	$NetBSD: j720kbd.4,v 1.1 2006/10/07 14:12:47 peter Exp $
.\"
.\" Copyright (c) 2006 Peter Postma
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 29, 2006
.Dt J720KBD 4 hpcarm
.Os
.Sh NAME
.Nm j720kbd
.Nd driver for Jornada 710/720/728 keyboard
.Sh SYNOPSIS
.Cd "j720kbd* at j720ssp?"
.Cd "hpckbd* at j720kbd?"
.Cd "wskbd* at hpckbd? mux 1"
.Sh DESCRIPTION
The
.Nm
driver provides support for the keyboard in the Jornada 720 series machines.
.Pp
Pressing the on/off button will suspend the machine.
Pressing this key again will cause it to resume.
.Sh SEE ALSO
.Xr hpckbd 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8
