NetBSD/src/share/man/man4/man4.hpcarm/j720lcd.4
.\"	$NetBSD: j720lcd.4,v 1.1 2006/10/07 14:12:47 peter Exp $
.\"
.\" Copyright (c) 2004 Valeriy E. Ushakov
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 29, 2006
.Dt J720LCD 4 hpcarm
.Os
.Sh NAME
.Nm j720lcd
.Nd driver for Jornada 710/720/728 LCD screen
.Sh SYNOPSIS
.Cd "j720lcd* at j720ssp?"
.Sh DESCRIPTION
The
.Nm
driver provides support for controlling brightness, contrast, and
power of the LCD screen in the Jornada 720 series machines.
.Pp
The default keymap binds
.Ao Li Ctrl Ac + Ao Li Alt Ac + Ao Ar arrowkey Ac
to control brightness with up and down arrow keys, and to control
contrast with left and right arrow keys.
.Sh SEE ALSO
.Xr screenblank 1 ,
.Xr wsconsctl 8
