NetBSD/src/share/man/man7/hier.7
.\"	$NetBSD: hier.7,v 1.127 2018/01/09 09:22:25 wiz Exp $
.\"
.\" Copyright (c) 1990, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hier.7	8.5 (Berkeley) 6/1/94
.\"
.Dd January 8, 2018
.Dt HIER 7
.Os
.Sh NAME
.Nm hier
.Nd layout of file systems
.Sh DESCRIPTION
An outline of the file system hierarchy.
.Pp
Naming is very important.
The
.Ux
System relies on filename conventions for much of its power as a system.
The following file system layout describes generally where things are
and what they are, with references to other man pages for more detailed
documentation.
.Pp
Not all files will be in every system.
.Bl -tag -width "/altroot/"
.It Pa \&/
Root directory of the system.
.It Pa /COPYRIGHT
System copyright notice, most often put on CD-ROM distributions.
.It Pa "/[a-z]/"
User file systems.
.It Pa /altroot/
Alternate root file system, in case of disaster.
.\" .It Pa /amd/
.\" Home directories mount point; see
.\" .Xr amd 8 .
.It Pa /bin/
Utilities used in both single and multi-user environments.
.It Pa /boot*
Second-stage boot loader(s) for some platforms; see
.Xr installboot 8 .
.It Pa /cdrom/
Empty directory commonly used by
system administrators as a temporary mount point for ISO-9660 file
systems on CD (or DVD) media.
.It Pa /dev/
Block, character, and other special device files.
.Pp
.Bl -tag -width "MAKEDEV" -compact
.It Pa MAKEDEV
Script for creating device files;
see
.Xr makedev 8 .
.It Pa console
The computer's console device.
.It Pa drum
The computer's swap space device; see
.Xr drum 4 .
.It Pa fd/
File descriptor files;
see
.Xr fd 4 .
.It Pa klog
Kernel logging device; see
.Xr syslog 3 .
.It Pa kmem
Kernel virtual memory device; see
.Xr mem 4 .
.It Pa log
.Ux
domain datagram log socket; see
.Xr syslogd 8 .
.It Pa mem
Kernel physical memory device; see
.Xr mem 4 .
.It Pa null
The null device; see
.Xr null 4 .
.It Pa pts/
Mount point for the pseudo-terminal device file system; see
.Xr mount_ptyfs 8 .
.It Pa stderr
.It Pa stdin
.It Pa stdout
File descriptor files;
see
.Xr fd 4 .
.It Pa tty
Device pointing to each process's own controlling terminal; see
.Xr tty 4 .
.It Pa zero
The zero device; see
.Xr zero 4 .
.El
.\" .It Pa /dump/
.\" Online
.\" .Xr dump 8
.\" repository.
.It Pa /etc/
System configuration files and scripts.
.Pp
.Bl -tag -width "master.passwd" -compact
.It Pa amd*
Configuration files for
.Xr amd 8 .
.It Pa changelist
Files backed up by the
.Pa security
script.
.It Pa crontab
Schedule used by the
.Xr cron 8
daemon.
.It Pa csh.cshrc
.It Pa csh.login
.It Pa csh.logout
System-wide scripts for
.Xr csh 1 .
.It Pa daily
Script run each day by
.Xr cron 8 .
.It Pa daily.conf
Configuration file for
.Pa daily ;
see
.Xr daily.conf 5 .
.It Pa defaults/
Default configuration files read by various
.Pa /etc/*.conf
files.
.It Pa disktab
Disk description file; see
.Xr disktab 5 .
.It Pa dm.conf
Dungeon master configuration; see
.Xr dm.conf 5 .
.It Pa dumpdates
Dump history; see
.Xr dump 8 .
.It Pa exports
File system export information; see
.Xr mountd 8 .
.It Pa fstab
File system mounting table; see
.Xr fstab 5
and
.Xr mount 8 .
.It Pa ftpusers
Users denied
.Xr ftp 1
access; see
.Xr ftpd 8 .
.It Pa ftpwelcome
.Xr ftp 1
initial message; see
.Xr ftpd 8 .
.It Pa gettytab
Terminal configuration database; see
.Xr gettytab 5 .
.It Pa group
Group permissions file; see
.Xr group 5 .
.It Pa hosts
Host name database backup for
.Xr named 8 ;
see
.Xr hosts 5 .
.It Pa hosts.equiv
Trusted machines with equivalent user IDs.
(Obsolete.)
.It Pa hosts.lpd
Trusted machines with printing privileges.
.It Pa inetd.conf
Internet server configuration file; see
.Xr inetd 8 .
.It Pa kerberosV/
Configuration files for Kerberos version V;
see
.Xr kerberos 8 .
.It Pa localtime
Local time zone;
see
.Xr ctime 3 .
.It Pa login.conf
Configuration of user classes and limits; see
.Xr login.conf 5 .
.It Pa mail/
Configuration files for
.Xr sendmail 1 .
.Pp
.Bl -tag -width "sendmail.*" -compact
.It Pa aliases*
Username alias files.
.It Pa sendmail.*
.Xr sendmail 1
configuration information.
.El
.It Pa mail.rc
System-wide initialization script for
.Xr mail 1 .
.It Pa man.conf
Configuration file for
.Xr man 1 ;
see
.Xr man.conf 5 .
.It Pa master.passwd
Main password file, readable only by root; see
.Xr passwd 5 .
.It Pa mk.conf
Optional file containing
.Xr make 1
variables, used to configure pkgsrc and the system sources.
.It Pa monthly
Script run each month by
.Xr cron 8 .
.It Pa monthly.conf
Configuration file for
.Pa monthly ;
see
.Xr monthly.conf 5 .
.It Pa motd
System message of the day.
.It Pa mtree/
.Xr mtree 8
configuration files.
.It Pa named.*
.It Pa namedb/
.Xr named 8
configuration files and databases.
.It Pa netgroup
Network groups; see
.Xr netgroup 5 .
.It Pa netstart
Network startup script .
.It Pa networks
Network name database; see
.Xr networks 5 .
.It Pa passwd
World readable password file generated from master.passwd; see
.Xr passwd 5 ,
.Xr pwd_mkdb 8 .
.It Pa phones
Remote host telephone number data base; see
.Xr phones 5 .
.It Pa printcap
Printer configuration for
.Xr lpr 1 ;
see
.Xr printcap 5 .
.It Pa profile
System-wide scripts for
.Xr sh 1 .
.It Pa protocols
Protocol name database; see
.Xr protocols 5 .
.It Pa pwd.db
Database form of passwd file; see
.Xr pwd_mkdb 8 .
.It Pa rc
Master system startup script invoked by
.Xr init 8 ;
see
.Xr rc 8 .
.It Pa rc.conf
Configuration file for system startup and shutdown scripts; see
.Xr rc.conf 5 .
.It Pa rc.d/
Directory containing per-subsystem startup and shutdown scripts; see
.Xr rc 8 .
.It Pa rc.local
Locally editable system startup script.
.It Pa rc.shutdown
Master system shutdown script invoked by
.Xr shutdown 8 ;
see
.Xr rc 8 .
.It Pa remote
Remote host description file; see
.Xr remote 5 .
.It Pa security
Daily (in)security script run by
.Xr cron 8 .
.It Pa security.conf
Configuration file for
.Pa security ;
see
.Xr security.conf 5 .
.It Pa services
Service name data base; see
.Xr services 5 .
.It Pa shells
List of permitted shells; see
.Xr shells 5 .
.It Pa skel/
Sample initialization files for new user accounts.
.It Pa sliphome/
SLIP login/logout scripts; see
.Xr sliplogin 8 .
.It Pa spwd.db
Database form of master.passwd file; see
.Xr pwd_mkdb 8 .
.It Pa syslog.conf
.Xr syslogd 8
Configuration file; see
.Xr syslog.conf 5 .
.It Pa ttyaction
Login hooks for specific ttys, typically used to chown console
devices.
See
.Xr ttyaction 5 .
.It Pa ttys
Terminal initialization information; see
.Xr ttys 5 .
.It Pa weekly
Script run each week by
.Xr cron 8 .
.It Pa weekly.conf
Configuration file for
.Pa weekly ;
see
.Xr weekly.conf 5 .
.El
.It Pa /home/
Default location for user home directories.
.It Pa /kern/
Mount point for the kern file system; see
.Xr mount_kernfs 8 .
.It Pa /lib/
Dynamic linked libraries used by dynamically linked programs
that cannot rely upon
.Pa /usr/lib/
being available, such as those in
.Pa /bin/
and
.Pa /sbin/ .
.It Pa /libdata/
Non-executable files
.Pq such as device firmware
required at boot time, when
.Pa /usr/libdata
may not be available.
.It Pa /libexec/
System utilities (such as the dynamic linker) required by programs
and libraries that cannot rely upon
.Pa /usr/libexec/
being available.
.It Pa /mnt/
Empty directory commonly used by
system administrators as a temporary mount point.
.It Pa /net/
automounted NFS shares;
see
.Xr auto_master 5
.It Pa /netbsd
Kernel executable image (the operating system loaded into memory
at boot time).
.It Pa /proc/
Mount point for the process file system; see
.Xr mount_procfs 8 .
.It Pa /rescue/
Statically linked rescue tools, for use in system recovery.
.It Pa /root/
Home directory for the super-user.
.Pp
.Bl -tag -width ".profile" -compact
.It Pa \&.cshrc
Super-user start-up file for
.Xr csh 1 .
.It Pa \&.login
super-user start-up file for
.Xr csh 1 .
.It Pa \&.profile
super-user start-up file for
.Xr sh 1 .
.It Pa \&.rhosts
Super-user id mapping between machines.
(Obsolete.)
.El
.It Pa /sbin/
System programs and administration utilities
used in both single-user and multi-user environments.
.It Pa /stand/
Programs used in a standalone environment, that is, things that run on
bare hardware without a kernel.
Currently kernel modules are also placed here, although this remains
somewhat controversial and they may yet get moved.
.It Pa /tmp/
Temporary files.
The contents of
.Pa /tmp
are usually
.Em not
preserved across a system reboot.
.It Pa /usr/
Contains the majority of the system utilities and files.
.Pp
.Bl -tag -width "libdata/" -compact
.It Pa X11R6/
X11 files (for X11 revision 6).
.It Pa X11R7/
X11 files (for X11 revision 7).
.Pp
.Bl -tag -width "include/" -compact
.It Pa bin/
X11 binaries.
.It Pa include/
X11 include files.
.It Pa lib/
X11 libraries.
.El
.Pp
.It Pa bin/
Common utilities, programming tools, and applications.
.It Pa games/
The important stuff.
.It Pa include/
Standard C (and extension) include files.
.Pp
.Bl -tag -width "protocols/" -compact
.It Pa arpa/
Include files for Internet service protocols.
.It Pa atf/
Include files for the Automated Testing Framework; see
.Xr atf 7 .
.It Pa g++/
Include files for the GNU C++ compiler.
.It Pa machine/
Machine specific include files.
.It Pa net/
Miscellaneous network include files.
.It Pa netatalk/
C include files for AppleTalk protocols
see
.Xr atalk 4 .
.It Pa netinet/
Include files for Internet standard protocols; see
.Xr inet 4 .
.It Pa netinet6/
Include files for Internet protocol version 6; see
.Xr inet6 4 .
.It Pa netkey/
Include files for secret key management, used for security protocols; see
.Xr ipsec 4 .
.It Pa netnatm/
C include files for native mode ATM.
.It Pa nfs/
C include files for NFS (Network File System).
.It Pa protocols/
C include files for Berkeley service protocols.
.It Pa sys/
``System-level'' C include files.
.It Pa ufs/
C include files for several mutually related file systems.
(The `u' was originally for
.Ux . )
.El
.Pp
.It Pa lib/
Archive, profiled, position independent archive, and shared libraries.
.Pp
.Bl -tag -width "lua/" -compact
.It Pa lua/
.Bl -tag -width "5.3/" -compact
.It Pa 5.3/
Lua 5.3 modules.
.El
.El
.Pp
.It Pa libdata/
Miscellaneous utility data files.
.It Pa libexec/
System daemons & system utilities (executed by other programs).
.Pp
.It Pa mdec/
Boot blocks, etc.
.It Pa obj/
Architecture-specific target tree produced by building the
.Pa /usr/src
tree; often a symbolic link or mounted file system.
.It Pa pkg/
Installed third-party software packages.
.Pp
.Bl -tag -width "include/" -compact
.It Pa bin/
Package binaries.
.It Pa include/
Package include files.
.It Pa lib/
Package libraries.
.It Pa libdata/
Package data files.
.It Pa libexec/
Package daemons.
.It Pa sbin/
Package system utilities.
.El
.Pp
.It Pa pkgsrc/
Build descriptions (packaging) for the
.Nx
package system.
.Pp
.Bl -tag -width "distfilesX" -compact
.It Pa distfiles/
Downloaded upstream source archives.
.It Pa packages/
Compiled binary packages.
.El
.Pp
There are also several other subdirectories which contain packages of
a certain category, e.g., archivers, graphics, ...
.Pp
.It Pa sbin/
System daemons and system utilities (normally executed by the super-user).
.It Pa share/
Architecture-independent files, mostly text.
.Pp
.Bl -tag -width "calendar/" -compact
.It Pa calendar/
A variety of calendar files; see
.Xr calendar 1 .
.It Pa dict/
Word lists;
see
.Xr look 1
and
.Xr spell 1 .
.Pp
.Bl -tag -width "special/" -compact
.It Pa words
Common words.
.It Pa web2
Words from Webster's Second International Dictionary.
.It Pa papers/
Reference databases;
see
.Xr refer 1 .
.It Pa special/
Custom word lists;
see
.Xr spell 1 .
.El
.Pp
.It Pa doc/
Miscellaneous documentation.
.It Pa games/
Data files used by various games.
.It Pa i18n/
internationalization databases; see
.Xr iconv 3 .
.It Pa locale/
Locale databases and gettext message catalogs; see
.Xr setlocale 3
and
.Xr gettext 3 .
.It Pa man/
Manual pages.
.It Pa me/
Macros for use with the
.Xr me 7
roff macro package.
.It Pa misc/
Miscellaneous system-wide text files.
.Pp
.Bl -tag -width "terminfo.cdb" -compact
.It Pa terminfo
Terminal characteristics database;
see
.Xr terminfo 5 .
.It Pa terminfo.cdb
database form of terminfo file; see
.Xr tic 1 .
.El
.Pp
.It Pa mk/
Include files for
.Xr make 1 .
.It Pa ms/
Macros for use with the
.Xr ms 7
roff macro package.
.It Pa nls/
Message catalogs; see
.Xr catgets 3 .
.It Pa tmac/
Text processing macros;
see
.Xr nroff 1
and
.Xr troff 1 .
.It Pa zoneinfo/
Time zone database;
see
.Xr tzfile 5 .
.El
.It Pa tests/
Test programs; see
.Xr tests 7
for information on how to run them.
.El
.It Pa /usr/src/
.Nx
and local source files.
.Pp
.Bl -tag -width "domestic/" -compact
.It Pa bin/
Source for utilities/files in
.Pa /bin .
.It Pa common/
Sources shared between kernel and userland.
.It Pa crypto/
Cryptographic source, which may have import or export restrictions.
.It Pa dist/
Third-party
.Sq virgin
source code, referenced by other parts of the source tree.
(Deprecated; use
.Pa external/
instead.)
.It Pa distrib/
Tools and data files for making
.Nx
releases and distributions.
.It Pa doc/
Documentation about the source tree (i.e., about the tree, not about
how to use the software in the tree.)
.It Pa etc/
Source (usually example files) for files in
.Pa /etc .
.It Pa external/
Source for programs from external third parties
(where
.Nx
is the not the primary maintainer),
grouped by license, and then products per license.
.Pp
.Bl -tag -width "intel-fw-public/" -compact
.It Pa apache2/
Apache 2.0 license.
.It Pa bsd/
BSD (or equivalent) licensed software,
possibly with the
.Dq advertising clause .
.It Pa cddl/
Common Development and Distribution License (the Sun license which is
based on the Mozilla Public License version 1.1).
.It Pa gpl2/
GNU Public License, version 2 (or earlier).
.It Pa gpl3/
GNU Public License, version 3.
.It Pa historical/
Lucent's old license.
.It Pa ibm-public/
IBM's public license.
.It Pa intel-fw-eula/
Intel firmware license with redistribution restricted to OEM.
.It Pa intel-fw-public/
Intel firmware license permitting redistribution with
terms similar to BSD licensed software.
.It Pa intel-public/
Intel license permitting redistribution with terms similar to
BSD licensed software.
.It Pa mit/
MIT (X11) style license.
.It Pa zlib/
BSD-like zlib license.
.El
.Pp
.It Pa games/
Source for utilities/files in
.Pa /usr/games .
.It Pa gnu/
Source for programs covered by the GNU license (or similar)
(deprecated; use
.Pa external/gpl2/
or
.Pa external/gpl3/
as appropriate).
.It Pa include/
Source for files in
.Pa /usr/include .
.It Pa lib/
Source for libraries in
.Pa /usr/lib .
.It Pa libexec/
Source for utilities/files in
.Pa /usr/libexec .
.It Pa regress/
Various legacy regression tests.
.It Pa rescue/
Source/makefiles for
.Pa /rescue .
.It Pa sbin/
Source for utilities/files in
.Pa /sbin .
.It Pa share/
Source for files in
.Pa /usr/share .
.Pp
.Bl -tag -width "doc/" -compact
.It Pa doc/
.Pp
.Bl -tag -width "papers/" -compact
.It Pa papers/
Source for various historical technical papers (many from Berkeley).
.It Pa psd/
Source for Programmer's Supplementary Documents.
.It Pa smm/
Source for System Manager's Manual.
.It Pa usd/
Source for User's Supplementary Documents.
.El
.El
.It Pa sys/
Kernel source files.
.Pp
.Bl -tag -width "gdbscripts/" -compact
.It Pa arch/
Architecture-specific support.
.Pp
.Bl -tag -width "playstation2/" -compact
.It Pa acorn26/
Acorn Archimedes, A-series and R-series systems.
.It Pa acorn32/
Acorn RiscPC/A7000 and VLSI RC7500.
.It Pa algor/
Algorithmics Ltd. MIPS evaluations boards.
.It Pa alpha/
Digital/Compaq Alpha.
.It Pa amd64/
Computers with x86_64 capable CPUs.
.It Pa amiga/
Commodore Amiga and MacroSystem DraCo.
.It Pa amigappc/
PowerPC based Amiga boards.
.It Pa arc/
MIPS-based machines following the Advanced RISC Computing spec.
.It Pa arm/
ARM processor general support.
.It Pa atari/
Atari TT030, Falcon and Hades.
.It Pa bebox/
Be Inc. BeBox.
.It Pa cats/
Chalice Technology's CATS and Intel's EBSA-285 evaluation boards.
.It Pa cesfic/
CES FIC8234 VME processor board.
.It Pa cobalt/
Cobalt Networks' MIPS-based Microserver.
.It Pa dreamcast/
Sega Dreamcast game console.
.It Pa emips/
Machines based on Extensible MIPS.
.It Pa evbarm/
ARM based evaluation boards.
.It Pa evbmips/
MIPS based evaluation boards.
.It Pa evbppc/
PowerPC based evaluation boards and appliances.
.It Pa evbsh3/
SH3/SH4 based evaluation boards.
.It Pa ews4800mips/
NEC's MIPS based EWS4800 workstations.
.It Pa hp300/
Hewlett-Packard 9000/300 and 400 680x0-based workstations.
.It Pa hppa/
Hewlett-Packard 9000/700 and 9000/800 HPPA based workstations.
.It Pa hpcarm/
StrongARM based WinCE PDA machines.
.It Pa hpcmips/
MIPS based WinCE PDA machines.
.It Pa hpcsh/
Hitachi SH3/4 based WinCE PDA machines.
.It Pa hppa/
HPPA processor general support.
.It Pa i386/
32-bit 80x86-based IBM PCs and clones.
.It Pa ibmnws/
IBM Network Station 1000.
.It Pa iyonix/
Castle Technology's Iyonix ARM based PCs.
.It Pa luna68k/
Omron Tateishi Electric's 680x0-based LUNA workstations.
.It Pa m68k/
680x0 processor general support.
.It Pa mac68k/
Apple Macintosh with 68k CPU.
.It Pa macppc/
Apple Power Macintosh and clones.
.It Pa mips/
MIPS processor general support.
.It Pa mipsco/
MIPS Computer Systems Inc. family of workstations and servers.
.It Pa mmeye/
Brains Inc. SH3 based mmEye multimedia server.
.It Pa mvme68k/
Motorola MVME 680x0-based SBCs.
.It Pa mvmeppc/
Motorola PowerPC VME SBCs.
.It Pa netwinder/
StrongARM based NetWinder machines.
.It Pa news68k/
Sony's 680x0-based NEWS workstations.
.It Pa newsmips/
Sony's MIPS-based NEWS workstations.
.It Pa next68k/
NeXT 68k "black" hardware.
.It Pa ofppc/
Open Firmware PowerPC workstations.
.It Pa playstation2/
SONY PlayStation 2.
.It Pa pmax/
Digital MIPS-based DECstations and DECsystems.
.It Pa powerpc/
PowerPC processor general support.
.It Pa prep/
PReP (PowerPC Reference Platform) and CHRP (Common Hardware Reference
Platform) machines.
.It Pa sandpoint/
Motorola Sandpoint reference platform.
.It Pa sbmips/
Broadcom/SiByte evaluation boards.
.It Pa sgimips/
Silicon Graphics' MIPS-based workstations.
.It Pa sh3/
SH3/SH4 processor general support.
.It Pa shark/
Digital DNARD ("Shark").
.It Pa sparc/
Sun Microsystems SPARC (32-bit) and UltraSPARC (in 32-bit mode).
.It Pa sparc64/
Sun Microsystems UltraSPARC (in native 64-bit mode).
.It Pa sun2/
Sun Microsystems 68010-based Sun 2 architecture.
.It Pa sun3/
Sun Microsystems 68020/68030-based Sun 3/3x architecture.
.It Pa sun68k/
680x0-based Sun architecture general support.
.It Pa vax/
Digital VAX.
.It Pa x68k/
Sharp X680x0 680x0-based workstations.
.It Pa x86/
General support for PC/AT compatibles with ia32 or x86_64 CPUs.
.It Pa xen/
The Xen virtual machine monitor.
.It Pa zaurus/
Sharp C3x00 Arm based PDA.
.El
.Pp
.It Pa compat/
Kernel compatibility modules directory.
.Pp
.Bl -tag -width "ossaudio/" -compact
.It Pa common/
Common compatibility routines, old
.Bx 4
and
.Nx
routines.
.It Pa freebsd/
Support for
.Fx
binaries; see
.Xr compat_freebsd 8 .
.It Pa hpux/
Support for 68000 HP-UX binaries.
.It Pa ibcs2/
Support for Intel Binary binaries.
.It Pa linux/
Support for Linux binaries; see
.Xr compat_linux 8 .
.It Pa m68k4k/
Support for 4KB page 68000 binaries.
.It Pa netbsd32/
Support for
.Nx
32-bit binaries on 64 bit platforms with compatible CPU families.
.It Pa osf1/
Support for Digital
.Ux
(formerly OSF/1) binaries.
.It Pa ossaudio/
Support for OSS audio.
.It Pa sunos/
Support for SunOS 4.x binaries; see
.Xr compat_sunos 8 .
.It Pa svr4/
Support for System V Release 4 binaries; see
.Xr compat_svr4 8 .
.It Pa ultrix/
Support for ULTRIX binaries.
.It Pa vax1k/
Support for older VAX binaries that started on a 1 KB boundary.
.El
.Pp
.It Pa conf/
Architecture independent configuration directory.
.It Pa crypto/
Cryptographic kernel source, which may have import or export restrictions.
.It Pa ddb/
In-kernel debugger.
.It Pa dev/
Architecture independent device support.
.It Pa fs/
File systems.
See also
.Pa ufs/
and
.Pa miscfs/ .
.Bl -tag -width "filecorefs/" -compact
.It Pa adosfs/
AmigaDOS file-system support; see
.Xr mount_ados 8 .
.It Pa cd9660/
Support for the ISO-9660 file system; see
.Xr mount_cd9660 8 .
.It Pa filecorefs/
Support for the Acorn RISC OS filecore file system; see
.Xr mount_filecore 8 .
.It Pa msdosfs/
MS-DOS file system; see
.Xr mount_msdos 8 .
.It Pa ntfs/
NTFS file system support; see
.Xr mount_ntfs 8 .
.It Pa ptyfs/
Pseudo-terminal device file system; see
.Xr mount_ptyfs 8 .
.It Pa smbfs/
SMB/CIFS file system support; see
.Xr mount_smbfs 8 .
.It Pa union/
Union file system; see
.Xr mount_union 8 .
.El
.It Pa gdbscripts/
Support for accessing kernel structures from within the debugger
.Xr gdb 1 .
.It Pa ipkdb/
Support for kernel debugging over the network.
.Pp
.It Pa kern/
Primary kernel source code.
.It Pa lib/
Libraries supporting the kernel.
.Pp
.Bl -tag -width "libkern/" -compact
.It Pa libkern/
C library routines used in the kernel.
.It Pa libsa/
Machine-independent standalone library, used by boot loaders.
.It Pa libz/
Compression library.
.El
.Pp
.It Pa miscfs/
More file systems.
.Pp
.Bl -tag -width "deadfs/" -compact
.It Pa deadfs/
Kernel only dead file system.
.It Pa fdesc/
File descriptor file system; see
.Xr mount_fdesc 8 .
.It Pa fifofs/
POSIX FIFO (named pipe) support.
.It Pa genfs/
Generic file system code that supports other file systems.
.It Pa kernfs/
Kernel namespace file system; see
.Xr mount_kernfs 8 .
.It Pa nullfs/
Loop back file system; see
.Xr mount_null 8 .
.It Pa overlay/
Overlay file system; see
.Xr mount_overlay 8 .
.It Pa procfs/
Process file system; see
.Xr mount_procfs 8 .
.It Pa specfs/
Support for block and character special files.
.It Pa syncfs/
Kernel trickle sync algorithm.
.It Pa umapfs/
User and group re-mapping file system; see
.Xr mount_umap 8 .
.El
.Pp
.It Pa net/
Miscellaneous networking support.
.It Pa netatalk/
AppleTalk networking support.
.It Pa netinet/
IP networking support.
.It Pa netinet6/
IPv6 networking support.
.It Pa netkey/
Key database for IPsec networking support.
.It Pa netnatm/
ATM networking support.
.It Pa nfs/
NFS (network file system) support, both client and server.
.It Pa stand/
Kernel standalone support.
.It Pa sys/
Kernel (and system) include files.
.It Pa ufs/
Still more file systems.
.Pp
.Bl -tag -width "ffs/" -compact
.It Pa chfs/
A FFS-based file system for use on raw flash.
.It Pa ext2fs/
The Linux ext2 file system.
.It Pa ffs/
The Berkeley Fast File System.
.It Pa lfs/
The Berkeley log-structured file system.
.It Pa mfs/
The in-memory file system.
.It Pa ufs/
Shared
.Ux
file system support.
.El
.It Pa uvm/
UVM virtual memory system.
.El
.It Pa tests/
Source for test programs in
.Pa /usr/tests .
.It Pa usr.bin/
Source for utilities/files in
.Pa /usr/bin .
.It Pa usr.sbin/
Source for utilities/files in
.Pa /usr/sbin .
.El
.It Pa /var/
Multi-purpose log, temporary, transient, and spool files.
.Pp
.Bl -tag -width "preserve/" -compact
.It Pa account/
System accounting files.
.Pp
.Bl -tag -width "acct" -compact
.It Pa acct
Execution accounting file;
see
.Xr acct 5 .
.El
.Pp
.It Pa at/
Timed command scheduling files;
see
.Xr at 1 .
.It Pa backups/
Miscellaneous backup files, largely of files found in
.Pa /etc .
.It Pa chroot/
Home directories of applications which are run in a
.Xr chroot 8
.Dq cage .
.It Pa crash/
System (kernel) crash dumps; see
.Xr savecore 8 .
.It Pa cron/
Scheduled commands configuration files; see
.Xr cron 8
and
.Xr crontab 5 .
.It Pa db/
Miscellaneous automatically generated system-specific database files,
and persistent files used in the maintenance of third party software.
.Pp
.Bl -tag -width "monthly.out" -compact
.It Pa pkg
Default location for metadata related to third party software
packages.
See
.Xr pkg_add 1
for more details of the
.Nx
Packages Collection, or pkgsrc.
.El
.Pp
.It Pa games/
Miscellaneous game status, log, and high score files.
.It Pa heimdal/
Kerberos 5 KDC database; see
.Xr kdc 8 .
.It Pa log/
Miscellaneous system log files.
.Pp
.Bl -tag -width "monthly.out" -compact
.It Pa amd.*
.Xr amd 8
logs.
.It Pa daily.out
Output of the last run of the
.Pa /etc/daily
script.
.It Pa ftp.*
.Xr ftp 1
logs.
.It Pa kerberos.*
.Xr kerberos 8
logs.
.It Pa lastlog
System last-time-logged-in database; see
.Xr utmp 5 .
.It Pa lpd-errs.*
Printer daemon error logs; see
.Xr lpd 8 .
.It Pa maillog.*
.Xr sendmail 1
and
.Xr postfix 1
(and other mail-related)
log files.
.It Pa messages.*
General system information log.
.It Pa monthly.out
Output of the last run of the
.Pa /etc/monthly
script.
.It Pa secure
Sensitive security information log.
.It Pa sendmail.st
.Xr sendmail 1
statistics.
.It Pa timed.*
.Xr timed 8
logs.
.It Pa weekly.out
Output of the last run of the
.Pa /etc/weekly
script.
.It Pa wtmp
Login and logout log;
see
.Xr utmp 5 .
.It Pa wtmpx
Another login and logout log; see
.Xr utmpx 5 .
.El
.Pp
.It Pa mail/
User e-mail inboxes.
.It Pa msgs/
System messages; see
.Xr msgs 1 .
.\" since we use nvi (now called vi) this isn't the place any more, is it?
.It Pa preserve/
Temporary home of files preserved after an accidental death of
.Xr ex 1
or
.Xr vi 1 .
.It Pa quotas/
File system quota information.
(Legacy.)
.It Pa run/
System information files, rebuilt after each reboot.
.Pp
.Bl -tag -width "utmp" -compact
.It Pa dmesg.boot
A dump from
.Xr dmesg 8
taken at boot time.
.It Pa utmp
Database of currently logged in users; see
.Xr utmp 5 .
.It Pa utmpx
Another database of currently logged in users; see
.Xr utmpx 5 .
.El
.Pp
.It Pa rwho/
Rwho data files; see
.Xr rwhod 8 ,
.Xr rwho 1 ,
and
.Xr ruptime 1 .
.It Pa spool/
Miscellaneous printer and mail system spooling directories.
.Pp
.Bl -tag -width "postfix/" -compact
.It Pa ftp/
Commonly
.Dq ~ftp ,
the anonymous ftp root directory; see
.Xr ftpd 8 .
.It Pa mqueue/
Sendmail mail queue;
see
.Xr sendmail 1 .
.It Pa news/
Network news archival and spooling directories.
.It Pa output/
Printer spooling directories.
.It Pa postfix/
Postfix mail queue;
see
.Xr postfix 1 .
.El
.Pp
.It Pa tmp/
Temporary files that are not discarded between system reboots.
.Pp
.Bl -tag -width "vi.recover/" -compact
.It Pa vi.recover/
Recovery directory for new (current)
.Xr vi 1 .
.El
.Pp
.It Pa yp/
Databases and configuration for the NIS (YP) system; see
.Xr nis 8 .
.El
.El
.Sh SEE ALSO
.Xr apropos 1 ,
.Xr ls 1 ,
.Xr whatis 1 ,
.Xr whereis 1 ,
.Xr which 1 ,
.Xr paths 3
.Sh HISTORY
A
.Nm
manual page appeared in
.At v7 .
