NetBSD/src/share/man/man7/intro.7
.\"	$NetBSD: intro.7,v 1.21 2012/07/01 16:09:12 perry Exp $
.\"
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)intro.7	8.1 (Berkeley) 6/5/93
.\"
.Dd March 18, 2011
.Dt INTRO 7
.Os
.Sh NAME
.Nm intro
.Nd miscellaneous information pages
.Sh DESCRIPTION
This section contains miscellaneous documentation, including:
.Bl -tag -width "mdoc.samples(7)" -offset indent
.It Xr ascii 7
map of
.Tn ASCII
character set
.It Xr c 7
the C programming language
.It Xr environ 7
user environment
.It Xr glob 7
shell-style pattern matching
.\" .It Sy eqnchar
.\" special character definitions for eqn
.It Xr hier 7
file system hierarchy in
.Nx
.It Xr hostname 7
host name resolution description
.It Xr mailaddr 7
mail addressing description
.\" .It Sy man
.\" macros to typeset manual pages
.It Xr mdoc 7
macros for typesetting
.Nm \-mdoc
style manual pages
.It Xr mdoc.samples 7
tutorial for writing BSD manuals with
.Nm \-mdoc
.\" .It Sy \&me
.\" macros for formatting papers
.\" .It Sy \&ms
.\" macros for formatting manuscripts
.It Xr module 7
kernel modules
.It Xr nls 7
overview of national language support
.It Xr operator 7
C operator precedence and order of evaluation
.It Xr orders 7
orders of magnitude
.It Xr pkgsrc 7
the
.Nx
packages collection
.It Xr release 7
layout of
.Nx
releases and snapshots
.It Xr rfc6056
udp port randomization algorithms
.It Xr script 7
how interpreter scripts are executed
.It Xr security 7
security features available in
.Nx
.It Xr setuid 7
checklist for security and setuid programs
.It Xr signal 7
available signals under
.Nx
.It Xr sticky 7
sticky bit
.Pq Dv S_ISVTX
handling
.It Xr symlink 7
symbolic link handling
.It Xr sysctl 7
system information variables in
.Nx
.It Xr tests 7
.Nx
test suite
.\" .It Sy term
.\" conventional names for terminals
.El
.Sh HISTORY
The
.Xr intro 7
manual page appeared in
.Bx 4.2 .
