NetBSD/src/share/man/man7/operator.7
.\"	$NetBSD: operator.7,v 1.12 2017/07/03 21:30:59 wiz Exp $
.\"
.\" Copyright (c) 1989, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)operator.7	8.1 (Berkeley) 6/9/93
.\"
.Dd January 18, 2011
.Dt OPERATOR 7
.Os
.Sh NAME
.Nm operator
.Nd C and C++ operator precedence and associativity
.Sh DESCRIPTION
.Bl -column -offset indent \
    ".Li \&! ~ ++ \-\- \- (type) * & sizeof new delete" \
    ".Sy Associativity"
.\"
.It Sy Operator \
 Ta Sy Associativity
.\"
.\" XXX: For some reason if anything but tab follows the last dot
.\" XXX: the space before it is lost and we get ->. in the output.
.\" XXX: My troff fu is weak, just work around with explicit \<space>.
.It Li \&() [] \->\ \. \
 Ta left to right
.\"
.It Li \&! ~ ++ \-\- \- (type) * & sizeof new delete \
 Ta right to left
.\"
.It Li \&\->* .* \
 Ta left to right
.\"
.It Li \&* / % \
 Ta left to right
.\"
.It Li \&+ \- \
 Ta left to right
.\"
.It Li \&<< >> \
 Ta left to right
.\"
.It Li \&< <= > >= \
 Ta left to right
.\"
.It Li \&== != \
 Ta left to right
.\"
.It Li \&& \
 Ta left to right
.\"
.It Li \&^ \
 Ta left to right
.\"
.It Li \&| \
 Ta left to right
.\"
.It Li \&&& \
 Ta left to right
.\"
.It Li \&|| \
 Ta left to right
.\"
.It Li \&?: \
 Ta right to left
.\"
.It Li \&= += \-= *= /= %= <<= >>= &= ^= |= throw \
 Ta right to left
.\"
.It Li \&?: No (C++, third operand)\
 Ta right to left
.\"
.It Li \&, \
 Ta left to right
.\"
.El
.Sh FILES
.Bl -tag -width ".Pa /usr/share/misc/operator" -compact
.It Pa /usr/share/misc/operator
.El
.Sh SEE ALSO
.Xr iso646 3
