NetBSD/src/share/man/man7/packages.7
.\"	$NetBSD: packages.7,v 1.98 2007/03/02 05:58:55 wiz Exp $
.\"
.\" from: NetBSD: bsd.pkg.mk,v 1.89 1998/06/01 21:30:10 hubertf Exp
.\"
.\"	This file is in the public domain.
.\"
.Dd March 2, 2007
.Dt PACKAGES 7
.Os
.Sh NAME
.Nm packages
.Nd
.Nx
user package variables
.Sh DESCRIPTION
.Em This manual page is obsolete .
.Em Please refer the pkgsrc guide at
.Pa /usr/pkgsrc/doc/pkgsrc.txt
.Em or
.Pa /usr/pkgsrc/doc/pkgsrc.html .
.Em The contents of this manual page will be moved there as time permits .
.Pp
This manual page describes the variables that users of the
.Nx
packages system can set to alter the configuration of the package system,
and individual packages.
.Sh PACKAGE SPECIFIC VARIABLES
This section documents variables that typically apply to an individual
package.
Non-Boolean variables without defaults are *mandatory*.
.Bl -tag -offset indent -width XXXXXXXX
.It PKGDIR
A direction containing any package creation files.
The default is
.Pa ${.CURDIR}/pkg .
.It PKG_DBDIR
Where package installation is recorded.
The default is
.Pa /var/db/pkg .
.It FORCE_PKG_REGISTER
If set, it will overwrite any existing package registration information in
.Pa ${PKG_DBDIR}/${PKGNAME} .
.It NO_MTREE
If set, will not invoke mtree from
.Pa bsd.pkg.mk
from the
.Dq install
target.
.It MTREE_FILE
The name of the mtree file.
The default is
.Pa /etc/mtree/BSD.x11.dist
if
.Dv USE_IMAKE
or
.Dv USE_X11BASE
is set, or
.Pa /etc/mtree/BSD.pkg.dist
otherwise.
.It NO_BUILD
Use a dummy (do-nothing) build target.
.It NO_CONFIGURE
Use a dummy (do-nothing) configure target.
.It NO_INSTALL
Use a dummy (do-nothing) install target.
.It NO_PACKAGE
Use a dummy (do-nothing) package target.
.It SCRIPTS_ENV
Additional environment variables passed to xmkmf.
.El
.Sh SPECIAL VARIABLES
Variables to change if you want a special behavior:
.Bl -tag -offset indent -width XXXXXXXX
.It PKG_VERBOSE
If set, print out more information about the automatic manual
page handling, and package deletion (see the
.Dq install ,
.Dq deinstall
and
.Dq update
targets),
and also sets PATCH_DEBUG as well.
.El
.Sh PACKAGE TARGETS
.Bl -tag -offset indent -width XXXXXXXX
.It mirror-distfiles
Mirror the distfile(s) if they are freely re-distributable.
If
.Dv NO_SRC_ON_FTP
is set in the package's Makefile (usually to
.Pa ${RESTRICTED} )
then that reason is printed, and the distfile is not mirrored.
.El
.Pp
Default sequence for
.Dq all
is:  fetch checksum extract patch configure build.
.Pp
NEVER override the
.Dq regular
targets unless you want to open a major can of worms.
.Sh SEE ALSO
.Xr make 1 ,
.Xr mk.conf 5 ,
.Pa ${PKGSRCDIR}/mk/defaults/mk.conf
and
.Rs
.%T "Documentation on the NetBSD Package System"
.Re
.Pa ${PKGSRCDIR}/doc/pkgsrc.txt
.Sh HISTORY
This manual page is based upon the comments in the
.Pa bsd.pkg.mk
file, as distributed with
.Nx .
The sources to this are far
and varied across all free BSD projects.
