NetBSD/src/sys/rump/librump/rumpvfs/rumpfs.4
.\"     $NetBSD: rumpfs.4,v 1.1.18.2 2017/12/03 11:39:17 jdolecek Exp $
.\"
.\" Copyright (c) 2014 Antti Kantee.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 3, 2014
.Dt RUMPFS 4
.Os
.Sh NAME
.Nm rumpfs
.Nd rump kernel root file system
.Sh LIBRARY
rump kernel (librumpvfs, \-lrumpvfs)
.Sh DESCRIPTION
.Nm
is a simple in-memory file system for rump kernels.
It is automatically mounted as the root file system of a rump kernel
at boot time, provided that the VFS faction is configured into the rump
kernel instance.
.Pp
The three main features of
.Nm
are:
.Bl -enum -offset indent
.It
providing a hook for accessing host files via the
.Xr rump_etfs 3
interfaces.
.It
supporting enough of file and directory interfaces to facilitate simple
operations such as hosting config files or creating mount points.
.It
being small and lightweight so as to keep a barebones rump kernel
lightweight.
.El
.Pp
.Nm
is not intended for hosting large files or big directory
hierarchies.
If faced with such a use case, mounting a tmpfs file system
inside the rump kernel is recommended.
.Sh SEE ALSO
.Xr rump 3
.Sh HISTORY
.Nm
first appeared in
.Nx 6.0 .
