NetBSD/src/sbin/dmctl/dmctl.8
.\"     $NetBSD: dmctl.8,v 1.1 2011/02/08 03:20:15 haad Exp $
.\"
.\" Copyright (c) 2004,2009 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Adam Hamsik.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.Dd Januar 23, 2011
.Dt DMCTL 8
.Os
.Sh NAME
.Nm dmctl
.Nd "Manipulate device-mapper driver command"
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
work with device-mapper kernel driver it can send/receive information and
commands from dm driver.
.Bl -column -offset indent "suspend" "Switch active and passive tables for"
.Ii Li version Ta Print driver and lib version.
.It Li targets Ta List available kernel targets.
.It Li create Ta Create device with [dm device name].
.It Li ls Ta List existing dm devices.
.It Li info Ta Get info about device with [dm device name].
.It Li rename Ta Rename device with [dm device name] to [dm device new name].
.It Li remove Ta Remove device with [dm device name].
.It Li resume Ta Resume IO on dm device [dm device name].
.It Li suspend Ta Suspend IO on dm device [dm device name].
.It Li deps Ta Print physical dependiences for dm device [dm device name].
.It Li reload Ta Switch active and passive tables for [dm device name].
.It Li status Ta Print status for device with [dm device name].
.It Li table Ta Print active table for device with [dm device name].
.El
.Sh SEE ALSO
.Xr dm 4 ,
.Xr libdm 3
.Sh HISTORY
The
.Nm
was written and contributed to
.Nx
by Adam Hamsik and first appeared in
.Nx 6.0 .
