NetBSD/src/share/man/man8/man8.i386/boot.8
.\"	$NetBSD: boot.8,v 1.7 1998/02/06 06:14:58 perry Exp $
.\"
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software written and contributed
.\" to Berkeley by William Jolitz.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_i386.8	8.2 (Berkeley) 4/19/94
.\"
.Dd March 13, 1997
.Dt BOOT 8 i386
.Os
.Sh NAME
.Nm boot
.Nd
system bootstrapping procedures
.Sh DESCRIPTION
.Sy Power fail and crash recovery.
Normally, the system will reboot itself at power-up or after crashes.
An automatic consistency check of the file systems will be performed,
and unless this fails, the system will resume multi-user operations.
.Pp
.Sy Cold starts.
The 386
.Tn "PC AT"
clones attempt to boot the floppy disk drive A (otherwise known as drive
0) first, and failing that, attempt to boot the hard disk C (otherwise
known as hard disk controller 1, drive 0).
The
.Nx
bootblocks are loaded and started either by the BIOS, or by
a boot selector program (such as OS-BS, BOOTEASY, or the OS/2 Boot Menu)
.Pp
Once running, a prompt similar to the following will appear.
.Bd -unfilled -offset indent
>> NetBSD BIOS Boot, revision 2.2
>> (user@buildhost, builddate)
>> Memory: 637/15360 k
Use hd1a:netbsd to boot sd0 when wd0 is also installed
Press return to boot now, any other key for boot menu
booting wd0a:netbsd - starting in 5
.Ed
.Pp
After a countdown the system image listed will be loaded. (In the
above example, it will be
.Dq Li wd0a:netbsd
which is the file
.Nm netbsd
on partition 
.Dq a
of the
.Nx
MBR partition of the first non-SCSI hard disk.)
.Pp
The default disk will be set to the disk that the boot loader was
loaded from.
To boot from an alternate disk, the full name of the device should
be given at the prompt. Alternate system images can be loaded by
just specifying the name of the image.
.Pp
The following list of supported devices may vary from installation to
installation:
.Bd -unfilled -offset indent
sd	SCSI disks on a controller recognized by the BIOS. The unit
	number is the BIOS device number.
wd	ST506, IDE, ESDI, RLL disks on a WD100[2367] or
	lookalike controller(s), as numbered by the BIOS.
hd	Hard disks as numbered by the BIOS.
fd	Floppy drives as numbered by the BIOS.
.Ed
.Pp
The
.Op Fl s
flag to the boot loader will bring the system up in single-user mode.
The
.Op Fl a
flag instructs the system to prompt for the location of the root filesystem
and the system crash dump device.
The
.Op Fl r
flag instructs the system to use the compiled in value for the root
device, not the device the system image was loaded from.
The
.Op Fl d
flag to the boot loader will bring the system up in debug mode.
Here it waits for a kernel debugger connect; see
.Xr ddb 4 .
.Pp
In an emergency, the bootstrap methods described in the
.Nx
installation notes for the i386 architecture
can be used to boot from floppy.
.Sh FILES
.Bl -tag -width /usr/mdec/biosboot.sym -compact
.It Pa /netbsd
system code
.It Pa /usr/mdec/biosboot.sym
boot block (not installed)
.It Pa /boot
boot block (installed).
.El
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr halt 8 ,
.Xr installboot 8 ,
.Xr reboot 8 ,
.Xr shutdown 8
.Sh BUGS
Hard disks are always accessed by BIOS functions. Unit numbers are
BIOS device numbers which might differ from numbering in the
.Nx
kernel or physical parameters (eg SCSI slave numbers). The distiction
into
.Dq sd
and
.Dq wd
devices at the bootloader level is meaningless and exists for
historical reasons.
