NetBSD/src/share/man/man8/man8.i386/boot_console.8
.\"	$NetBSD: boot_console.8,v 1.2 1998/01/09 08:04:43 perry Exp $
.\"
.Dd September 30, 1997
.Os
.Dt BOOT_CONSOLE 8 i386
.Sh NAME
.Nm boot_console
.Nd selection of a console device in the i386 bootloader

.Sh DESCRIPTION
The i386 bootloader selects a console device for its user interaction
and passes information about it to the
.Nx
kernel. The selection process is controlled by bootloader compile-time
options and system setup at the bootloader startup time.

.Pp
The compile-time options (to set in the bootloader's
.Dq Makefile
) are:
.Bl -ohang
.It Cd SUPPORT_SERIAL
enables support for serial input / output. If not set, the standard PC
keyboard / display is always used as console device and the following
options are meaningless.
.It Cd DIRECT_SERIAL
causes direct hardware access to be used for serial input / output.
With this option, software handshake (XON/XOFF) is used for
flow control. Without this option, BIOS functions are employed for
serial port handling, which require hardware handshake lines to
be completely wired.
.It Cd CONSPEED=integer
sets the baudrate for the serial console. This option has only an
effect together with the
.Dq Cd DIRECT_SERIAL
option above. Otherwise, the default setting of 9600 baud is used.
.It Cd COMCONS_KEYPRESS
If console autoselection is used (see below), require a character
input within 1 second after a space character is sent to the serial
line for a serial console device to be selected. If not set, only a simple
function check is done (and the hardware handshake is checked
if
.Dq Cd DIRECT_SERIAL
is not defined).
.El

The actual policy for the console selection is determined by the
argument to the console initialization function
.Fn initio int
which is called early in the bootloader's
.Fn main
function. The following are available:
.Bl -ohang
.It Fa CONSDEV_PC
Use the standard PC keyboard / display as console.
.It Fa CONSDEV_COM0 Li ... Fa CONSDEV_COM3
Use the serial port with the corresponding BIOS number as
console. If the port is not known to the BIOS, it falls back to
.Dq Fa CONSDEV_PC
\& .
(Note1: This feature can be deliberately used for console
selection if the BIOS allows to disable serial ports.)
(Note2: This works with the
.Dq Cd DIRECT_SERIAL
option too.)
.It Fa CONSDEV_AUTO
Auto-select the console. First the serial ports known to the BIOS
are probed. If output of a (space) character to the port succeeds,
and the conditions described under
.Dq Cd COMCONS_KEYPRESS
above are fulfilled, the port is used as console. If no serial port
passes the check,
.Dq Fa CONSDEV_PC
is used. The progress of the selection process is shown at the PC display
as digits corresponding to the serial port number currently probed.
.El

.Sh FILES
.Bl -tag -width xxx
.It Pa /src/sys/arch/i386/stand/{bios,dos,net}boot/Makefile
.It Pa /src/sys/arch/i386/stand/{bios,dos,net}boot/main.c
.El

.Sh SEE ALSO
.Xr console 4

.Sh BUGS
There is generally no non-volatile storage available on the
PC platform. This requires autoselection methods which can
be inconvinient and / or unstable in some situations. The selection
policy should be adapted to the local hardware configuration, which
might require code changes.
.Pp
The serial communication parameters (bytesize, parity, stopbits)
are not setable. In any case,
.Dq 8N1
is used.
