NetBSD/src/share/man/man8/man8.i386/dosboot.8
.Dd June 20, 1997
.Os
.Dt DOSBOOT 8 i386
.Sh NAME
.Nm dosboot
.Nd boot NetBSD/i386 from DOS

.Sh SYNOPSIS
.Nm dosboot
.Op Fl u
.Op Fl c Ar <command>
.Op Fl i
.Op Ar path Op Fl bootopts

.Sh DESCRIPTION
.Nm
is a program running under DOS which allows to load and start NetBSD/i386.
Per default, it boots a file with name
.Pa NETBSD
in the current DOS directory.
.Pp
The recognized options are
.Bl -tag -width bootopts
.It Fl u
Boot from a UFS instead of a DOS file system.
.It Fl c
Execute <command> (see below).
.It Fl i
Enter interactive mode.
.Nm
will present a prompt, allowing input of commands (see below).
.Pp
.It path
Specifies the kernel file. In DOS mode (default) a normal DOS
filename (with or without drive specification) is accepted.
In UFS mode (after
.Fl u
or after a "mode ufs" command), a path in a
.Nx
filesystem
is expected. Per default, the file is looked up in partition 'a' of
the first harddisk. Another device or partition can be specified
by prepending a block device name in terms of
.Nx ,
followed
by a colon (see 
.Xr boot 8
and examples).
.It bootopts
Flags passed to the kernel, see
.Xr boot 8 .
.El

.Pp
The commands accepted after the
.Fl c
flag or in interactive mode are:
.Bl -tag -width help
.It help
Print an overview about commands and arguments.
.It ls Op path
Print a directory listing of path, containing inode number, filename
and file type. This command works in UFS mode only. path can
contain a device specification.
.It quit
Leave the
.Nm
program and exit to DOS.
.It boot Op path Op Fl bootopts
Boot
.Nx .
.It mode { dos | ufs }
Switch filesystem type.
.El

.Sh EXAMPLES
To boot a
.Nx
kernel located on DOS drive D, one would issue:
.Bd -literal -offset indent
dosboot D:\\NODOS\\NETBSD
.Ed
.Pp
To boot from a
.Nx
floppy into single user mode, type eg:
.Bd -literal -offset indent
dosboot -u fd0a:netbsd -s
.Ed

.Sh BUGS
.Nm
assumes that the processor is in real mode at startup. It does not work
well in the presence of DOS extenders and memory managers.
.Pp
In UFS mode, files can only be loaded from devices known to the BIOS.
The device names do not necessarily comply with the names later
used by the booted
.Nx
kernel.
.Pp
In DOS mode, no useful boot device specification is passed to
.Nx .
It is necessary to have the root device hardwired into the kernel
configuration or to enter it manually.
.Sh HISTORY
The NetBSD/i386
.Nm
command first appeared in
.Nx 1.3 .
