NetBSD/src/share/man/man8/man8.i386/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.i386/MAKEDEV and
.\" *** src/share/man/man8/MAKEDEV.8.template
.\" ***
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\" $NetBSD: MAKEDEV.8,v 1.21 2001/06/26 02:11:57 hubertf Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 30, 1996
.Dt MAKEDEV 8 i386
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm
.Ar special Op Ar ...

.Nm
.Ar device Op Ar ...
.Sh DESCRIPTION
.Nm
is used to create system and device special files.
As arguments it takes the names of known devices, like
.Ar sd0 ,
or of special targets, like
.Pa all
or
.Pa std ,
which create a collection of device special files.
.Pp
The script is in
.Pa /dev/MAKEDEV
and must be called from the
.Pa /dev
directory.
.Pp
The special targets supported on
.Nx Ns / Ns i386
are:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
Makes all known devices, including local devices. Tries to make the 'standard' number of each type.
.It Ar floppy
Devices to be put on install floppies
.It Ar ramdisk
Devices to be put into INSTALL kernel ramdisks.
.It Ar std
Standard devices
.It Ar local
Configuration specific devices
.It Ar usbs
Make USB devices
.It Ar isdn
Make ISDN devices
.El
.Pp
Please note that any hash marks
.Pq Dq #
in the following list of supported device targets must be replaced by
digits when calling
.Nm "" :
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar wt#
QIC-interfaced (e.g. not SCSI) 3M cartridge tape, see
.Xr w\&t 4
. It Ar st#
SCSI tapes, see
.Xr s\&t 4
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar wd#
``winchester'' disk drives (ST506,IDE,ESDI,RLL,...), see
.Xr w\&d 4
. It Ar fd#
``floppy'' disk drives (3 1/2``, 5 1/4''), see
.Xr f\&dc 4
. It Ar sd#
SCSI disks, see
.Xr s\&d 4
. It Ar cd#
SCSI or ATAPI CD-ROM, see
.Xr c\&d 4
. It Ar mcd#
Mitsumi CD-ROM, see
.Xr m\&cd 4
. It Ar vnd#
``file'' pseudo-disks, see
.Xr v\&nd 4
. It Ar md#
Memory pseudo-disk devices, see
.Xr m\&d 4
. It Ar ccd#
Contatenated disk devices, see
.Xr c\&cd 4
. It Ar raid#
RAIDframe disk devices, see
.Xr r\&aid 4
. It Ar ld#
Logical disk devices (e.g., hardware RAID), see
.Xr l\&d 4
. It Ar ed#
PS/2 ESDI disk devices
. El
.It Console ports:
. Bl -tag -width 0123456789 -compact
. It Ar ttyv0
Pccons
. It Ar ttyE#
Wscons
. El
.It Pointing devices:
. Bl -tag -width 0123456789 -compact
. It Ar mms#
Microsoft bus mouse, see
.Xr m\&ms 4
. It Ar lms#
Logitech bus mouse, see
.Xr l\&ms 4
. It Ar pms#
PS/2 mouse, see
.Xr p\&ms 4
. It Ar wsmouse#
Wscons mouse events, see
.Xr w\&smouse 4
. El
.It Keyboard devices:
. Bl -tag -width 0123456789 -compact
. It Ar wskbd#
Wscons keyboard events, see
.Xr w\&skbd 4
. El
.It Terminal ports:
. Bl -tag -width 0123456789 -compact
. It Ar com#
Standard PC COM ports, see
.Xr c\&om 4
. It Ar tty#
Alias for PC COM ports, this is what the system really wants, see
.Xr t\&ty 4
. It Ar ttyCZ#
Cyclades-Z multiport serial boards. Each ``unit'' makes 64 ports.
. It Ar ttyCY#
Cyclom-Y multiport serial boards. Each ``unit'' makes 32 ports.
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr p\&ty 4
. El
.It Printers:
. Bl -tag -width 0123456789 -compact
. It Ar lpt#
Stock lp, see
.Xr l\&pt 4
. It Ar lpa#
Interruptless lp
. El
.It USB devices:
. Bl -tag -width 0123456789 -compact
. It Ar usb#
USB control devices, see
.Xr u\&sb 4
. It Ar uhid#
USB generic HID devices, see
.Xr u\&hid 4
. It Ar ulpt#
USB printer devices, see
.Xr u\&lpt 4
. It Ar ugen#
USB generic devices, see
.Xr u\&gen 4
. It Ar urio#
USB Diamond Rio 500 devices, see
.Xr u\&rio 4
. It Ar uscanner#
Scanners, see
.Xr u\&scanner 4
. It Ar ttyU#
USB modems
. El
.It ISDN devices:
. Bl -tag -width 0123456789 -compact
. It Ar i4b
Comunication between userland isdnd and kernel
. It Ar i4bctl
Control device
. It Ar i4brbch#
Raw b-channel access
. It Ar i4btel#
Telephonie device
. It Ar i4btrc#
Trace device
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar fd
File descriptors, see
.Xr f\&dc 4
. It Ar bpf#
Packet filter, see
.Xr b\&pf 4
. It Ar ipl
IP filter
. It Ar random
Random number generator, see
.Xr r\&nd 4
. It Ar speaker
Pc speaker, see
.Xr s\&peaker 4
. It Ar lkm
Loadable kernel modules interface, see
.Xr l\&km 4
. It Ar audio#
Audio devices, see
.Xr a\&udio 4
. It Ar apm
Power management device, see
.Xr a\&pm 4
. It Ar tun#
Network tunnel driver, see
.Xr t\&un 4
. It Ar joy#
Joystick device, see
.Xr j\&oy 4
. It Ar satlink#
PlanetConnect satellite receiver driver
. It Ar scsibus#
SCSI busses, see
.Xr s\&csi 4 ,
.Xr s\&csictl 8
. It Ar ses#
SES/SAF-TE SCSI Devices, see
.Xr s\&es 4
. It Ar ss#
SCSI scanner, see
.Xr s\&s 4
. It Ar uk#
Unknown SCSI device, see
.Xr u\&k 4
. It Ar ch#
SCSI changer, see
.Xr c\&h 4
. It Ar cfs#
Coda file system device
. It Ar sysmon
System Monitoring hardware
. It Ar bktr
Brooktree 848/849/878/879 based TV cards, see
.Xr b\&ktr 4
. It Ar iop#
I2O IOP control interface, see
.Xr i\&op 4
. It Ar mlx#
Mylex DAC960 control interface, see
.Xr m\&lx 4
. It Ar altq
ALTQ control interface
. El
.El
.Sh FILES
.Bl -tag -width "/dev/MAKEDEV" -compact
.It Pa /dev
special device files directory
.It Pa /dev/MAKEDEV
script described in this man page
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.Sh BUGS
This man page is generated automatically from the same sources
as
.Pa /dev/MAKEDEV ,
in which the device files are not always sorted, which may result
in an unusual (non-alphabetical) order.
