NetBSD/src/share/man/man8/man8.i386/MAKEDEV.8
.\"	$NetBSD: MAKEDEV.8,v 1.8 1997/11/20 06:17:45 fair Exp $
.\"
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	8.1 (Berkeley) 6/5/93
.\"
.Dd October 30, 1996
.Dt MAKEDEV 8 i386
.Sh NAME
.Nm MAKEDEV ,
.Nm makedev
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar device_name Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create the common special
files.
.\"See
.\".Xr special (8)
.\"for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are two special devices,
.Ar std
and
.Ar local .
The former creates the standard devices for the architecture.
The latter is for devices specific to the local site, and
executes the shell file 
.Pa MAKEDEV.local .
.Pp
The
.Tn i386
supports the following devices.
Where a device name is followed by a hash sign
.Ql \&# ,
the hash sign
must be replaced by a unit number.
.Pp
.Bl -tag -width indent -compact
.It Ar std
the standard devices
.Pf ( Ar console ,
.Ar drum ,
.Ar fd/* ,
.Ar io ,
.Ar klog ,
.Ar kmem ,
.Ar mem ,
.Ar null ,
.Ar stderr ,
.Ar stdin ,
.Ar stdout ,
.Ar tty ,
.Ar zero ) .
.It Ar local
configuration specific devices.
.It Ar apm
power management device.
.It Ar audio
generic audio interface.
.It Ar bpf#
Berkeley packet filters.
.It Ar ccd#
``concatenated'' pseudo-disks.
.It Ar cd#
SCSI CD-ROM drives.
.It Ar ch#
SCSI changer devices.
.It Ar fd
file descriptors.
.It Ar fd#
``floppy'' disk drives (3 1/2, 5 1/4).
.It Ar joy#
joystick devices.
.It Ar klog
kernel logging device.
.It Ar lkm
loadable kernel module interface.
.It Ar random
Random number generator
.It Ar lms#
Logitech bus mice.
.It Ar lpa#
standard PC LPT ports (polled).
.It Ar lpt#
standard PC LPT ports (interrupt-driven).
.It Ar mcd#
Mitsumi CD-ROM drives.
.It Ar mms#
Microsoft bus mice.
.It Ar pms#
PS/2 mice.
.It Ar pty#
set of 16 master and slave pseudo terminals.
.It Ar rd#
``ramdisk'' pseudo-disks.
.It Ar sd#
SCSI disk drives.
.It Ar speaker
PC speaker.
.It Ar ss#
SCSI scanner devices.
.It Ar st#
SCSI tape drives.
.It Ar tty#
standard PC COM ports.
.It Ar ttyv#
virtual consoles.
.It Ar tun#
network tunnel driver.
.It Ar uk#
unknown SCSI devices.
.It Ar vnd#
``file'' pseudo-disks.
.It Ar wd#
``winchester'' disk drives (ST506, IDE, ESDI, RLL etc.).
.It Ar wt#
QIC-interfaced (e.g. not SCSI) 3M cartridge tape.
.El
.Sh FILES
.Bl -tag -width xxxx -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.\".Xr special (8)
