NetBSD/src/share/man/man8/man8.i386/pxeboot.8
.\"	$NetBSD: pxeboot.8,v 1.3 2003/03/27 12:30:07 drochner Exp $
.\"
.\" Copyright (c) 2003
.\" 	Matthias Drochner.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 20, 2003
.Os
.Dt PXEBOOT 8 i386
.Sh NAME
.Nm pxeboot
.Nd boot NetBSD/i386 through a PXE BIOS extension
.Sh DESCRIPTION
.Nm
is a
.Nx
boot program running on top of a PXE BIOS extension which is
provided by the motherboard or a plug-in network adapter.
.Pp
Booting a system through PXE is a two-stage process:
.Bl -enum -compact
.It
The PXE BIOS issues a BOOTP/DHCP request and fetches the
.Nx
.Nm
program using TFTP.
.It
The
.Nx
.Nm
program takes control.
An interactive mode is entered if the
user presses a key within five seconds.
After this time or after the user's
.Ic boot
command, another BOOTP/DHCP request is issued and the kernel
is loaded as specified in the BOOTP/DHCP reply.
To read the kernel file, the NFS (v2) or TFTP protocols can be used.
.El
.Pp
The BOOTP/DHCP request issued by the
.Nx
.Nm
program has the following special parameters:
.Bl -tag -width xxxx
.It Bootfile name
is set to the
.Va filename
argument on the
.Ic boot
command line typed in by the user (can be empty), or to
.Dq netbsd
in the non-interactive case.
.It DHCP Vendor class identifier tag
is set to
.Dq NetBSD:i386:libsa .
.El
.Pp
The BOOTP/DHCP server can use these fields to distinguish between
the various originators of requests (first and second PXE stage,
.Nx
kernel), and to control conditional behaviour depending on the
user's command line input to the
.Nm
program, e.g. to support alternative
.Nx
installations on one machine.
.Pp
In addition to the standard network interface configuration,
the following fields in the BOOTP/DHCP reply are interpreted:
.Bl -tag -width xxxx
.It Bootfile name
specifies the filename of the
.Nx
kernel to be booted, and the protocol to be used.
If the bootfile name contains a colon, the preceding part is used
as protocol specification.
Available options are
.Dq nfs
and
.Dq tftp .
.It Swap server
can be used to override the
.Dq server IP address
if NFS is used to access the kernel.
This matches the behaviour of the
.Nx
kernel to access its root file system on NFS.
This way, different TFTP and NFS servers can be communicated to
the BOOTP/DHCP client.
(It is actually a deficiency of the BOOTP/DHCP protocol to
provide a
.Dq root path
field but no corresponding IP address.)
.It Root path
is used as path to be mounted in the NFS case to access the kernel
file, matching the
.Nx
kernel's behaviour.
.El
.Pp
The commands accepted in interactive mode are:
.\" NOTE: much of this text is duplicated in boot.8; please try to
.\" keep both files synchronized.
.Bl -tag -width 04n -offset 04n
.It Xo Ic boot
.Op Va filename
.Op Fl adqsv
.Xc
Boot
.Nx .
See
.Cm boot
in
.Xr boot 8
for full details.
.It Ic help
Print an overview about commands and arguments.
.It Ic quit
Leave the
.Nm
program.
.El
.Sh EXAMPLES
The following
.Pa dhcpd.conf
entry shows how the PXE ROM can be told to load the
.Nx
.Nm
program and how different kernels can be loaded depending on
the user's input on the
.Nm
command line.
It is assumed that the TFTP server is the same as the DHCP server
(unless a
.Em next-server
is specified somewhere else in
.Pa dhcpd.conf ),
and that the NFS server for the root file system is
.Em mynfsserver .
(Note that
.Em swap-server:root-path
is only used in the NFS case and by the
.Nx
kernel to mount the root file system.)
.Bd -literal
host myhost {
    hardware ethernet 00:00:00:00:00:00;
    fixed-address myhost;
    option host-name "myhost";
    if substring (option vendor-class-identifier, 0, 9) = "PXEClient" {
        filename "pxeboot_ia32.bin";
    } elsif filename = "tftp" {
        filename "tftp:netbsd.myhost";
    } else {
        option swap-server mynfsserver;
        option root-path "/export/myhost";
        if filename = "generic" {
            filename "gennetbsd";
        } else {
            filename "netbsd";
        }
    }
}
.Ed
.Sh SEE ALSO
.Xr boot 8 ,
.Xr dhcpd 8
.Sh HISTORY
The
.Nx Ns Tn /i386
.Nm
command first appeared in
.Nx 1.6 .
.Sh BUGS
If an error is encountered while reading the
.Nx
kernel file or if its file format wasn't recognized, it is
impossible to retry the operation because the PXE network
stack is already removed from the system.
