NetBSD/src/usr.sbin/quotarestore/quotarestore.8
.\"	$NetBSD: quotarestore.8,v 1.1 2012/02/13 01:35:09 dholland Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by David A. Holland.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 11, 2012
.Dt QUOTARESTORE 8
.Os
.Sh NAME
.Nm quotarestore
.Nd restore dumped quota information to a file system volume
.Sh SYNOPSIS
.Nm
.Op Fl d
.Ar file-system
.Op Ar dump-file
.Sh DESCRIPTION
The
.Nm
program restores dumped quota information to a file system.
The file
.Ar dump-file
should be in the format produced with
.Xr quotadump 8 .
The quotas, expiration times, and configured grace times listed in the
dump file are loaded into the named file system.
The
.Ar file-system
argument should be a file or directory on the
.Pq mounted
file system, not a device special file.
.Pp
If the
.Fl d
option is given, quota entries on the file system that are not
mentioned in the dump file will be deleted.
Otherwise, they are left alone.
.Pp
If the
.Ar dump-file
is not specified, standard input is used.
.Sh SEE ALSO
.Xr quota 1 ,
.Xr libquota 3 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr quotadump 8
.Sh HISTORY
The
.Nm
command appeared in
.Nx 6.0 .
