NetBSD/src/usr.sbin/isibootd/isibootd.8
.\"	$NetBSD: isibootd.8,v 1.1 2011/12/17 13:24:18 tsutsui Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 15, 2011
.Dt ISIBOOTD 8
.Os
.Sh NAME
.Nm isibootd
.Nd TRFS based network boot server
.Sh SYNOPSIS
.Nm
.Op Fl d Ar tracelevel
.Op Fl i Ar interface
.Op Fl s Ar directory
.Sh DESCRIPTION
The
.Nm
command is a server which supports OMRON LUNA's network boot protocol
based on the Transparent Remote File System (TRFS) protocol.
The TRFS protocol uses special Ethernet type packets and
works within a local network.
.Pp
.Nm
is a simple TRFS server that only supports client reads for booting
and exports files in a specified directory.
.Nm
accepts requests only from clients listed in the
.Pa /etc/ethers
and have valid hostnames.
.Pp
The options are as follows:
.Bl -tag -width Fl
.It Fl d Ar tracelevel
Run
.Nm
in debug mode with specified tracelevel.
The tracelevel can be value 1, 2, or 3, and
greater tracelevel provides more detailed trace output.
The server will not fork in the debug mode.
.It Fl i Ar interface
Specify a network interface to service network boot.
If not specified
.Nm
searches available network interfaces (excluding loopback)
and use the first configured 
.Dq up
one.
.It Fl s Ar directory
Specify a directory containing boot files to be served by
.Nm .
If not specified
.Nm
uses
.Pa /tftpboot
by default.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /etc/ethers
.It Pa /etc/hosts
.It Pa /tftpboot
.It Pa /var/run/isibootd.pid
.El
.Sh SEE ALSO
.Xr ethers 5 ,
.Xr hosts 5 ,
.Xr tftpd 8
.Pp
.Pa http://www.NetBSD.org/ports/luna68k/install.html
.Sh HISTORY
.Nm
is based on
.Pa isiboot
utility which was originally written by
.An Tohru Nishimura
for
.Nx Ns /luna68k
development, and first appeared in
.Nx 6.0 .
