NetBSD/src/share/man/man4/man4.macppc/pbms.4
.\" $NetBSD: pbms.4,v 1.2.20.1 2008/06/02 13:21:39 mjf Exp $
.\"
.\" Copyright (c) 2006 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 5, 2006
.Dt PBMS 4 macppc
.Os
.Sh NAME
.Nm pbms
.Nd PowerBook (and iBook) trackpad mouse support
.Sh SYNOPSIS
.Cd "pbms? at uhidev? reportid ?"
.Cd "wsmouse* at pbms?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the trackpads on new (post
February 2005) Apple PowerBooks and iBooks that are not standard
USB HID mice.
Access to the trackpad is through the
.Xr wscons 4
framework.
.Sh SEE ALSO
.Xr uhidev 4 ,
.Xr usb 4 ,
.Xr wsmouse 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 4.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Johan Wallén .
