NetBSD/src/share/man/man4/man4.macppc/platinumfb.4
.\" $NetBSD: platinumfb.4,v 1.3 2016/09/15 15:19:00 scole Exp $
.\"
.\" Copyright (c) 2016 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 14, 2016
.Dt PLATINUMFB 4 macppc
.Os
.Sh NAME
.Nm platinumfb
.Nd Apple Platinum framebuffer driver
.Sh SYNOPSIS
.Cd "platinumfb0 at mainbus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Apple Platinum graphics devices found in a
couple early model PowerMacs such as the 7200.
.Pp
This driver should support console output (with rastor ops) and X
(in unaccelerated modes).
.Pp
It may be required to set the output-device to 'screen' in Open Firmware.
.Sh SEE ALSO
.Xr rasops 9 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 7.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Sean Cole .
.Sh BUGS
Early PowerMacs with the
.Nm
device may not work through Open Firmware.
.Pp
.Xr X 7
is pretty slow.
