NetBSD/src/sbin/reboot/reboot_sparc.8
.\" Copyright (c) 1990, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)reboot_sparc.8	5.4 (Berkeley) 7/23/91
.\"	$Id: reboot_sparc.8,v 1.2 1994/02/14 21:34:46 cgd Exp $
.\"
.Dd July 23, 1991
.Dt REBOOT 8
.Os
.Sh NAME
.Nm reboot
.Nd
.Tn NetBSD
bootstrapping procedures
.Sh SYNOPSIS
.Nm reboot
.Op Fl d
.Op Fl n
.Op Fl q
.Op Fl s
.Sh DESCRIPTION
The
.Tn NetBSD
kernel is started by placing it at the beginning of physical memory
and transferring to the entry point.
Since the system is not reenterable,
it is necessary to read it in from disk or tape
each time it is to be bootstrapped.
.Pp
.Sy Rebooting a running system .
When a
.Tn NetBSD
kernel is running and a reboot is desired,
.Xr shutdown 8
is normally used.
If there are no users then
.Nm reboot
can be used.
Reboot causes the disks to be synced and allows the system
to perform other shutdown activities such as resynchronizing
hardware time-of-day clocks.
A multi-user reboot (as described below) is then initiated.
This causes a system to be
booted and an automatic disk check to be performed.  If all this succeeds
without incident, the system is then brought up for many users.
.Pp
Options to reboot are:
.Bl -tag -width Ds
.\" .It Fl d
.\" option forces a memory dump to the swap area (see
.\" .Xr crash 8 )
.\" before rebooting.
.\" This can be used if the system is in a funny state that you would
.\" like to ``snapshot'' and analyze later.
.It Fl n
option avoids the sync.  It can be used if a disk or the processor
is on fire. 
.It Fl q
reboots quickly and ungracefully, without shutting down running
processes first.
.\" .It Fl s
.\" option reboots to single user mode.
.El
.Pp
.Nm Reboot
normally logs the reboot using
.Xr syslog 8
and places a shutdown record in the login accounting file (see
.Xr utmp 5 .
These actions are inhibited if the
.Fl n
or
.Fl q
options are present.
.Pp
.Sy Power fail and crash recovery.
Normally, the system will reboot itself at power-up or after crashes.
An automatic consistency check of the file systems will be performed,
and unless this fails, the system will resume multi-user operations.
.Pp
.Sy Cold starts.
At power up the Sparc rom will attempt to load a
bootblock and a kernel off the default configured drive. The standard
.Pa SunOS
defaults need modification for use by
.Pa NetBSD.
.Pp
The Sparc boot rom is a full-featured Forth system with emacs key bindings.
It has two user-interface modes, these are known as old-mode and new-mode.
Old-mode shows a simple `>' prompt and is essentially useless (also, the
kernel does not like it much).
By default the rom runs in old-mode; to enter new-mode type `n'.
New-mode shows a Forth-style `ok' prompt.
.Pp
Old mode should be disabled; utter the following incantation in new-mode
to force the rom to always start in new-mode.
.Pp
.Pa \	ok
setenv sunmon-compat? false
.Pp
The rom will normally load the kernel from "sd(0,0,0)vmunix". To change the
default so that
.Pa NetBSD
will be loaded type the following
.Pp
.Pa \	ok
setenv boot-from sd(0,0,0)netbsd
.Pp
At any time you can break back to the rom by pressing the `L1' and `a'
keys at the same time (if the console is a serial port the same is
achieved by sending a `break').
If you do this accidentally you can continue whatever was in progress
by typing `go'.
.Pp
.Sh BUGS
NetBSD/sparc cannot create boot labels. Use SunOS to prep your disk.
.Sh SEE ALSO
.Xr crash 8m ,
.Xr fsck 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr newfs 8 ,
.Xr rc 8 ,
.Xr shutdown 8 ,
.Xr syslogd 8
.Sh HISTORY
The
.Nm
command is
.Ud .
