NetBSD/src/usr.sbin/wake/wake.8
.\" $NetBSD: wake.8,v 1.1 2009/06/25 18:41:22 mbalmer Exp $
.\"
.\" Copyright (c) 2009 Marc Balmer <marc@msys.ch>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd February 2 2009
.Dt WAKE 8
.Os
.Sh NAME
.Nm wake
.Nd "send Wake on LAN frames to hosts on a local Ethernet network"
.Sh SYNOPSIS
.Nm
.Ar interface
.Op Ar lladdr ...
.Sh DESCRIPTION
The
.Nm
program is used to send Wake on LAN (WoL) frames over a local
Ethernet network to one or more hosts using their link layer (hardware)
addresses.
WoL functionality is generally enabled in a machine's BIOS
and can be used to power on machines from a remote system without
having physical access to them.
.Pp
.Ar interface
is the network interface of the local machine.
.Ar lladdr
are the link layer addresses of the remote machines
and can be specified as the actual hardware address
(six hexadecimal numbers separated by colons)
or a hostname entry in
.Pa /etc/ethers .
Link layer addresses can be determined and set on
.Nx
machines using
.Xr ifconfig 8 .
.Sh FILES
.Bl -tag -width "/etc/ethers" -compact
.It /etc/ethers
Ethernet host name database.
.El
.Sh SEE ALSO
.Xr ethers 5 ,
.Xr ifconfig 8
.Sh AUTHORS
.Nm
was written by
.Aq marc@msys.ch .
