NetBSD/src/usr.sbin/pf/man/man5/pf.boot.conf.5
.\"	$NetBSD: pf.boot.conf.5,v 1.1 2005/08/23 12:12:56 peter Exp $
.\"
.\" Copyright (c) 2005 Peter Postma <peter@NetBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 17, 2005
.Dt PF.BOOT.CONF 5
.Os
.Sh NAME
.Nm pf.boot.conf
.Nd initial configuration for packet filter
.Sh DESCRIPTION
The
.Nm
file is used as initial configuration for the
.Xr pf 4
packet filter.
This file is loaded before the network is configured by the
.Xr rc.d 8
script
.Em network .
Its purpose is to protect the machine from possible attacks between
the network configuration and the loading of the final ruleset.
.Pp
The syntax of this file is described in
.Xr pf.conf 5 .
.Pp
Note that at the stage the configuration is loaded, the network
interface(s) do not have an IP address yet, so you
.Em cannot
use rules that derive addresses from an interface (for example:
.Dq pass out from any to fxp0 ) .
.Sh FILES
.Bl -tag -width "/etc/defaults/pf.boot.conf" -compact
.It Pa /etc/defaults/pf.boot.conf
Default initial ruleset file.
.It Pa /etc/pf.boot.conf
Override of the default initial ruleset file.
.El
.Sh EXAMPLES
When using NFS (e.g. diskless situations), you'll also need the following
rules in addition to the default rules to unblock NFS:
.Bd -literal -offset indent
scrub in all no-df
pass in proto udp from any port { 111, 2049 } to any
pass out proto udp from any to any port { 111, 2049 }
.Ed
.Sh SEE ALSO
.Xr pf 4 ,
.Xr pf.conf 5 ,
.Xr pfctl 8
