NetBSD/src/usr.sbin/wsmoused/wsmoused.8
.\" $NetBSD: wsmoused.8,v 1.11 2003/04/16 08:42:16 wiz Exp $
.\"
.\" Copyright (c) 2002, 2003 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Julio Merino.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 4, 2003
.Dt WSMOUSED 8
.Os
.Sh NAME
.Nm wsmoused
.Nd mouse console daemon
.Sh SYNOPSIS
.Nm
.Op Fl d Ar device
.Op Fl f Ar conf_file
.Op Fl n
.Sh DESCRIPTION
The
.Nm
daemon provides mouse support in console, allowing copying and pasting
text.
The left mouse button is used to select text when held and you
use the right button to paste it in the active console.
.Pp
Supported options are as follows:
.Bl -tag -width XfXconfXfileXX
.It Fl d Ar device
specifies the device file to be used as the
.Xr wsmouse 4
device.
Defaults to
.Pa /dev/wsmouse .
.It Fl f Ar conf_file
specifies the configuration file to be used.
Defaults to
.Pa /etc/wsmoused.conf .
.It Fl n
do not fork in the background (for debugging purposes).
.El
.Pp
Many other details can be tuned.
See
.Xr wsmoused.conf 5
for more information.
.Sh FILES
.Bl -tag -width /dev/wsmoused.conf -compact
.It Pa /dev/ttyE[0-n]
tty devices
.It Pa /dev/ttyEstat
wsdisplay status notification device
.It Pa /dev/wsmouse[0-n]
mouse control device
.It Pa /etc/wsmoused.conf
default configuration file
.El
.Sh SECURITY CONSIDERATIONS
Be ABSOLUTELY sure that
.Pa /dev/ttyE*
devices have restrictive permissions as the mouse uses some functions
that could allow terminal snooping if improperly set.
.Sh NOTES
The mouse cursor is only visible for a short time.
It will disappear
when you stop moving it to avoid console corruption if there is any
output while it is visible.
.Pp
.Cd options WSDISPLAY_CHARFUNCS
is needed in your kernel configuration file in
order to get mouse console support.
.Pp
When you return from the X screen to another terminal there is a small
time delay until the mouse works again.
The delay is needed to allow X
to close the mouse device properly.
.Pp
It's needed that you change the getty program which runs in the first
virtual terminal to use
.Pa /dev/ttyE0
instead of
.Pa /dev/console .
If you do not change this, you may have problems.
You need to edit
.Pa /etc/ttys
and
.Pa /etc/wscons.conf
to make this change.
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsdisplay 4 ,
.Xr wsmouse 4 ,
.Xr ttys 5 ,
.Xr wscons.conf 5 ,
.Xr wsmoused.conf 5 ,
.Xr moused 8
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 2.0 .
.Sh AUTHORS
The
.Nm
command was developed by
.An Julio Merino
.Aq jmmv@NetBSD.org .
