NetBSD/src/share/man/man8/man8.emips/boot.8
.\"	$NetBSD: boot.8,v 1.1.12.1 2014/08/20 00:02:36 tls Exp $
.\"
.\" Copyright (c) 2010 Microsoft Corp.
.\" Copyright (c) 2010 NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 5, 2013
.Dt BOOT 8 emips
.Os
.Sh NAME
.Nm boot
.Nd system bootstrapping procedures
.Sh DESCRIPTION
The
.Nx
kernel is started by placing it near the beginning of physical
memory and transferring to the entry point.
Since the system is not reenterable,
it is necessary to read it in from disk or the network
each time it is to be bootstrapped.
.Ss Power fail and crash recovery
FPGA devices lose their content upon loss of power and must be re-programmed.
This is usually accomplished via a JTAG cable programmer, or using a FLASH device.
Once the eMIPS processor has been programmed into the FPGA, the system will normally boot itself.
An automatic consistency check of the file systems will be performed,
and unless this fails, the system will resume multi-user operations.
.Sh Xilinx XUP, ML401 and ML402
On these systems the kernel is normally read in from disk. The path used for automatic booting is
.Nm /netbsd ,
but it can be overridden in the optional file
.Nm /boot.config
stored in the root of the disk filesystem. The user can also type a different filename and a combination of boot options.
.Sh BeSquare BEE3
On this system there is no local disk and booting over the network is the only option.
Network boot can also be explicitly selected by hitting
.Nm f
at the boot loader prompt.
.Sh KERNEL ARGUMENTS
At the boot loader prompt, the user may boot
.Nx
with a number of options that are passed to the kernel unmodified. Parsing of these options is
defined in the file
.Nm /sys/boot_flag.h
Some additional flags are as follows.
.Bl -tag -width xxx -offset indent
.It Li e
Empty -- this argument requests
.Nx
to ignore all symbolic information and empty its initial symbol table.
.It Li n
Name -- Prompt for the root file system device, the system crash dump
device, and the path to
.Xr init 8 .
.It Li N
NoName -- Do not prompt for the root file system device, the system crash dump
device, and the path to
.Xr init 8 .
If the configured-in devices are present, use them.
.It Li s
Single -- Boot only to single-user mode.
.El
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr installboot 8 ,
.Xr rc 8 ,
.Xr reboot 8 ,
.Xr savecore 8 ,
.Xr shutdown 8
.Sh HISTORY
The
.Nm
command is
.Ud .
