NetBSD/src/sbin/wsconsctl/wsconsctl.8
.\" $NetBSD: wsconsctl.8,v 1.1 1998/12/28 14:01:17 hannken Exp $
.\"
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Juergen Hannken-Illjes.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the NetBSD
.\"	Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"/
.Dd Dec 24, 1998
.Dt WSCONSCTL 8
.Os
.Sh NAME
.Nm wsconsctl
.Nd get or set wscons state
.Sh SYNOPSIS
.Nm
.Op Fl kdm
.Op Fl f Ar file
.Op Fl n
.Fl a
.Nm ""
.Op Fl kdm
.Op Fl f Ar file
.Op Fl n
.Ar name ...
.Nm ""
.Op Fl kdm
.Op Fl f Ar file
.Op Fl n
.Fl w
.Ar name=value ...
.Nm ""
.Op Fl kdm
.Op Fl f Ar file
.Op Fl n
.Fl w
.Ar name+=value ...
.Sh DESCRIPTION
The 
.Nm
command displays or sets various wscons system driver variables.
If a list of variables is present on the command line, then
.Nm
prints the current value of those variables for the specified device.
If the 
.Fl a
flag is specified, all variables for the device are printed.
If the
.Fl w
flag is specified
.Nm
attempts to set or modify the specified variables to the given values.
To set a variable the value is specified with an equal sign like
.Bd -literal -offset indent -compact
bell.pitch=1200
.Ed
To modify a variable the value is specified like
.Bd -literal -offset indent -compact
bell.pitch+=200
.Ed
Not all variables can be modified.
.Pp
The
.Fl f
flag can be used to give an alternative control device.
.Pp
The
.Fl n
flag suppresses printing of the variable name.
.Pp
The
.Fl k
flag selects the keyboard portion of the device.
If no flag out of
.Fl kdm
is given this is the default.
.Pp
The
.Fl d
flag selects the display portion of the device.
.Pp
The
.Fl m
flag selects the mouse portion of the device.
.Sh FILES
.Bl -tag -width /dev/wsmouse0
.It Pa /dev/wskbd0
keyboard control device
.It Pa /dev/wsmouse0
mouse control device
.It Pa /dev/ttyE0
display control device
.El
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.4 .
