NetBSD/src/share/examples/refuse/ian/ian/ian.8
.\"
.\" Copyright © 2007 Alistair Crooks.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 28, 2007
.Dt IAN 8
.Os
.Sh NAME
.Nm ian
.Nd refuse-based internet access node - ftp/http file system
.Sh SYNOPSIS
.Nm
.Op Fl v
.Op Fl d Ar cache-directory
.Ar mount_point
.Sh DESCRIPTION
The
.Nm
utility is a refuse-based virtual file system, and can be used to
access files on remote machines via the ftp and http protocols.
The
.Nm
utility makes use of the
.Xr virtdir 3
virtual directory routines, and the
libfetch remote access routines from FreeBSD.
.Pp
The URL is provided as a path below the mountpoint, and is retrieved from
the remote location using the associated scheme.
The file is cached in
the local cache directory, which can be manipulated using the
.Ar d
command
line option.
The default location is /tmp.
.Pp
The 
.Nm
utility makes use of the
.Xr virtdir 3
virtual directory routines.
.Pp
The
.Xr refuse 3
library is used to provide the file system features.
.Pp
The mandatory parameter is
the local mount
point.
.Pp
The
.Nm
utility was designed to be a
BSD-licensed, refuse-based implementation of
the functionality provided by the older
alex
utility.
.Sh SEE ALSO
.Xr librefuse 3 ,
.Xr puffs 3 ,
.Xr virtdir 3 .
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 5.0 .
