NetBSD/src/usr.sbin/dumpexfatfs/dumpexfatfs.8
.\"	$NetBSD: dumpexfatfs.8,v 1.1.2.2 2024/08/02 00:24:20 perseant Exp $
.\"
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)dumplfs.8	8.1 (Berkeley) 6/18/93
.\"
.Dd February 28, 2023
.Dt DUMPEXFATFS 8
.Os
.Sh NAME
.Nm dumpexfatfs
.Nd dump file system information
.Sh SYNOPSIS
.Nm
.\".Op Fl adiS
.\".Op Fl b Ar blkno
.Ar filesys No \&| Ar device
.Sh DESCRIPTION
.Nm
prints out the file system layout information for the
exFAT file system or special device specified.
The listing is very long and detailed.
This command is useful mostly for finding out certain file system
information such as the file system block size.
.Pp
The following flags are interpreted by
.Nm .
.Bl -tag -width indent
.\""AaB:bcd:fnruv"
.It Fl A
This is equivalent to using flags -abfru.
.It Fl a
Dump the allocation bitmap.
.It Fl B Ar bootcode-file
Dump the filesystem's bootcode into a file suitable for use by
.Xr newfs_exfatfs 8 .
.It Fl c
Print the current time, converted to and from DOS format time;
and January 1st, 1980 in DOS format time.
.It Fl d Ar inum
Dump the contents of the directory with inode number
.Ar inum .
.It Fl f
Dump the File Allocation Table.
.It Fl n
Show the invocation of
.Xr newfs 8
to duplicate this filesystem.
.It Fl r
Dump the contents of the root directory.
.It Fl u
Display the up-case table.
.It Fl v
Be more verbose.
.El
.Sh SEE ALSO
.Xr disktab 5 ,
.\".Xr exfatfs 5 ,
.Xr disklabel 8 ,
.Xr newfs_exfatfs 8
.Sh HISTORY
The
.Nm dumpxefatfs
command appeared in
.Nx 11.0 .
