NetBSD/src/sbin/fdisk/fdisk.8
.\"	$NetBSD: fdisk.8,v 1.20.2.1 1999/12/27 18:30:23 wrstuden Exp $
.\"
.Dd April 4, 1993
.Dt FDISK 8
.\" .Os BSD 4
.Sh NAME
.Nm fdisk
.Nd DOS partition maintenance program
.Sh SYNOPSIS
.Nm ""
.Op Fl aiufBS
.Bk -words
.Op Fl 0 | 1 | 2 | 3
.Ek
.Bk -words
.Op Fl b Ar cylinders/heads/sectors
.Ek
.Bk -words
.Op Fl s Ar id/start/size
.Ek
.Bk -words
.Op Fl c Ar bootcode
.Ek
.Bk -words
.Op Ar device
.Ek
.Sh PROLOGUE
In order for the BIOS to boot the kernel, certain conventions must be
adhered to.
Sector 0 of the disk must contain boot code, a partition table, and a
magic number.
Newer BIOS programs want the entire first track reserved.
BIOS partitions can be used to break the disk up into several pieces.
The BIOS brings in sector 0, verifies the magic number, and begins
executing the code at the first byte.
This code in turn searches the DOS partition table for an `active'
partition.
If one is found, the boot block from that partition is loaded and replaces
the original boot block.
Under DOS, you could have one or more partitions with one active.
The DOS
.Nm
program can be used to divide space on the disk into partitions and set
one active.
.Pp
The
.Nx
program
.Nm
serves a similar purpose to the DOS program.
When called with no arguments, it prints the sector 0 partition table.
An example follows:
.Bd -literal
	NetBSD disklabel disk geometry:
	cylinders: 769 heads: 15 sectors/track: 33 (495 sectors/cylinder)

	BIOS geometry:
	cylinders: 769 heads: 15 sectors/track: 33 (495 sectors/cylinder)

	Partition table:
	0: sysid 169 (NetBSD)
    	    start 495, size 380160 (185 MB), flag 0
		beg: cylinder    1, head   0, sector  1
		end: cylinder  768, head  14, sector 33
	1: sysid 164 (reserved)
    	    start 378180, size 2475 (1 MB), flag 0
		beg: cylinder  764, head   0, sector  1
		end: cylinder  768, head  14, sector 33
	2: <UNUSED>
	3: sysid 99 (GNU HURD or Mach or Sys V/386 (such as ISC UNIX))
    	    start 380656, size 224234 (109 MB), flag 80
		beg: cylinder  769, head   0, sector  2
		end: cylinder  197, head  14, sector 33
.Ed
.Pp
This example disk is divided into three partitions that happen to fill the
disk.  The second partition overlaps the end of the first.
(Used for debugging purposes.)
.Pp
The various fields in each partition are:
.Bl -tag -width "cylinder"
.It Em "sysid"
is used to label the partition.
.Nx
reserves the magic number 169 decimal (A9 in hex).
.It Xo
.Em start ,
.Em size
.Xc
start address and size of a partition in sectors.
.It Em "flag 80"
specifies that this is the active partition.
.It Xo
.Em "cylinder" ,
.Em "head" ,
.Em "sector"
.Xc
the beginning or ending address of a partition.
.El
.Pp
.Em "Note:"
these numbers are calculated using BIOS's understanding of the disk geometry
and saved in the bootblock.
.Pp
The flags
.Fl a ,
.Fl i 
or
.Fl u
are used to indicate that the partition data is to be updated.
The
.Nm
program will enter a conversational mode.
This mode is designed not to change any data unless you explicitly tell it to;
.Nm
selects defaults for its questions to guarantee that behavior.
.Pp
At the start the
.Nm
program will determine whether the disk sector 0 is valid as a boot sector.
(This is determined by checking the magic number.)
If not,
.Nm
will initialize the boot code as well as the partition table.
During this, all four partitions will be marked empty.
.Pp
If the 
.Fl u
flag is used, it displays each partition and asks if you want to edit it.
If you reply affirmatively,
it will step through each field showing the old value
and asking for a new one.
When you are done with a partition,
.Nm
will display the information again and ask if it is correct.
.Nm
will then procede to the next entry.
.Pp
Getting the
.Em cylinder ,
.Em head ,
and
.Em sector
fields correct is tricky.
So by default,
they will be calculated for you;
you can specify them if you choose.
.Pp
After all the partitions are processed,
if the 
.Fl a
flag was given, you are given the option to change the
.Em active
partition.
To change only the
.Em active
partition, you can use only the
.Fl a .
.Pp
Finally,
when all the data for the first sector has been accumulated,
.Nm
will ask if you really want to rewrite sector 0.
Only if you reply affirmatively to this question will
.Nm
write anything to the disk.
.Pp
The
.Fl i
explicitly requests initialization of the master boot code
(similar to what
.Nm fdisk /mbr
does under MSDOS), 
even if the magic number in the first sector is ok. 
The partition table is left alone by this (but see above).
.Pp
You can use
.Fl c
to specify the filename that
.Nm
should read the bootcode from.  The default is to read from
.Em /usr/mdec/mbr
if run on an i386, and leave the bootcode empty for other
machines.
.Pp
The
.Fl B
flag can be used to install/update the bootselect code on i386
platforms.
.Pp
The flags
.Fl 0 ,
.Fl 1 ,
.Fl 2 
and
.Fl 3
allow the user to selectively update or set to active a specific
partition.
.Pp
The
.Fl s
flag allows the user to specify the partition type, start and
size from the command line.  This flag requires the use of the
partition selection flag.
.Pp
The
.Fl b
flag allows the user to specify the BIOS parameters for
cylinders, heads and sectors.  It is used only in conjunction with the
.Fl u
flag.
.Pp
The
.Fl f
flag makes
.Nm
work in a non-interactive mode.  In this mode, you can only change the
disk parameters by using the 
.Fl b
flag.  This is provided only so scripts or other programs may
use fdisk as part of an automatic installation process.  Using the
.Fl f
flag with
.Fl u
makes it impossible to specify the starting and ending
.Em cylinder ,
.Em head
and 
.Em sector
fields.  They will be automatically computed using the BIOS geometry.
.Pp
The
.Fl S
flag used with no other flags prints a series of 
.Nm /bin/sh
commands for setting variables to the partition information.  This
is used for the install script.
.Sh NOTES
The automatic calculation of the starting cylinder and
other parameters uses
a set of figures that represent what the BIOS thinks is the
geometry of the drive.
These figures are by default taken from the incore disklabel, but
.Nm
gives you an opportunity to change them.
This allows the user to create a bootblock that can work with drives
that use geometry translation under the BIOS.
.Pp
Editing an existing partition is risky, and may cause you to
lose all the data in that partition.
.Pp
You should run this program interactively once or twice to see how it works.
This is completely safe as long as you answer the last question in the negative.
.Sh FILES
.Bl -tag -width /usr/mdec/mbrxxxxxxxx -compact
.It Pa /usr/mdec/mbr
Default location of i386 bootcode
.It Pa /usr/mdec/mbr_bootsel
Default location of i386 bootselect code
.El
.Sh SEE ALSO
.Xr disklabel 8
.Sh BUGS
There are subtleties that the program detects that are not explained in
this manual page.
