NetBSD/src/usr.sbin/ypset/ypset.8
.\"	$NetBSD: ypset.8,v 1.7 2005/02/26 16:16:22 thorpej Exp $
.\"
.\" Copyright (c) 1996 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 25, 1994
.Dt YPSET 8
.Os
.Sh NAME
.Nm ypset
.Nd tell
.Xr ypbind 8
which NIS server process to use
.Sh SYNOPSIS
.Nm
.Op Fl h Ar host
.Op Fl d Ar domain
.Ar server
.Sh DESCRIPTION
.Nm
tells the
.Xr ypbind 8
process on the current machine which
.Tn NIS
server process to communicate with.
If
.Ar server
is down or is not running a
.Tn NIS
server process, it is not discovered until
a
.Tn NIS
client process attempts to access a
.Tn NIS
map, at which time
.Xr ypbind 8
tests the binding and takes appropriate action.
.Pp
.Nm
is most useful for binding a
.Tn NIS
client that is not on the same broadcast
network as the closest
.Tn NIS
server, but can also be used for debugging
a local network's
.Tn NIS
configuration, testing specific
.Tn NIS
client
programs, or binding to a specific server when there are many servers on
the local network supplying
.Tn NIS
maps.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl h Ar host
Set the
.Tn NIS
binding on
.Ar host
instead of the local machine.
.It Fl d Ar domain
Use the
.Tn NIS
domain
.Ar domain
instead of the default domain as returned by
.Xr domainname 1 .
.El
.Sh SEE ALSO
.Xr domainname 1 ,
.Xr nis 8 ,
.Xr ypcat 1 ,
.Xr ypmatch 1 ,
.Xr ypwhich 1 ,
.Xr ypbind 8 ,
.Xr yppoll 8
.Sh AUTHORS
.An Theo de Raadt
