NetBSD/src/usr.sbin/xntp/ntptime/ntptime.8
.\"	$NetBSD: ntptime.8,v 1.5 1999/03/22 18:44:15 garbled Exp $
.\" Converted from HTML to mandoc by Christos Zoulas
.Dd June 23, 1997
.Dt NTPTIME 8
.Os
.Sh NAME
.Nm ntptime
.Nd read kernel time variables
.Sh SYNOPSIS
.Nm 
.Op Fl cdhr
.Op Fl e Ar est_error
.Op Fl f Ar frequency
.Op Fl m Ar max_error
.Op Fl o Ar offset
.Op Fl s Ar status
.Op Fl t Ar time_constant
.Sh DESCRIPTION
.Nm
reads and displays time-related kernel variables using the
.Ar ntp_gettime
system call. A similar display can be
obtained using the 
.Xr xntpdc 8
program.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl c
Display the execution time of 
.Nm
itself.
.It Fl d
Turn on debugging.
.It Fl e Ar est_error
Specify estimated error, in microseconds.
.It Fl f Ar frequency
Specify frequency offset, in parts per million.
.It Fl h
Display help information.
.It Fl m Ar max_error
Specify maximum error, in microseconds.
.It Fl o Ar offset
Specify clock offset, in microseconds.
.It Fl r
Display Unix and NTP times in raw format.
.It Fl s Ar status
Specify clock status. Better know what you are doing.
.It Fl t Ar time_constant
Specify time constant, an integer in the range 0-4.
.El
.Pp
.Sh FILES
.Bl -tag -width /etc/ntp.keys -compact
.It Pa /usr/share/doc/xntp/index.html
.It Pa /usr/share/doc/xntp/ntptime.html
.El
.Pp
.Sh AUTHOR
David L. Mills (mills@udel.edu)
