NetBSD/src/share/man/man8/man8.arc/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.arc/MAKEDEV and
.\" *** src/share/man/man8/man8.arc/MAKEDEV.8.template
.\" *** 
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\"	$NetBSD: MAKEDEV.8,v 1.4 2001/01/08 22:27:51 martin Exp $
.\"
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	8.1 (Berkeley) 6/5/93
.\"
.Dd Mar 3, 2000
.Dt MAKEDEV 8 arc
.Sh NAME
.Nm MAKEDEV ,
.Nm makedev
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar device_name Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create the common special
files.
.\"See
.\".Xr special 8
.\"for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are several special devices:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
Makes all known devices, including local devices. If units are expected for a device
.Pa MAKEDEV
supplies the standard numbers.
.It Ar minimal
A minimal set of devices for install disks, etc.
.It Ar std
The standard devices (console, drum, klog, kmem, mem, null, stderr, stdin, stdout, tty, zero).
.It Ar local
Configuration specific devices which are created by running the
.Pa MAKEDEV.local
shell script with the argument ``all''.
.It Ar isdn
Make ISDN devices
.El
.Pp
The
.Tn arc
supports the following devices.
Where a device name is followed by a hash sign
.Ql \&# ,
the hash sign
must be replaced by a unit number.
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar st#
SCSI tape, see
.Xr st 4 
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar ccd#
Concatenated disk driver, see
.Xr ccd 4 
. It Ar cd#
SCSI CD-ROM, see
.Xr cd 4 
. It Ar md#
Memory pseudo-disk devices, see
.Xr md 4 
. It Ar raid#
RAIDframe disk driver, see
.Xr raid 4 
. It Ar sd#
ATAPI and SCSI disks, see
.Xr sd 4 
. It Ar vnd#
File pseudo-disks, see
.Xr vnd 4 
. It Ar wd#
IDE disks, see
.Xr wd 4 
. It Ar fd#
PC-style floppy disks
. El
.It Terminals:
. Bl -tag -width 0123456789 -compact
. It Ar ttyC?
Pccons
. It Ar ttyE?
Workstation console (``wscons'') glass-tty emulators
. It Ar tty#
NS16550 (``com'') serial ports, see
.Xr tty 4 
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr pty 4 
. El
.It Printers:
. Bl -tag -width 0123456789 -compact
. It Ar lpt#
PC parallel port driver (``lpt'') units
. El
.It ISDN devices:
. Bl -tag -width 0123456789 -compact
. It Ar i4b
Comunication between userland isdnd and kernel
. It Ar i4bctl
Control device
. It Ar i4brbch#
Raw b-channel access
. It Ar i4btel#
Telephonie device
. It Ar i4btrc#
Trace device
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar bpf#
Berkeley packet filter devices, see
.Xr bpf 4 
. It Ar ch#
SCSI media changer, see
.Xr ch 4 
. It Ar fd
File descriptors (/dev/fd/*)
. It Ar ipl
IP filter
. It Ar kbd
Keyboard (provides events, for X11)
. It Ar mouse
Mouse (provides events, for X11)
. It Ar pms#
PS/2 mouse, see
.Xr pms 4 
. It Ar joy#
Joystick device
. It Ar random
Random number generator
. It Ar scsibus#
SCSI busses, see
.Xr scsictl 8 ,
.Xr scsi 8 
. It Ar ss#
SCSI scanner, see
.Xr ss 4 
. It Ar tun#
Network tunnel driver, see
.Xr tun 4 
. It Ar uk#
SCSI unknown, see
.Xr uk 4 
. El
.El
.Pp
.Sh FILES
.Bl -tag -width xxxx -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.\".Xr special 8
