NetBSD/src/share/man/man4/man4.hppa/lcd.4
.\"	$NetBSD: lcd.4,v 1.1.12.1 2017/03/20 06:57:05 pgoyette Exp $
.\"	OpenBSD: lcd.4,v 1.2 2007/07/20 22:41:57 kettenis Exp
.\"
.\" Copyright (c) 2007 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd February 17, 2017
.Dt LCD 4 hppa
.Os
.Sh NAME
.Nm lcd
.Nd front panel LCD display
.Sh SYNOPSIS
.Cd "lcd0 at mainbus0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the front panel LCD display found on newer
HP PA-RISC workstations and servers.
This LCD can be made to show a heartbeat based on the load average by
setting the
.Xr sysctl 3
variable
.Ar machdep.lcd_blink
to a non-zero value.
.Sh SEE ALSO
.Xr sysctl 3 ,
.Xr hppa/intro 4 ,
.Xr sysctl 8
.Sh HISTORY
.An -nosplit
The
.Nm
driver first appeared in
.Ox 4.2 .
It was ported to
.Nx 6.0
by
.An Adam Hoka
and
.An Nick Hudson .
