NetBSD/src/sbin/mount_qemufwcfg/mount_qemufwcfg.8
.\"	$NetBSD: mount_qemufwcfg.8,v 1.3 2020/04/29 09:54:43 gson Exp $
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 29, 2020
.Dt MOUNT_QEMUFWCFG 8
.Os
.Sh NAME
.Nm mount_qemufwcfg
.Nd provide QEMU fw_cfg data as a file system
.Sh SYNOPSIS
.Nm
.Op Fl F Ar path
.Op Fl g Ar gid
.Op Fl M Ar dir-mode
.Op Fl m Ar file-mode
.Op Fl u Ar uid
.Op Ar fuse-options
.Ar node
.Sh DESCRIPTION
The
.Nm
command provides the QEMU fw_cfg configuration files in a file system
tree at point
.Ar node .
The directory specified by
.Ar node
is converted to an absolute path before use.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl F Ar path
Use
.Ar path
instead of
.Pa /dev/qemufwcfg
for the QEMU device.
.It Fl g Ar gid
Use
.Ar gid
as group for files in the file system instead of the active group id.
.It Fl M Ar dir-mode
Use
.Ar dir-mode
as permissions for directories instead of the default
.Ar 0555 .
.It Fl m Ar file-mode
Use
.Ar file-mode
as permissions for files instead of the default
.Ar 0444 .
.It Fl u Ar uid
Use
.Ar uid
as user for files in the file system instead of the active user id.
.El
.Sh SEE ALSO
.Xr qemufwcfg 4
.Sh HISTORY
A
.Nm
command first appeared in
.Nx 9.0 .
.Sh AUTHORS
.An Jared McNeill Aq Mt jmcneill@invisible.ca
