NetBSD/src/share/man/man8/man8.sgimips/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.sgimips/MAKEDEV and
.\" *** src/share/man/man8/MAKEDEV.8.template
.\" ***
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\" $NetBSD: MAKEDEV.8,v 1.1 2001/06/08 14:32:13 wiz Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 8, 2001
.Dt MAKEDEV 8 sgimips
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm
.Ar special Op Ar ...

.Nm
.Ar device Op Ar ...
.Sh DESCRIPTION
.Nm
is used to create system and device special files.
As arguments it takes the names of known devices, like
.Ar sd0 ,
or of special targets, like
.Pa all
or
.Pa std ,
which create a collection of device special files.
.Pp
The script is in
.Pa /dev/MAKEDEV
and must be called from the
.Pa /dev
directory.
.Pp
The special targets supported on
.Nx Ns / Ns sgimips
are:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
Makes all known devices, including local devices. If units are expected for a device
.Pa MAKEDEV
supplies the standard numbers.
.It Ar minimal
A minimal set of devices for install disks, etc.
.It Ar std
The standard devices (console, drum, klog, kmem, mem, null, stderr, stdin, stdout, tty, zero).
.It Ar local
Configuration specific devices which are created by running the
.Pa MAKEDEV.local
shell script with the argument ``all''.
.It Ar isdn
Make ISDN devices
.El
.Pp
Please note that any hash marks
.Pq Dq #
in the following list of supported device targets must be replaced by
digits when calling
.Nm "" :
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar st#
SCSI tape, see
.Xr st 4
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar ccd#
Concatenated disk driver, see
.Xr ccd 4
. It Ar cd#
SCSI CD-ROM, see
.Xr cd 4
. It Ar md#
Memory pseudo-disk devices, see
.Xr md 4
. It Ar raid#
RAIDframe disk driver, see
.Xr raid 4
. It Ar sd#
ATAPI and SCSI disks, see
.Xr sd 4
. It Ar vnd#
File pseudo-disks, see
.Xr vnd 4
. It Ar wd#
IDE disks, see
.Xr wd 4
. El
.It Terminals:
. Bl -tag -width 0123456789 -compact
. It Ar ttyC#
NS16550 (``com'') serial ports
. It Ar ttyZ#
Zilog 8530 (``zstty'') serial ports
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr pty 4
. El
.It ISDN devices:
. Bl -tag -width 0123456789 -compact
. It Ar i4b
Comunication between userland isdnd and kernel
. It Ar i4bctl
Control device
. It Ar i4brbch#
Raw b-channel access
. It Ar i4btel#
Telephonie device
. It Ar i4btrc#
Trace device
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar bpf#
Berkeley packet filter devices, see
.Xr bpf 4
. It Ar ch#
SCSI media changer, see
.Xr ch 4
. It Ar fd
File descriptors (/dev/fd/*)
. It Ar ipl
IP filter
. It Ar random
Random number generator
. It Ar scsibus#
SCSI busses, see
.Xr scsictl 8 ,
.Xr scsi 4
. It Ar ss#
SCSI scanner, see
.Xr ss 4
. It Ar tun#
Network tunnel driver, see
.Xr tun 4
. It Ar uk#
SCSI unknown, see
.Xr uk 4
. El
.El
.Sh FILES
.Bl -tag -width "/dev/MAKEDEV" -compact
.It Pa /dev
special device files directory
.It Pa /dev/MAKEDEV
script described in this man page
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.Sh BUGS
This man page is generated automatically from the same sources
as
.Pa /dev/MAKEDEV ,
in which the device files are not always sorted, which may result
in an unusual (non-alphabetical) order.
