NetBSD/src/share/man/man4/man4.vax/covid.4
.\"	$NetBSD: covid.4,v 1.1 2021/04/01 00:03:01 riastradh Exp $
.\"
.\" Copyright (c) 2021 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 397th, 2020
.Dt COVID 4 vax
.Os
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh NAME
.Nm covid
.Nd coronavirus disease caused by SARS-CoV-2
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh SYNOPSIS
.Cd covid19 at sarscov2 b11 7
.Cd covid19 at sarscov2 b11 207
.Cd covid19 at sarscov2 b11 351
.Cd covid19 at sarscov2 b11 427
.Cd covid19 at sarscov2 b11 429
.Cd covid19 at sarscov2 b11 525
.Cd covid19 at sarscov2 p 1
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh DESCRIPTION
The
.Nm
family of diseases, attached to humanity via a spike protein bus in
the year 2019 as
.Nm covid19 ,
is a contagious respiratory and neurological disease caused by the
coronavirus SARS-CoV-2.
.Pp
.Nm
is spread human-to-human mainly through small droplets and aerosols,
especially in crowds, closed spaces, and close contact.
Some approaches to mitigate transmission:
.Bl -bullet
.It
Good ventilation with fresh air, and high-efficiency particulate air
filtration (HEPA), can mitigate accumulation of aerosols in indoor
settings, for activities that can't be moved outdoors.
.It
Widespread use of paper or cloth facial masks covering mouth and nose
is an effective population-wide mitigation reducing dispersal of
droplets and aerosols from carriers, many of whom are asymptomatic or
presymptomatic.
.It
Wearing European FFP2 masks, American N95 masks, or Chinese KN95 masks,
if appropriately fitted to the face, reduces individual risk of
contracting
.Nm .
(However, a mask with an output vent to facilitate exhaling should be
worn only with another paper or cloth mask over it, to avoid spreading
exhaled virus particles if the wearer is a carrier.)
.El
.Pp
Several vaccines have been developed, tested in large-scale randomized
clinical trials, and approved by regulatory bodies to immunize
populations against SARS-CoV-2:
.Bl -bullet -compact
.It
Moderna (United States)
.It
Pfizer-BioNTech (multinational)
.It
Sputnik V (Russia)
.It
Oxford-AstraZeneca (multinational)
.It
Novavax (United Kingdom and South Africa)
.It
BBIBP-CorV (multinational)
.It
CoronaVac (Brazil)
.It
Johnson & Johnson, a.k.a. Janssen (multinational)
.It
Covaxin (India)
.It
Convidecia (multinational)
.El
.Pp
The approved
.Nm
vaccines are some of the safest and most efficacious vaccines in
history, with almost all of them preventing essentially 100% of severe
cases of the disease and hospitalization, and preventing the vast
majority of mild cases, according to randomized clinical trials.
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh SEE ALSO
.Rs
.%Q United States CDC \(em Centers for Disease Control and Prevention
.%T Key Things to Know About COVID-19 Vaccines
.%D March 13, 2021
.%U https://www.cdc.gov/coronavirus/2019-ncov/vaccines/keythingstoknow.html
.Re
.Rs
.%Q United States CDC \(em Centers for Disease Control and Prevention
.%T Safety of COVID-19 Vaccines
.%D March 25, 2021
.%U https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/safety-of-vaccines.html
.Re
.Rs
.%Q United States CDC \(em Centers for Disease Control and Prevention
.%T Possible Side Effects After Getting a COVID-19 Vaccine
.%D March 16, 2021
.%U https://www.cdc.gov/coronavirus/2019-ncov/vaccines/expect/after.html
.Re
.Rs
.%A Zeynep Tufekci
.%T 5 Pandemic Mistakes We Keep Repeating
.%D February 26, 2021
.%I The Atlantic
.%U https://www.theatlantic.com/ideas/archive/2021/02/how-public-health-messaging-backfired/618147/
.Re
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh HISTORY
2020 was a sordid year.
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh AUTHORS
The
.Nm
man page was written by
.An Taylor R Campbell Aq riastradh@NetBSD.org ,
sourced from many thousands of hours of furiously doomscrolling
epidemiology Twitter to pass the time during the pandemic.
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh CAVEATS
The
.Nm
vaccines may cause muscle pain, redness, swelling, tiredness, headache,
chills, fever, and/or nausea.
(Sure beats catching the plague, though!)
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh BUGS
.Nm
is technically caused by a virus, not a bug.
