NetBSD/src/usr.sbin/envstat/envstat.8
.\"	$NetBSD: envstat.8,v 1.14 2007/04/19 14:26:59 xtraeme Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Bill Squier.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 19, 2007
.Dt ENVSTAT 8
.Os
.Sh NAME
.Nm envstat
.Nd display environmental sensor readings
.Sh SYNOPSIS
.Nm
.Op Fl flr
.Op Fl i Ar interval
.Op Fl n Ar headrep
.Op Fl s Ar sensor1,sensor2,...
.Op Fl w Ar width
.Op Ar device
.Sh DESCRIPTION
.Nm
displays sensor readings from any device which supports the
.Xr envsys 4
API.
Readings are displayed in columns, one column per sensor.
Column widths as well as displayed sensors are fully customizable.
The column headers display the name (stored in the device driver) as
well as the units of each sensor.
.Pp
The options are as follows:
.Bl -tag -width flag
.It Fl f
Display any temperature values in degrees Fahrenheit.
The default is to display temperature values in degrees Celsius.
.It Fl l
List the names of all supported sensors, one per line.
Use of this flag causes
.Nm
to ignore all other option flags.
.It Fl i
Repeat the display every
.Ar interval
seconds.
Note that some devices do not provide fresh values on demand.
See the individual device's manual page for meaningful values for
.Ar interval .
If not specified, or specified as 0,
.Nm
produces one line of values and exits.
.It Fl n
Display a new header every
.Ar headrep
lines.
An argument of 0 disables header line printing completely.
The default is every 22 lines.
.It Fl r
Display the sensors row wise.
This is useful when the number of sensors is large.
This option also displays fractional values when present
(e.g., the percentage battery charge).
.It Fl s
Restrict the display to the named sensors.
The sensor names must be supplied as a comma separated list.
Sensor names are case sensitive.
.It Fl w
Use
.Ar width
as the column width for the output.
Each column is additionally separated by a single space.
The default is either the length of the longest sensor
name or spread evenly to fill 80 columns, whichever is greater.
.El
.Sh EXAMPLES
Display the
.Do acpibat0 charge
.Dc sensor on one line (row format) every ten seconds:
.Dl envstat -s \*qacpibat0 charge\*q -r -i 10
.Sh SEE ALSO
.Xr acpiacad 4 ,
.Xr acpibat 4 ,
.Xr acpitz 4 ,
.Xr adt7467c 4 ,
.Xr aiboost 4 ,
.Xr envsys 4 ,
.Xr ipmi 4 ,
.Xr it 4 ,
.Xr lm 4 ,
.Xr lmtemp 4 ,
.Xr nsclpcsio 4 ,
.Xr owtemp 4 ,
.Xr sparc/tctrl 4 ,
.Xr sparc64/envctrl 4 ,
.Xr tm121temp 4 ,
.Xr ug 4 ,
.Xr viaenv 4 .
.Sh HISTORY
.Nm
appeared in
.Nx 1.5 .
