NetBSD/src/share/man/man1/man1.atari/edahdi.1
.\"	$NetBSD: edahdi.1,v 1.9.42.1 2009/05/13 19:19:07 jym Exp $
.\"
.\" Copyright (c) 1996 Leo Weppelman
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Leo Weppelman
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 16, 1996
.Dt EDAHDI 1 atari
.Os
.Sh NAME
.Nm edahdi
.Nd modify AHDI partition identifiers
.Sh SYNOPSIS
.Nm
.Ar device
.Sh DESCRIPTION
.Nm
allows you to modify the partition identifiers on a disk partitioned with
AHDI or an AHDI compatible formatter. An AHDI partition format is usually
only present on disks shared between
.Nx
and some other OS. The partition identifiers are used by
.Nx
as a guideline to emulate a disklabel on such a disk.
.Pp
.Nm
supports the following options:
.Pp
.Bl -tag -width device
.It Ar device
The name of the raw device you want to edit.
.El
.Pp
The following partition identifiers are recognized by
.Nx :
.Pp
.Bl -tag -width "GEM or BGM" -compact
.It NBD
Partition is reserved for
.Nx .
This can be either a root or an user partition. The first NBD
partition on a disk will be mapped to partition
.Em a
in
.Nx .
The following NBD partitions will be mapped from
.Em d
up.
The filesystem type is ffs by default.
.It SWP
The first SWP partition is mapped to partition
.Em b .
.It GEM or BGM
These partitions are mapped from
.Em d
up. The filesystem type is msdos.
.It NBR
.Nx
root partition (deprecated).
.It NBU
.Nx
user partition (deprecated).
.It NBS
.Nx
swap partition (deprecated).
.El
.Sh EXAMPLES
Say, you have a disk with that is partitioned like:
.Pp
.Bl -column Number   Id
.It Sy "Number" Ta Sy "Id"
.It 1 Ta GEM
.It 2 Ta GEM
.It 3 Ta GEM
.It 4 Ta GEM
.El
.Pp
This partitioning will show up in
.Nx
as (Number refers to the first table):
.Pp
.Bl -column "c (whole disk)" "Fstype" "Number"
.It Sy Partition Ta Sy Fstype Ta Sy Number
.It c (whole disk) Ta unused Ta ""
.It d (user part) Ta MSDOS Ta 1
.It e (user part) Ta MSDOS Ta 2
.It f (user part) Ta MSDOS Ta 3
.It g (user part) Ta MSDOS Ta 4
.El
.Pp
Now you decide to change the id of partition 2 and 3 to NBD. Now
.Nx
will show the partitioning as (Number refers to the first table):
.Pp
.Bl -column "c (whole disk)" "Fstype" "Number"
.It Sy Partition Ta Sy Fstype Ta Sy Number
.It a (root) Ta 4.2BSD Ta 2
.It c (whole disk) Ta unused Ta ""
.It d (user part)  Ta MSDOS  Ta 1
.It e (user part)  Ta 4.2BSD Ta 3
.It f (user part)  Ta MSDOS  Ta 4
.El
.Pp
You will notice that the order of the partitions has changed! You will have
to watchout for this. It is a consequence of
.Nx
habit of assigning a predefined meaning to the partitions
.Em a/b
and
.Em c .
.Sh SEE ALSO
.Xr disklabel 8 ,
.Xr installboot 8
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.2 .
.Sh BUGS
The changes made to the AHDI partitions will become active on the next
.Em first open
of the device. You are advised to use
.Nm
only on a device without any mounted or otherwise active partitions. This
is not enforced by
.Nm .
This is particularly confusing when your change caused partitions to shift,
as shown in the example above.
.Pp
As soon as a disk contains at least one NBD partition, you are allowed to
write disklabels and install bootstraps.
