NetBSD/src/usr.sbin/wiconfig/wiconfig.8
.\"	$NetBSD: wiconfig.8,v 1.23 2002/11/16 22:56:06 dyoung Exp $
.\"
.\" Copyright (c) 1997, 1998, 1999
.\"	Bill Paul <wpaul@ctr.columbia.edu> All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	From: wicontrol.8,v 1.6 1999/05/22 16:12:47 wpaul Exp $
.\"
.Dd January 11, 2001
.Dt WICONFIG 8
.Os
.Sh NAME
.Nm wiconfig
.Nd configure WaveLAN/IEEE devices
.Sh SYNOPSIS
.Nm wiconfig
.Ar interface
.Op Fl o
.Op Fl D
.Bk -words
.Op Fl s Ar station name
.Ek
.Bk -words
.Op Fl a Ar access point density
.Ek
.Bk -words
.Op Fl m Ar MAC address
.Ek
.Bk -words
.Op Fl d Ar max data length
.Ek
.Bk -words
.Op Fl r Ar RTS threshold
.Ek
.Bk -words
.Op Fl M Ar 0|1
.Ek
.Bk -words
.Op Fl R Ar 1|3
.Ek
.Sh DESCRIPTION
The
.Nm
command controls the operation of
.Tn WaveLAN/IEEE
wireless networking devices via the
.Xr wi 4
and
.Xr awi 4
drivers.
The
.Nm
command can also be used to view the current settings of these parameters
and to dump out the values of the card's statistics counters.
.Pp
Most of the parameters that can be changed relate to the
.Tn IEEE
802.11 protocol which the
.Tn WaveLAN
implements.
This includes the station name, whether the station is operating
in ad-hoc (point to point) or BSS (service set) mode, and the
network name of a service set to join (IBSS) if BSS mode is enabled.
.Pp
The
.Ar iface
argument given to
.Nm
should be the logical interface name associated with the
.Tn WaveLAN/IEEE
device (e.g. wi0, wi1, etc.).
.Sh OPTIONS
With no extra options,
.Nm
will display the current settings of the specified
.Tn WaveLAN/IEEE
interface.
.Pp
The options are as follows:
.Pp
.Bl -tag -width Fl
.It Fl o
Print out the statistics counters instead of the card settings.
Note that, however, the statistics will only be updated every minute or so.
.It Fl D
This forces the driver to initiate one round of access point scanning.
All of the access points found are displayed.
.It Fl s Ar station name
Sets the
.Ar station name
for the specified interface.  The
.Ar station name
is used for diagnostic purposes.
The
.Tn Lucent
.Tn WaveMANAGER
software can poll the names of remote hosts.
.It Fl a Ar access_point_density
Specify the
.Ar access point density
for a given interface.  Legal values are 1 (low), 2 (medium) and 3 (high).
This setting influences some of the radio modem threshold settings.
.It Fl m Ar MAC address
Set the station address for the specified interface.  The
.Ar MAC address
is specified as a series of six hexadecimal values separated by colons,
e.g. 00:60:1d:12:34:56.
This programs the new address into the card and updates the interface as well.
.It Fl d Ar max_data_length
Set the maximum receive and transmit frame size for a specified interface.
The
.Ar max data length
can be any number from 256 to 2346.  The default is 2304.
.It Fl r Ar RTS threshold
Set the RTS/CTS threshold for a given interface.  This controls the
number of bytes used for the RTS/CTS handshake boundary.  The
.Ar RTS threshold
can be any value between 0 and 2347.  The default is 2347,
which indicates RTS/CTS mechanism never to be used.
.It Fl M Ar 0|1
Enable or disable
.Qq microwave oven robustness
on a given interface.
.It Fl R Ar 1|3
Enable or disable roaming function on a given interface.
The legal values are
.Ar 1
(Roaming handled by firmware) and
.Ar 3
(Roaming Disabled).  The default is 1.
.El
.Sh SEE ALSO
.Xr awi 4 ,
.Xr wi 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
command first appeared in
.Fx 3.0 ,
as
.Ic wicontrol .
It was added to
.Nx 1.5
under its present name.
.Sh AUTHORS
The
.Nm
command was written by
.An Bill Paul Aq wpaul@ctr.columbia.edu .
