NetBSD/src/libexec/rarpd/rarpd.8
.\" @(#) $Header: /cvsroot/src/libexec/rarpd/Attic/rarpd.8,v 1.1 1993/09/07 02:32:36 cassidy Exp $ (LBL)
.\"
.\" Copyright (c) 1988-1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that: (1) source code distributions
.\" retain the above copyright notice and this paragraph in its entirety, (2)
.\" distributions including binary code include the above copyright notice and
.\" this paragraph in its entirety in the documentation or other materials
.\" provided with the distribution, and (3) all advertising materials mentioning
.\" features or use of this software display the following acknowledgement:
.\" ``This product includes software developed by the University of California,
.\" Lawrence Berkeley Laboratory and its contributors.'' Neither the name of
.\" the University nor the names of its contributors may be used to endorse
.\" or promote products derived from this software without specific prior
.\" written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.TH RARPD 8 "26 Oct 1990"
.SH NAME
rarpd \- Reverse ARP Daemon
.SH SYNOPSIS
.na
.B rarpd 
[
.B \-adf
]
[
.I interface
]
.br
.ad
.SH DESCRIPTION
.LP
.I Rarpd
services Reverse ARP requests on the Ethernet connected to
.I interface.
Upon receiving a request, 
.Irarpd
maps the target hardware address to an IP address via its name, which 
must be present in both the
.I ethers(5)
and 
.I hosts(5)
databases.
If a host does not exist in both databses, the translation cannot
proceed and a reply will not be sent.

Additionally, a request is honored only if the server
(i.e., the host that rarpd is running on)
can "boot" the target; that is, if the directory 
/tftpboot/\fIipaddr\fP
exists, where \fIipaddr\fP is the target IP address.

In normal operation, 
.I rarpd
forks a copy of itself and runs in
the background.  Anomalies and errors are reported via 
.I syslog(3).

.SH OPTIONS
.LP
.TP
.B \-a
Listen on all the Ethernets attached to the system.
If `-a' is omitted, an interface must be specified.
.TP
.B \-d
Run in debug mode, with all the output to stderr.
This option implies the -f option.
.TP
.B \-f
Run in the foreground.

.SH FILES
/etc/ethers
.br
/etc/hosts
.br
/tftpboot
.SH SEE ALSO
bpf(4)
.br
RFC 903: Finlayson, R.; Mann, T.; Mogul, J.C.; Theimer, M.  Reverse Address 
Resolution Protocol.  1984 June; 4 p.
.SH AUTHORS
Craig Leres (leres@ee.lbl.gov) and
Steven McCanne (mccanne@ee.lbl.gov).
Lawrence Berkeley Laboratory, University of California, Berkeley, CA.
.SH BUGS
