NetBSD/src/usr.sbin/repquota/repquota.8
.\" Copyright (c) 1983, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Robert Elz at The University of Melbourne.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)repquota.8	8.1 (Berkeley) 6/6/93
.\"	$NetBSD: repquota.8,v 1.18 2017/10/22 18:00:45 abhinav Exp $
.\"
.Dd May 12, 2012
.Dt REPQUOTA 8
.Os
.Sh NAME
.Nm repquota ,
.Nm quotadump
.Nd summarize quotas for a file system
.Sh SYNOPSIS
.Nm
.Op Fl ghuv
.Ar file-system Ar ...
.Nm
.Op Fl ghuv
.Fl a
.Nm
.Fl x
.Op Fl gu
.Ar file-system
.Nm quotadump
.Op Fl gu
.Ar file-system
.Sh DESCRIPTION
.Nm
prints a summary of the disk usage and quotas for the
specified file systems.
.Pp
Available options:
.Bl -tag -width Ds
.It Fl a
Print the quotas of all the mounted file systems.
.It Fl g
Print only group quotas (the default is to print both
group and user quotas if they exist).
.It Fl h
Numbers are displayed in a human readable format.
.It Fl u
Print only user quotas (the default is to print both
group and user quotas if they exist).
.It Fl v
Print a header line before printing each file system quotas.
Print all exiting quotas, including those whose current usage is 0.
.It Fl x
Export file system quota data in a tabular dump format suitable for
.Xr quotarestore 8 .
A single file system should be specified.
.El
.Pp
If invoked as
.Nm quotadump
the behavior is the same as
.Nm repquota Fl x .
.Pp
For each user or group, the current
number files and amount of space (in kilobytes, unless the
.Fl h
flag is used) is
printed, along with any quotas created with
.Xr edquota 8 .
.Pp
Only the super-user may use this command.
.Sh SEE ALSO
.Xr quota 1 ,
.Xr libquota 3 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr quotacheck 8 ,
.Xr quotaon 8 ,
.Xr quotarestore 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
