NetBSD/src/share/man/man8/man8.hp300/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.hp300/MAKEDEV and
.\" *** src/share/man/man8/man8.hp300/MAKEDEV.8.template
.\" *** 
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\"	$NetBSD: MAKEDEV.8,v 1.10 2000/05/02 00:30:57 hubertf Exp $
.\"
.\" Copyright (c) 1991, 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	8.2 (Berkeley) 1/12/94
.\"
.Dd October 19, 1997
.Dt MAKEDEV 8 hp300
.Os
.Sh NAME
.Nm MAKEDEV ,
.Nm makedev
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar device_name Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create the common special
files.
.\" See
.\" .Xr special 8
.\" for a more complete discussion of special files.
.Pp
.Nm
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are several special devices:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar std
Standard devices
.It Ar local
Configuration specific devices
.El
.Pp
The
.Tn HP300
supports the following devices.
Where a device name is followed by a hash sign
.Ql \&# ,
the hash sign
must be replaced by a unit number.
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar ct#
HP300 HP-IB cartridge tape, see
.Xr ct 4 
. It Ar mt#
(Magnetic) 9-track reel tape
. It Ar st#
Exabyte tape, see
.Xr st 4 
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar ccd#
``concatenated'' pseudo-disks, see
.Xr ccd 4 
. It Ar md#
Memory pseudo-disk devices, see
.Xr md 4 
. It Ar raid#
RAIDframe disk driver, see
.Xr raid 4 
. It Ar rd#
HP300 HP-IB disks, see
.Xr rd 4 
. It Ar sd#
HP300 SCSI disks, see
.Xr sd 4 
. It Ar vnd#
``file'' pseudo-disks, see
.Xr vnd 4 
. El
.It Terminal multiplexors:
. Bl -tag -width 0123456789 -compact
. It Ar dca#
HP200/300 single port serial interface, see
.Xr dca 4 
. It Ar dcm#
HP200/300 4 port serial mux interface, see
.Xr dcm 4 
. It Ar apci#
HP400 4 port serial mux interface
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr pty 4 
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar fd
File descriptors
. It Ar grf#
Raw interface to HP300 graphics devices, see
.Xr grf 4 
. It Ar ite#
Terminal emulator interface to HP300 graphics devices, see
.Xr ite 4 
. It Ar hil
HP300 HIL input devices, see
.Xr hil 4 
. It Ar bpf#
Packet filter, see
.Xr bpf 4 
. It Ar tun#
Network tunnel driver, see
.Xr tun 4 
. It Ar lkm
Loadable kernel modules interface, see
.Xr lkm 4 
. It Ar ipl
IPilter control
. It Ar random
Random number generator
. It Ar scsibus#
SCSI busses, see
.Xr scsictl 8 ,
.Xr scsi 4 
. El
.El
.Sh FILES
.Bl -tag -width xxxx -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr mknod 1 ,
.Xr intro 4 ,
.Xr config 8 .
