NetBSD/src/share/man/man4/man4.dreamcast/gdrom.4
.\"	$NetBSD: gdrom.4,v 1.3.32.1 2008/06/02 13:21:38 mjf Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by ITOH Yasufumi.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 17, 2002
.Dt GDROM 4 dreamcast
.Os
.Sh NAME
.Nm gdrom
.Nd GD-ROM disk driver
.Sh SYNOPSIS
.Cd "gdrom0 at shb?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Dreamcast CD-ROM
.Pq Dq GD-ROM
storage device.
.Sh FILES
.Bl -tag -width /dev/rgdromXXXX -compact
.It Pa /dev/gdrom0 Ns Ar p
block mode
GD-ROM disk
partition
.Ar p
.It Pa /dev/rgdrom0 Ns Ar p
raw mode
GD-ROM disk
partition
.Ar p
.El
.\" .Sh SEE ALSO
.\" .Xr cd 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 1.6 .
