NetBSD/src/usr.sbin/netgroup_mkdb/netgroup_mkdb.8
.\"
.\" Copyright (c) 1994 Christos Zoulas
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christos Zoulas.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$Id: netgroup_mkdb.8,v 1.1 1994/12/04 17:11:42 christos Exp $
.\"
.Dd February 3, 1994
.Dt NETGROUP_MKDB 8 
.Os
.Sh NAME
.Nm netgroup_mkdb 
.Nd generate the netgroup databases
.Sh SYNOPSIS
.Nm netgroup_mkdb 
.Op Fl o Ar database
.Ar file
.Sh DESCRIPTION
.Nm Netgroup_mkdb
creates
.Xr db 3
style databases for the specified file.
These databases are then installed into 
.Pa /etc/netgroup.db.
The file must be in the correct format (see
.Xr netgroup 5 ).
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl o Ar database
Put the output databases in the named file.
.El
.Pp
The databases are used by the C library netgroup routines (see
.Xr getnetgrent 3 ).
.Pp
.Nm Netgroup_mkdb
exits zero on success, non-zero on failure.
.Sh FILES
.Bl -tag -width 24n -compact
.It Pa /etc/netgroup.db
The current netgroup database
.It Pa /etc/netgroup
The current netgroup file
.El
.Sh SEE ALSO
.Xr db 3 ,
.Xr getnetgrent 3 ,
.Xr netgroup 5 
