NetBSD/src/usr.bin/mixerctl/mixerctl.1
.\" $NetBSD: mixerctl.1,v 1.3 1997/10/08 22:20:39 jtc Exp $
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 4, 1997
.Dt MIXERCTL 1
.Os
.Sh NAME
.Nm mixerctl
.Nd control audio mixing
.Sh SYNOPSIS
.Nm mixerctl
.Op Fl f Ar file
.Op Fl n
.Op Fl v
.Fl a
.Nm mixerctl
.Op Fl f Ar file
.Op Fl n
.Op Fl v
.Ar name ...
.Nm mixerctl
.Op Fl f Ar file
.Op Fl n
.Fl w
.Ar name=value ...
.Sh DESCRIPTION
The 
.Nm mixerctl
command displays or sets various audio system mixing variables.
If a list of variables is present on the command line, then
.Nm mixerctl
prints the current value of those variables for the specified device.
If the 
.Fl a
flag is specified, all variables for the device are printed.
If the
.Fl w
flag is specified
.Nm mixerctl
attempts to set the specified variables to the given values.
.Pp
The
.Fl f
flag can be used to give an alternative mixer device, the default is
.Pa /dev/mixer.
.Pp
The
.Fl n
flag suppresses printing of the variable name.
.Pp
The
.Fl v
flag shows the possible values of enumeration and set valued
variables.  Enumerated values are shown in [] and set values
are shown in {}.
.Sh FILES
.Bl -tag -width /dev/mixer
.It Pa /dev/mixer
mixer audio device
.El
.Sh SEE ALSO
.Xr audioctl 1 ,
.Xr audio 4 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm mixerctl
command first appeared in
.Nx 1.3 .

