NetBSD/src/usr.bin/videoctl/videoctl.1
.\" $NetBSD: videoctl.1,v 1.2 2010/12/26 14:26:45 wiz Exp $
.\"
.\" Copyright (c) 2010 Jared D. McNeill <jmcneill@invisible.ca>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 26, 2010
.Dt VIDEOCTL 1
.Os
.Sh NAME
.Nm videoctl
.Nd control video device
.Sh SYNOPSIS
.Nm
.Op Fl d Ar device
.Fl a
.Nm
.Op Fl d Ar device
.Ar name ...
.Nm
.Op Fl d Ar device
.Fl w
.Ar name=value ...
.Sh DESCRIPTION
The
.Nm
command displays or sets various video system driver variables.
If a list of variables is present on the command line, then
.Nm
prints the current value of those variables for the specified device.
If the
.Fl a
flag is specified, all variables for the device are printed.
If the
.Fl w
flag is specified
.Nm
attempts to set the specified variables to the given values.
The
.Fl d
flag can be used to specify an alternate video device.
If
.Fl d
is not specified,
.Pa /dev/video0
is used.
.Sh FILES
.Bl -tag -width /dev/video0 -compact
.It Pa /dev/video0
video device
.El
.Sh SEE ALSO
.Xr video 4
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 6.0 .
