NetBSD/src/usr.sbin/ldpd/ldpd.conf.5
.\"	$NetBSD: ldpd.conf.5,v 1.2.8.2 2014/08/20 00:05:09 tls Exp $
.\"
.\" Copyright (c) 2013 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 18, 2013
.Dt LDPD.CONF 5
.Os
.Sh NAME
.Nm ldpd.conf
.Nd ldpd configuration file
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm
file defines the
.Xr ldpd 8
initial setup and may contain information about LDP identificator, network,
neighbour and interface parameters.
Blank lines are allowed and comments lines should start with
.Sq # .
Non block lines should end with a semicolon.
.Sh FILES
.Bl -tag -width /etc/ldpd.conf -compact
.It Pa /etc/ldpd.conf
The file
.Nm
resides in
.Pa /etc .
.El
.Sh CONFIGURATION
The following options are accepted:
.Bl -tag -width "keepalive-time"
.It Li command-port
Control and command TCP port (default: 2626)
.It Li hello-time
Interval in seconds on which hellos are sent out on interfaces (default: 6s)
.It Li interface
Interface block commands (see below)
.It Li keepalive-time
Keepalive interval in seconds for established peers (default: 4s)
.It Li ldp-id
Force using a certain LDP Identificator (default autogenerated, highest INET4
address set on an interface excluding 127/8 range)
.It Li min-label
Minimum number used for generated labels (default: 16)
.It Li max-label
Maximum number used for generated labels (default: 1048576)
.It Li neighbour
Neighbour block subcommands (see below)
.It Li no-default-route
If set to 0
.Xr ldpd 8
will try to tag also the default route (default: 1)
.El
.Pp
Interface block supports the following parameters
.Bl -tag -width "transport-address"
.It Li passive
Don't send hellos on interface
.It Li transport-address
Transport INET4 address advertised in hellos sent on the mentioned interface
.El
.Pp
Neighbour block supports the following parameters
.Bl -tag -width "authenticate"
.It Li authenticate
Authenticate peer using TCP MD5 signature - needs options TCP_SIGNATURE.
Default: off
.El
.Sh EXAMPLES
The following is an example
.Pa /etc/ldpd.conf
file:
.Pp
.Bd -literal
# Transport address needs to be an alias for this interface
interface re0 {
	transport-address 192.168.2.2
}

# Don't send hellos on en0
interface en0 {
	passive
}

# Force a certain LDP ID
ldp-id 10.5.1.1;

# Tag also the default route
no-default-route 0;

neighbour 192.168.2.1 {
# TCP MD5 authentication - requires options TCP_SIGNATURE
	authenticate
}
.Ed
.Sh SEE ALSO
.Xr mpls 4 ,
.Xr ldpd 8
.Sh HISTORY
Support for
.Nm
first appeared in
.Nx 6.0 .
