NetBSD/src/usr.sbin/ldpd/ldpd.8
.\" $NetBSD: ldpd.8,v 1.8 2013/02/04 10:53:14 kefren Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"  1. Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\"  2. Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 4, 2013
.Dt LDPD 8
.Os
.Sh NAME
.Nm ldpd
.Nd Label Distribution Protocol Daemon
.Sh SYNOPSIS
.Nm
.Op Fl DdfhW
.Op Fl c Ar config_file
.Op Fl p Ar port
.Sh DESCRIPTION
.Nm
is a utility used to automatically distribute labels between two MPLS LSRs
conforming to RFC5036.
Currently some features described by RFC5036 are not fully implemented (see
.Sx BUGS
section).
.Nm
supports peering with IPv6 LDP speakers and IPv6 labels exchange, conforming
to specifications in RFC5036 and draft-ietf-mpls-ldp-ipv6.
.Pp
.Nm
logs information using the
.Xr syslog 3
interface.
You can increase the log verbosity using the
.Fl W
and
.Fl D
flags.
.Pp
Administrators can use
.Xr telnet 1
to connect to the control port (default: 2626) and use
this interface in order to get informations about protocol status,
neighbours et cetera but also to set runtime parameters.
The password required for connecting is the same as the root password.
.Pp
.Nm
computes existing routes and tries to match them on MPLS labels
announced by other LDP peers.
This means that usual IP
routes will be changed into tagged routes, and MPLS routing table
will be populated.
Any change in MPLS topology will also be announced to LDP neighbors.
.Nm
uses currently Independent Control Mapping and Downstream Unsolicited mode
for Label Advertisment.
.Nm
will listen on a route socket and compute the necessary changes in
order to change untagged routes into tagged routes.
This means that one may use one's favourite dynamic routing protocol
daemon without modifications.
.Pp
The options are as follows:
.Bl -tag -width 15n
.It Fl c Ar config_file
Specifies a path to the config file.
Default:
.Pa /etc/ldpd.conf
- see
.Xr ldpd.conf 5
for configuration file format.
.It Fl D
Enable debug mode.
.It Fl d
Don't use route interception code.
.Nm
will not make any changes to routing table if started with this option.
.It Fl f
Run in foreground.
Use STDOUT for warning and debug messages.
.It Fl h
Outputs supported flags.
.It Fl p Ar port
Changes the TCP control port (default: 2626).
.It Fl W
Enable output of warning messages.
.El
.Sh SECURITY CONSIDERATIONS
As a security measure you SHOULD filter the LDP well-known (646)
TCP and UDP ports using your favourite packet filter before starting
.Nm .
This is the current way used to filter neighbours and to protect the
system of possible external attacks like route injections.
.Sh SEE ALSO
.Rs
.%R RFC
.%N 5036
.%D October 2007
.%T LDP Specification
.Re
.Rs
.%R RFC
.%N 3037
.%D January 2001
.%T LDP Applicability
.Re
.Rs
.%R DRAFT
.%N draft-ietf-mpls-ldp-ipv6-07
.%D June 2012
.%T Updates to LDP for IPv6
.Re
.Sh HISTORY
The
.Nm
command appeared in
.Nx 6.0 .
.Sh BUGS
.Nm
doesn't implement Path Vector and Hop Count TLVs.
