NetBSD/src/usr.sbin/ldpd/ldpd.8
.\" $NetBSD: ldpd.8,v 1.5 2011/07/07 05:20:16 kefren Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"  1. Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\"  2. Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 7, 2011
.Dt LDPD 8
.Os
.Sh NAME
.Nm ldpd
.Nd Label Distribution Protocol Daemon
.Sh SYNOPSIS
.Nm
.Op Fl DdfhW
.Op Fl c Ar config_file
.Op Fl p Ar port
.Sh DESCRIPTION
.Nm
is a utility used to automatically distribute labels between two MPLS LSRs
almost conforming to RFC3036.
Right now it is in BETA stage and many features
are not implemented or may not work.
As a security measure you SHOULD filter the LDP well-known (646)
TCP and UDP ports using your favourite packet filter before starting
.Nm .
Also this is the current measure used to filter neighbours.
You should see some logs reported via
.Xr syslog 3
interface.
.Pp
You can increase the log verbosity using the
.Fl W
and
.Fl D
flags.
Also you can telnet to the control port (default: 2626) and use
this interface in order to get informations about protocol, neighbours
etc. but also to set runtime parameters.
The required password is the same as the root password.
.Pp
.Nm
computes existing routes and tries to match them on MPLS labels
announced by other LDP peers.
This means that
.Dq normal
routes will be changed into tagged routes, and MPLS routing table
will be populated.
It will also announce its mappings to its peers.
.Nm
will listen on a route socket and compute the necessary changes in
order to change untagged routes into tagged routes.
This means that one may use one's favourite dynamic routing protocol
daemon without modifications.
.Pp
The options are as follows:
.Bl -tag -width 15n
.It Fl c Ar config_file
Specifies a path to the config file.
Default:
.Pa /etc/ldpd.conf
- see
.Xr ldpd.conf 5
for configuration file format.
.It Fl D
Enable debug mode.
.It Fl d
Don't use route interception code.
.It Fl f
Run in foreground.
Use STDOUT for warning and debug messages.
.It Fl h
Outputs supported flags.
.It Fl p Ar port
Changes the TCP control port (default: 2626).
.It Fl W
Enable output of warning messages.
.El
.Sh SEE ALSO
.Rs
.%R RFC
.%N 3036
.%D January 2001
.%T LDP Specification
.Re
.Rs
.%R RFC
.%N 3037
.%D January 2001
.%T LDP Applicability
.Re
.Sh HISTORY
The
.Nm
command appeared in
.Nx 6.0 .
.Sh BUGS
.Nm
supports only IPv4 and doesn't implement Path Vector and Hop Count TLVs.
