/*	$NetBSD: dino.c,v 1.2.10.3 2017/12/03 11:36:16 jdolecek Exp $ */

/*	$OpenBSD: dino.c,v 1.5 2004/02/13 20:39:31 mickey Exp $	*/

/*
 * Copyright (c) 2003 Michael Shalayeff
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL THE AUTHOR OR HIS RELATIVES BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF MIND, USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
 * THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <sys/cdefs.h>
__KERNEL_RCSID(0, "$NetBSD: dino.c,v 1.2.10.3 2017/12/03 11:36:16 jdolecek Exp $");

/* #include "cardbus.h" */

#include <sys/param.h>
#include <sys/systm.h>
#include <sys/device.h>
#include <sys/reboot.h>
#include <sys/malloc.h>
#include <sys/extent.h>

#include <machine/iomod.h>
#include <machine/autoconf.h>
#include <machine/intr.h>

#include <hppa/include/vmparam.h>
#include <hppa/dev/cpudevs.h>

#if NCARDBUS > 0
#include <dev/cardbus/rbus.h>
#endif

#include <dev/pci/pcireg.h>
#include <dev/pci/pcivar.h>
#include <dev/pci/pcidevs.h>

#define	DINO_MEM_CHUNK	0x800000

/* from machdep.c */
extern struct extent *hppa_io_extent;

struct dino_regs {
	/* HPA Supervisory Register Set */
	uint32_t	pad0;		/* 0x000 */
	uint32_t	iar0;		/* 0x004 rw intr addr reg 0 */
	uint32_t	iodc;		/* 0x008 rw iodc data/addr */
	uint32_t	irr0;		/* 0x00c r  intr req reg 0 */
	uint32_t	iar1;		/* 0x010 rw intr addr reg 1 */
	uint32_t	irr1;		/* 0x014 r  intr req reg 1 */
	uint32_t	imr;		/* 0x018 rw intr mask reg */
	uint32_t	ipr;		/* 0x01c rw intr pending reg */
	uint32_t	toc_addr;	/* 0x020 rw TOC addr reg */
	uint32_t	icr;		/* 0x024 rw intr control reg */
	uint32_t	ilr;		/* 0x028 r  intr level reg */
	uint32_t	pad1;		/* 0x02c */
	uint32_t	io_command;	/* 0x030  w command register */
	uint32_t	io_status;	/* 0x034 r  status register */
	uint32_t	io_control;	/* 0x038 rw control register */
	uint32_t	pad2;		/* 0x03c AUX registers follow */

	/* HPA Auxiliary Register Set */
	uint32_t	io_gsc_err_addr;/* 0x040 GSC error address */
	uint32_t	io_err_info;	/* 0x044 error info register */
	uint32_t	io_pci_err_addr;/* 0x048 PCI error address */
	uint32_t	pad3[4];	/* 0x04c */
	uint32_t	io_fbb_en;	/* 0x05c fast back2back enable reg */
	uint32_t	io_addr_en;	/* 0x060 address enable reg */
	uint32_t	pci_addr;	/* 0x064 PCI conf/io/mem addr reg */
	uint32_t	pci_conf_data;	/* 0x068 PCI conf data reg */
	uint32_t	pci_io_data;	/* 0x06c PCI io data reg */
	uint32_t	pci_mem_data;	/* 0x070 PCI memory data reg */
	uint32_t	pad4[0x740/4];	/* 0x074 */

	/* HPA Bus (GSC) Specific-Dependent Register Set */
	uint32_t	gsc2x_config;	/* 0x7b4 GSC2X config reg */
	uint32_t	pad5[0x48/4];	/* 0x7b8: BSRS registers follow */

	/* HPA HVERSION (Dino)-Dependent Register Set */
	uint32_t	gmask;		/* 0x800 GSC arbitration mask */
	uint32_t	pamr;		/* 0x804 PCI arbitration mask */
	uint32_t	papr;		/* 0x808 PCI arbitration priority */
	uint32_t	damode;		/* 0x80c PCI arbitration mode */
	uint32_t	pcicmd;		/* 0x810 PCI command register */
	uint32_t	pcists;		/* 0x814 PCI status register */
	uint32_t	pad6;		/* 0x818 */
	uint32_t	mltim;		/* 0x81c PCI master latency timer */
	uint32_t	brdg_feat;	/* 0x820 PCI bridge feature enable */
	uint32_t	pciror;		/* 0x824 PCI read optimization reg */
	uint32_t	pciwor;		/* 0x828 PCI write optimization reg */
	uint32_t	pad7;		/* 0x82c */
	uint32_t	tltim;		/* 0x830 PCI target latency reg */
};

struct dino_softc {
	device_t sc_dv;

	int sc_ver;
	void *sc_ih;
	struct hppa_interrupt_register sc_ir;
	bus_space_tag_t sc_bt;
	bus_space_handle_t sc_bh;
	bus_dma_tag_t sc_dmat;
	volatile struct dino_regs *sc_regs;

	struct hppa_pci_chipset_tag sc_pc;
	struct hppa_bus_space_tag sc_iot;
	char sc_ioexname[20];
	struct extent *sc_ioex;
	struct hppa_bus_space_tag sc_memt;
	int sc_memrefcount[30];
	struct hppa_bus_dma_tag sc_dmatag;
};

int	dinomatch(device_t, struct cfdata *, void *);
void	dinoattach(device_t, device_t, void *);
static device_t	dino_callback(device_t, struct confargs *);

CFATTACH_DECL_NEW(dino, sizeof(struct dino_softc), dinomatch, dinoattach, NULL,
    NULL);

void dino_attach_hook(device_t, device_t,
    struct pcibus_attach_args *);
void dino_enable_bus(struct dino_softc *, int);
int dino_maxdevs(void *, int);
pcitag_t dino_make_tag(void *, int, int, int);
