NetBSD/src/sbin/fsck_exfatfs/fsck_exfatfs.8
.\"	$NetBSD: fsck_exfatfs.8,v 1.1.2.1 2024/06/29 19:43:25 perseant Exp $
.\"
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)newlfs.8	8.1 (Berkeley) 6/19/93
.\"
.Dd January 15 2024
.Dt FSCK_EXFATFS 8
.Os
.Sh NAME
.Nm fsck_exfatfs
.Nd construct a new exFAT file system
.Sh SYNOPSIS
.Nm
.Op Fl b Ar block
.Op Fl dfnpqvy
.Ar special
.Sh DESCRIPTION
.Nm
performs interactive filesystem consistency checks and repair for
each of the filesystems specified on the command line.
It is normally invoked from
.Xr fsck 8 .
.Pp
For each corrected inconsistency one or more lines will be printed
identifying the filesystem on which the correction will take place,
and the nature of the correction.
After successfully correcting a filesystem,
.Nm
will print the number of files on that filesystem,
the number of used and free blocks,
and the percentage of fragmentation.

.Pp
Without the
.Fl p
option,
.Nm
audits and interactively repairs inconsistent conditions for filesystems.
If the filesystem is inconsistent, the operator is prompted for concurrence
before each correction is attempted.
It should be noted that some of the corrective actions will result in
some loss of data.
The amount and severity of data lost may be determined from the diagnostic
output.
The default action for each consistency correction
is to wait for the operator to respond
.Li yes
or
.Li no .
If the operator does not have write permission on the filesystem
.Nm
will default to a
.Fl n
action.
.Pp
The following flags are interpreted by
.Nm :
.Bl -tag -width XbXblockXX
.It Fl b Ar block
Use
.Ar block
as the super block for the filesystem.
.It Fl d
Print debugging output.
.It Fl f
Force checking of file systems.
Normally, if a file system is cleanly unmounted, the kernel will
set a
.Dq clean flag
in the file system superblock, and
.Nm
will not check the file system.
This option forces
.Nm
to check the file system, regardless of the state of the clean flag.
.It Fl n
Assume a no response to all questions asked by
.Nm
except for
.Ql CONTINUE? ,
which is assumed to be affirmative;
do not open the filesystem for writing.
.It Fl p
Specify
.Dq preen
mode.  XXX what does preen mode do?
.It Fl q
Quiet mode, do not output any messages for clean filesystems.
.It Fl v
Verbose mode.  Provide more information about
.Nm
\&'s activity.
.It Fl y
Assume a yes response to all questions asked by
.Nm ;
this should be used with great caution as this is a free license
to continue after essentially unlimited trouble has been encountered.
.El
.Pp
Because of inconsistencies between the block device and the buffer cache,
the raw device should always be used.
.Sh SEE ALSO
.Xr disklabel 8 ,
.Xr diskpart 8
.\" .Xr exfatfs 5 ,
.Xr fsck 8 ,
.Xr fstab 5 ,
.Xr reboot 8
.Rs
.%A Microsoft
.%T "exFAT file system specification"
.%D April 14, 2022
.Re
.Sh HISTORY
The
.Nm
command appeared in
.Nx 11.0 .
