NetBSD/src/usr.bin/realpath/realpath.1
.\"	$NetBSD: realpath.1,v 1.2 2022/07/21 09:47:31 kre Exp $
.\"-
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Institute of Electrical and Electronics Engineers, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)pwd.1	8.2 (Berkeley) 4/28/95
.\" From: src/bin/pwd/pwd.1,v 1.11 2000/11/20 11:39:39 ru Exp
.\" $FreeBSD: head/bin/realpath/realpath.1 314436 2017-02-28 23:42:47Z imp $
.\"
.Dd July 21, 2022
.Dt REALPATH 1
.Os
.Sh NAME
.Nm realpath
.Nd return resolved canonical path
.Sh SYNOPSIS
.Nm
.Op Fl eEq
.Op Ar path ...
.Sh DESCRIPTION
The
.Nm
utility uses the
.Xr realpath 3
function to resolve all symbolic links, extra
.Ql /
characters and references to
.Pa /./
and
.Pa /../
in each
.Ar path ,
and writes the result of each to standard output
followed by a newline.
If
.Ar path
is absent, the current working directory
.Pq Sq Pa .\&
is assumed.
.Pp
With the
.Fl E
option
(the default)
it is not an error for the final component
of the resolved pathname to reference a file
which does not exist.
.Pp
The
.Fl e
option reverses the effect of
.Fl E ,
requiring the 
.Ar path
to resolve to an existing pathname.
.Pp
If
.Fl q
is specified, warnings will not be printed when
.Xr realpath 3
fails.
Messages about other errors, such as bad usage, are still printed.
.Pp
On error, nothing is written
to standard output for that
.Ar path .
If
.Fl q
was not given a diagnostic is written to standard error.
.Sh EXIT STATUS
.Ex -std
Any failure to resolve a
.Ar path
is an error for this purpose,
the
.Fl q
option is irrelevant.
.Sh SEE ALSO
.Xr readlink 1
.Xr realpath 3
.Sh STANDARDS
The
.Nm
utility is expected to comply with the forthcoming
edition of the POSIX standard.
To be fully POSIX compliant, applications must use
either the
.Fl e
or
.Fl E
option, as which of those (if in fact either, and
not some other behaviour) applies in their absence
is unspecified.
The standard requires support for only a single, mandatory,
.Ar path
argument.
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 4.3
and was imported into
.Nx 10 ,
but modified to be slightly more compatible with the coreutils version,
and the proposed POSIX standard requirements.
