NetBSD/src/share/man/man4/man4.sparc64/envmon.4
.\"	$NetBSD: envmon.4,v 1.1 2026/09/07 07:41:38 jdc Exp $
.\"
.\" Copyright (c) 2026 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Julian Coleman.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 30, 2026
.Dt ENVMON 4
.Os
.Sh NAME
.Nm auxfan
.Nd Sun Ultra and Fire environmental monitor
.Sh SYNOPSIS
.Cd "envmon* at ebus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Ql env-monitor
sensor found on Sun Ultra 25/45 and Fire V215/V245 machines.
On the Ultra machines, the sensor reports the front panel temperature.
On the Fire machines, the sensor reports the front fan tray fan speeds,
the fan fault indicator, the front panel temperature,
the keyswitch indicators, and controls the front and rear status LED's.
.Pp
Temperature, fan speeds, and indicators are reported via the
.Xr envsys 4
framework, whilst LED's are exposed via the
.Xr led 4
framework.
The fan fault indicator has a value of
.Em 0
in normal operation.
If a fault is detected, the fan fault value will represent the numbers
of the failed fan trays,
.Em 1
for fan tray 0,
.Em 10
for fan tray 1, and so on, to
.Em 100000
for fan tray 5.
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr intro 4
.Xr led 4 ,
.Xr envstat 8 ,
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 11.1 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Julian Coleman Aq Mt jcoleman@NetBSD.org .

