NetBSD/src/share/man/man4/man4.sparc64/tadpmu.4
.\"	$NetBSD: tadpmu.4,v 1.2 2020/05/18 16:42:05 wiz Exp $
.\"
.\" Copyright (c) 2020 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Julian Coleman
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 16, 2020
.Dt TADPMU 4 sparc64
.Os
.Sh NAME
.Nm tda
.Nd Tadpole PMU
.Sh SYNOPSIS
.Cd "Tadpole PMU Version 1.33"
.Sh DESCRIPTION
The
.Nm
driver provides basic support for the Tadpole PMU found in Tadpole SPARCle
and Viper systems.
The status of the AC adapter, battery, and fan are reported via the
.Xr envstat 8
interface, and AC adapter and lid switch events are reported via the
.Xr sysmon_pswitch 9
interface.
.Sh SEE ALSO
.Xr envstat 8
.Sh BUGS
The battery status is reported by reading the battery voltage.
Pp.
The points at which the battery level becomes warning and critical are
reported by the PMU, but are not directly correlated with battery voltage,
so might be misreported by the driver.
