NetBSD/src/share/man/man8/man8.sun3/boot.8
.\"	$NetBSD: boot.8,v 1.2 1996/08/09 10:32:24 mrg Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_sparc.8	8.2 (Berkeley) 4/19/94
.\"
.Dd April 19, 1994
.Dt REBOOT 8 sun3
.Os
.Sh NAME
.Nm reboot
.Nd
.Tn UNIX
bootstrapping procedures
.Sh SYNOPSIS
.Nm reboot
.Op Fl n
.Op Fl q
.Oo
.Ar -- <boot string>
.Oc
.Sh DESCRIPTION
.Sy Power fail and crash recovery.
Normally, the system will reboot itself at power-up or after crashes.
An automatic consistency check of the file systems will be performed
as described in
.Xr fsck 8 .
and unless this fails, the system will resume multi-user operations.
.Pp
.Sy Cold starts
A disk-boot program (/usr/mdec/ufsboot) will attempt to load
.Pa netbsd
from partition A of the boot device,
which must currently be an ``sd'' disk.
Alternatively, network boot program (/usr/mdec/netboot) will load
.Pa netbsd
from the NFS root as determined by the procedure described in
.Xr diskless 8 .
.Pp
The
.Op Fl s
flag to the boot loader will being the system up in single-user mode.
The
.Op Fl a
flag instructs the system to prompt for the location of the root filesystem
and the primary swap partition.
The
.Op Fl d
flag to the boot loader will bring the system up in debug mode.
Here it waits for a kernel debugger connect; see
.Xr ddb 8 .
Any extra flags or arguments, the after the -- separator,
.Ar <boot string>
are passed to the boot prom.
Other flags are currently ignored.
.Pp
At any time you can break back to the rom by pressing the `L1' and `a'
keys at the same time (if the console is a serial port the same is
achieved by sending a `break').
If you do this accidentally you can continue whatever was in progress
by typing `c' followed by the return key.
.Pp
.Sh FILES
.Bl -tag -width /usr/mdec/installboot -compact
.It Pa /netbsd
system code
.It Pa /usr/mdec/bootxx
first-level boot block for disks
.It Pa /usr/mdec/netboot
boot program for NFS (diskless) boot
.It Pa /usr/mdec/ufsboot
second-level boot program for UFS disks
.It Pa /usr/mdec/installboot
program to install bootxx on a disk
.El
.Sh SEE ALSO
.Xr crash 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
.Xr halt 8 ,
.Xr init 8 ,
.Xr rc 8 ,
.Xr shutdown 8 ,
.Xr syslogd 8
