NetBSD/src/sbin/swap/swap.8
.\"	$NetBSD: swap.8,v 1.1.2.2.2.3 1997/05/11 13:54:03 mrg Exp $
.\"
.\" Copyright (c) 1997 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Matthew R. Green.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 14, 1997
.Dt SWAP 8
.Os 
.Sh NAME
.Nm swap
.Nd system swap management tool
.Sh SYNOPSIS
.Nm
.Op Fl A
.Op Fl p Ar priority
.Nm swap
.Op Fl a | Fl c
.\" SWAP_OFF_WORKS: .Op Fl a | Fl c | Fl d
.Op Fl p Ar priority
.Ar path
.Nm swap
.Op Fl l | Fl s
.Op Fl k
.Nm swapon
.Op Fl a
.Ar path
.\" .Nm swapoff
.\" .Ar path
.Sh DESCRIPTION
The
.Nm
program adds,
.\" SWAP_OFF_WORKS: removes,
lists and prioritizes swap devices and files for the system.
The
.Nm swapon
program acts the same as the
.Nm
program, as if called with the
.Fl a
option, except if
.Nm swapon
itself is called with
.Fl a
in which case,
.Nm swapon
acts as 
.Nm
with the
.Fl A
option.
.Sh OPTIONS
The following options are available:
.Bl -tag -width Sxxxsuffix
.It Fl A
This options causes
.Nm
to read the
.Pa /etc/fstab
file for devices and files with a ``sw'' type, and adds all these entries
as swap devices.
.It Fl a
The
.Fl a
option requires that a
.Ar path
also be in the argument list.  The
.Ar path
is added to the kernel's list of swap devices using the
.Xr swapon 2
system call.  The priority set by having ``priority=N'' in the
mount options field of the 
.Xr fstab 5 
file.
.It Fl c
The
.Fl c
option changes the priority of the listed swap device or file.
.\" .It Fl d
.\" The
.\" .Fl d
.\" option removes the listed
.\" .Ar path
.\" from the kernel's list of swap devices or files.
.It Fl l
The
.Fl l
option lists the current swap devices and files, and their usage statistics.
.It Fl s
The
.Fl s
option displays a single line summary of current swap statistics.
.It Fl p
The
.Fl p
option sets the priority of swap devices or files to the
.Ar priority
argument.  This works with the
.\" .Fl d ,
.Fl a
and
.Fl l
options.
.It Fl k
The
.Fl k
option uses 1024 byte blocks instead of the default 512 byte.
.El
.Sh HISTORY
The
.Nm
program was first made available in
.Nx 1.3 .
The original
.Nm swapon
program appeared in
.Bx 4.0 ,
but is no longer distributed with
.Nx .
.Sh AUTHOR
The
.Nm
program was written by Matthew R. Green <mrg@eterna.com.au>.
.Sh SEE ALSO
.Xr swapon 2 ,
.Xr fstab 5 .
