NetBSD/src/share/man/man4/man4.mac68k/ascaudio.4
.\"	$NetBSD: ascaudio.4,v 1.2 2024/08/01 14:59:38 uwe Exp $
.\" Copyright (c) 2024  Nathanial Sloss <nathanialsloss@yahoo.com.au>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 29, 2024
.Dt ASCAUDIO 4 mac68k
.Os
.Sh NAME
.Nm ascaudio
.Nd MAC68K Apple Sound Chip
.Pq Tn ASC
built-in audio.
.Sh SYNOPSIS
.Cd ascaudio* at obio? flags 0x00
.Cd audio* at audiobus?
.Cd spkr* at audio?
.Cd wsbell* at spkr?
.Sh DESCRIPTION
.Nm
provides an audio device for the (Enchanced) Apple Sound Chip.
It is implemented as an
.Xr audio 4
device.
.Sh CONFIGURATION
The
.Nm
driver supports the following
.Sy flags
for use in
.Xr config 1
files:
.Pp
.Bl -tag -offset indent -width Dv
.It Li 0x0 Pq Dv DEFQUALTY :
22257\^Hz Monaural playback.
.It Li 0x1 Pq Dv LOWQUALITY :
Half playback rate.
Monoaural, intended for machines with slower clock rates.
.It Li 0x2 Pq Dv HIGHQUALITY :
Best Quality supported by
.Tn ASC .
This would be stereo on equipped machines.
.El
.\"
.Sh BUGS
Recording only works on some machines as audio routing is required, yet not fully analyzed.
.Sh SEE ALSO
.Xr mac68k/asc 4 ,
.Xr audio 4 ,
.Xr spkr 4 ,
.Xr wsbell 4
