NetBSD/src/usr.sbin/rtsold/rtsold.8
.\"	$NetBSD: rtsold.8,v 1.42 2020/04/17 13:36:49 kim Exp $
.\"	$KAME: rtsold.8,v 1.17 2001/07/09 22:30:37 itojun Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 15, 2020
.Dt RTSOLD 8
.Os
.\"
.Sh NAME
.Nm rtsold ,
.Nm rtsol
.Nd router solicitation daemon
.\"
.Sh DESCRIPTION
.Nm
and
.Nm rtsol
have been removed from
.Nx
as their functionality is now included in
.Xr dhcpcd 8 .
.Pp
For example to send a router solicitation message and print information
about the response without changing the actual routing table:
.Pp
.Dl dhcpcd -dB6T --nodhcp6 < Ns Ar interface Ns \^>
.Pp
To quietly send a router solicitation message:
.Pp
.Dl dhcpcd -q6T --nodhcp6 < Ns Ar interface Ns \^>
.Pp
The
.Xr ifconfig.if 5
network interface configuration files and variables can also use an
.Dq rtsol
keyword to invoke
.Xr dhcpcd 8
to send a router solicitation message, without running it as daemon.
.\"
.Sh SEE ALSO
.Xr ifconfig.if 5 ,
.Xr dhcpcd 8
