NetBSD/src/usr.sbin/ipf/ipnat/ipnat.8
.TH IPNAT 8
.SH NAME
ipnat \- user interface to the NAT
.SH SYNOPSIS
.B ipnat
[
.B \-lnrsvCF
]
.B \-f <\fIfilename\fP>
.SH DESCRIPTION
.PP
\fBipnat\fP opens the filename given (treating "\-" as stdin) and parses the
file for a set of rules which are to be added or removed from the IP NAT.
.PP
Each rule processed by \fBipnat\fP
is added to the kernels internal lists if there are no parsing problems.
Rules are added to the end of the internal lists, matching the order in
which they appear when given to \fBipnat\fP.
.SH OPTIONS
.TP
.B \-C
delete all entries in the current NAT listing (NAT rules)
.TP
.B \-F
delete all active entries in the current NAT table (currently active
NAT mappings)
.TP
.B \-l
Show the list of current NAT table entry mappings.
.TP
.B \-n
This flag (no-change) prevents \fBipf\fP from actually making any ioctl
calls or doing anything which would alter the currently running kernel.
.TP
.B \-s
Retrieve and display NAT statistics
.TP
.B \-r
Remove matching NAT rules rather than add them to the internal lists
.TP
.B \-v
Turn verbose mode on.  Displays information relating to rule processing.
.DT
.SH SEE ALSO
ipnat(5), ipf(8), ipfstat(8), ipftest(1)
