NetBSD/src/share/man/man8/man8.sparc64/installboot.8
.\"	$NetBSD: installboot.8,v 1.3 1999/12/30 22:31:20 simonb Exp $
.\"
.\" Copyright (c) 1998 Matthew R. Green.
.\" Copyright (c) 1996 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Kranenburg.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 11, 1998
.Dt INSTALLBOOT 8 sparc64
.Os 
.Sh NAME
.Nm installboot
.Nd install a bootstrap disk partition
.Sh SYNOPSIS
.Nm installboot
.Op Fl v
.Op Fl d
.Ar bootblk
.Ar device
.Sh DESCRIPTION
.Nm installboot
copies the bootstrap program
.Ar bootblk
to the named disk partition
.Ar device .
The boot block has a maximum size of 7.5KB, and will be written after the
system disklabel starting at 512 bytes.  If the boot program is longer then
7.5Kb will be truncated.
.Pp
The boot program can be found in
.Pa /usr/mdec/bootblk
.Pp
The options are as follows:
.Bl -tag -width flag
.It Fl n
Do not actually write anything on the disk.
.It Fl v
Verbose mode.
.El
.Pp
The arguments are:
.Bl -tag -width bootblk
.It Ar bootblk
the name of the program, if not found it will be searched for in the
.Pa /usr/mdec
directory.
.It Ar device
the name of the device in which the first-stage boot program
is to be installed.  If it is not found, it will be searched for in the
.Pa /dev
directory, and also with an additional
.Dq c
on the path.
.El
.Sh EXAMPLES
The following command will install the bootblocks in the disk
.Dq sd0 ,
using the file
.Pa /usr/mdec/bootblk
(if it exists) onto the device
.Dq /dev/sd0c :
.Bd -literal -offset indent
installboot -v bootblk sd0
.Ed
.Sh SEE ALSO
.Xr disklabel 8 ,
.Xr init 8
