NetBSD/src/share/man/man8/man8.sparc64/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.sparc64/MAKEDEV and
.\" *** src/share/man/man8/man8.sparc64/MAKEDEV.8.template
.\" *** 
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\"	$NetBSD: MAKEDEV.8,v 1.5 2000/12/05 21:25:38 wrstuden Exp $
.\"
.\" Copyright (c) 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"
.Dd Feburary 21, 1994
.Dt MAKEDEV 8 sparc64
.Os
.Sh NAME
.Nm MAKEDEV ,
.Nm makedev
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create
the common special
files.
.\" See
.\" .Xr special 8
.\" for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments,
where the names are the common abbreviation for
the device.  There are several special device names:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar std
Standard devices
.It Ar local
Configuration specific devices
.El
.Pp
The Sparc64 port supports the following devices.
Where a device name is followed by a hash
sign ("#"), the hash sign must be replaced
by a unit number.
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar st#
SCSI tape, see
.Xr st 4 
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar sd#
SCSI disks, see
.Xr sd 4 
. It Ar wd#
IDE disks, see
.Xr wd 4 
. It Ar cd#
SCSI cdrom drives, see
.Xr cd 4 
. It Ar ch#
SCSI changer, see
.Xr ch 4 
. It Ar fd#
Floppies
. It Ar vnd#
``file'' pseudo-disks, see
.Xr vnd 4 
. It Ar ccd#
Concatenated disk devices, see
.Xr ccd 4 
. It Ar raid#
RAIDframe disk driver, see
.Xr raid 4 
. It Ar md#
Memory pseudo-disk devices, see
.Xr md 4 
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr pty 4 
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar audio#
Audio devices., see
.Xr audio 4 
. It Ar openprom
OPENPROM and EEPROM interface
. It Ar bwtwo#
Monochromatic frame buffer
. It Ar cgtwo#
8-bit color frame buffer
. It Ar cgthree#
8-bit color frame buffer
. It Ar cgfour#
8-bit color frame buffer
. It Ar cgsix#
Accelerated 8-bit color frame buffer
. It Ar cgeight#
24-bit color frame buffer
. It Ar tcx#
Accelerated 8/24-bit color frame buffer
. It Ar bpf#
Packet filter, see
.Xr bpf 4 
. It Ar lkm
Loadable kernel modules interface, see
.Xr lkm 4 
. It Ar tun#
Network tunnel driver, see
.Xr tun 4 
. It Ar ipl
IP filter
. It Ar random
Random number generator
. It Ar scsibus#
SCSI busses, see
.Xr scsictl 8 ,
.Xr scsi 4 
. El
.El
.Pp
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.\" .Xr special 8
