NetBSD/src/usr.sbin/pim6sd/pim6sd.8
.\"	$NetBSD: pim6sd.8,v 1.2 2000/05/19 10:43:50 itojun Exp $
.\" 
.\" Copyright (C) 1999 WIDE Project.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     KAME Id: pim6sd.8,v 1.5 2000/05/05 14:57:14 sumikawa Exp
.\"
.Dd June 10, 1999
.Dt PIM6SD 8
.Os
.Sh NAME
.Nm pim6sd
.Nd PIM for IPv6 sparse mode daemon
.Sh SYNOPSIS
.Nm
.Op Fl c Ar configfile
.Op Fl d Op debug_level Op ,debug_level
.Op Fl f
.Sh DESCRIPTION
.Nm Pim6sd
is an IPv6 multicast routing daemon, which supports
PIMv2(Protocol Independent Multicast Version 2) sparse mode
for IPv6.
.Pp
Options supported by
.Nm Ns :
.Bl -tag -width Ds
.It Fl c Ar configfile
Specify alternate location,
.Ar configfile ,
for configuration file.
By default,
.Pa /etc/pim6sd.conf
is used.
.It Fl d
Specify debug levels. If this option is specified without any arguments,
all debug messages will be printed out.
A subset of the messages to be printed out can be specified
as arguments of the option.
Valid debug levels are
.Ic mld_proto, mld_timer, mld_member, mld, switch, trace, mtrace, traceroute,
.Ic timeout, callout, pkt, packets, interfaces, vif, kernel, cache, mfc,
.Ic k_cache, k_mfc, rsrr, pim_detail, pim_hello, pim_neighbors, pim_register,
.Ic registers, pim_join_prune, pim_j_p, pim_jp, pim_bootstrap, pim_bsr, bsr,
.Ic bootstrap, pim_asserts, pim_cand_rp, pim_c_rp, pim_rp, rp, pim_routes,
.Ic pim_routing, pim_mrt, pim_timers, pim_rpf, rpf, pim, routes, routing,
.Ic mrt, routers, mrouters, neighbors, timers,
and
.Ic asserts.
.It Fl f
Do not become daemon, run in foreground. This option is for debugging
use.
.El
.Pp
.Nm Pim6sd 
automatically configures itself to forward on all multicast-capable
interfaces, i.e., interfaces that have the IFF_MULTICAST flag set (excluding
the "loopback interface").
To override the default configuration,
configuration commands may be placed in
.Pa /etc/pim6sd.conf
.Po
or an alternative file, specified by the
.Sq Fl c
option
.Pc .
.Pp
The
.Nm
program dumps its current routing information to a dump file when
it receives a
.Dv SIGUSR1
signal.
The information includes a list of PIM neighbors,
.Nm
internal multicast routing table, and
BSR and RP related information. Also, the program dumps its internal
statistics to a file when it receives a SIGINFO signal.
.Pp
When
.Nm
receives a SIGUSR2 signal, it rereads the configuration file and
reset its debug level.
.Pp
The
.Nm
program puts its logs to a separate file
.Pa Pq /var/log/pim6sd.log .
The log level can be configured by the
.Fl d
command line option or the configuration file.
.\"
.Sh FILES
.Bl -tag -width /etc/pim6sd.conf -compact
.It Pa /etc/pim6sd.conf
The default configuration file.
.It Pa /var/run/pim6sd.dump
The file to which
.Nm
dumps its internal status.
.It Pa /var/run/pim6sd.stat
The file to which
.Nm
dumps its internal statistics.
.It Pa /var/log/pim6sd.log
The pim6sd specific log file.
.El
.Sh SEE ALSO
.Xr daemon 3 ,
.Xr pim6sd.conf 5
.Sh HISTORY
The
.Nm
command is developed by Mickael Hoerdt at LSIIT Laboratory.
It is based on IPv4 PIM sparse-mode
.Nm pimd
developed at University of Southern California,
which has also been derived from
.Nm mrouted.
.Nm Mrouted
is COPYRIGHT 1989 by The Board of Trustees of
Leland Stanford Junior University.
.\"
.Sh BUGS
.Nm Pim6sd
does not contain any unicast routing engine, so a unicast routing
daemon needs to run on the system. 
.Pp
The kernel unicast routing table is periodically polled by
.Nm
in order to follow changes of existing unicast routes.
.\"
