NetBSD/src/usr.sbin/wsmuxctl/wsmuxctl.8
.\"	$NetBSD: wsmuxctl.8,v 1.3 2001/10/14 19:56:22 wiz Exp $
.\"
.Dd October 13, 2001
.Os
.Dt WMUXCTL 8
.Sh NAME
.Nm wsmuxctl
.Nd configure wsmuxes
.Sh SYNOPSIS
.Nm ""
.Op Fl a Ar dev
.Fl f Ar ctldev
.Op Fl l
.Op Fl r Ar dev
.Sh DESCRIPTION
The
.Nm
allows to adding and removing devices to a
.Xr wsmux 4 .
.Pp
Added and removed devices are specified by a name, not a path name.
Simply use
.Em wsmouseN ,
.Em wskbdN ,
or
.Em wsmuxN
where N is the number of the device.
.Pp
The options are:
.Bl -tag -width xxxxxxxxx
.It Fl a Ar dev
Add the specified device to the mux.
.It Fl f Ar ctldev
Specify the control device of the wsmux to operate on.
.It Fl l
List all devices connected to a mux.
.It Fl r Ar dev
Remove the specified device from the mux.
.El
.Sh SEE ALSO
.Xr wsmux 4
