NetBSD/src/usr.sbin/wsmuxctl/wsmuxctl.8
.\" $NetBSD: wsmuxctl.8,v 1.4 2001/10/14 20:13:31 augustss Exp $
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 13, 2001
.Os
.Dt WMUXCTL 8
.Sh NAME
.Nm wsmuxctl
.Nd configure wsmuxes
.Sh SYNOPSIS
.Nm ""
.Op Fl a Ar dev
.Fl f Ar ctldev
.Op Fl l
.Op Fl r Ar dev
.Sh DESCRIPTION
The
.Nm
allows to adding and removing devices to a
.Xr wsmux 4 .
.Pp
Added and removed devices are specified by a name, not a path name.
Simply use
.Em wsmouseN ,
.Em wskbdN ,
or
.Em wsmuxN
where N is the number of the device.
.Pp
The options are:
.Bl -tag -width xxxxxxxxx
.It Fl a Ar dev
Add the specified device to the mux.
.It Fl f Ar ctldev
Specify the control device of the wsmux to operate on.
.It Fl l
List all devices connected to a mux.
.It Fl r Ar dev
Remove the specified device from the mux.
.El
.Sh SEE ALSO
.Xr wsmux 4
