NetBSD/src/share/man/man8/man8.hp700/mkboot.8
.\"	$NetBSD: mkboot.8,v 1.1 2012/01/09 16:04:46 skrll Exp $
.\"
.\"	$OpenBSD: mkboot.8,v 1.9 2007/05/31 19:20:03 jmc Exp $
.\"
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 9, 2012
.Dt MKBOOT 8 hp700
.Os
.Sh NAME
.Nm mkboot
.Nd create LIF files
.Sh SYNOPSIS
.Nm mkboot
.Op Fl v
.Op Fl l Ar loadpoint
.Ar program ... outfile
.Sh DESCRIPTION
Creates the LIF file containing the bootstrap
.Ar program
and possibly other programs to be used by the
.Tn HP 9000/700
and
.Tn HP 9000/800
systems.
.Pp
An argument to the
.Fl l
option specifies the load point for the boot program,
with the default value of zero.
.Sh HISTORY
An
.Nm
utility first appeared in
.Ox 2.4 .
It was adapted for
.Nx
and first appeared in
.Nx XXX .
