NetBSD/src/sbin/lmcctl/lmcctl.8
.\"     $NetBSD: lmcctl.8,v 1.4 1999/11/19 01:12:41 enami Exp $
.\"
.\" Copyright (c) 1997-1999 LAN Media Corporation (LMC)
.\" All rights reserved.  www.lanmedia.com
.\"
.\" This code is written by Michael Graff <graff@vix.com> for LMC.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above
.\"    copyright notice, this list of conditions and the following disclaimer
.\"    in the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. All marketing or advertising materials mentioning features or
.\"    use of this software must display the following acknowledgement:
.\"      This product includes software developed by LAN Media Corporation
.\"      and its contributors.
.\" 4. Neither the name of LAN Media Corporation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY LAN MEDIA CORPORATION AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.Dd April 16, 1999
.Dt LMCCTL 8
.Os NetBSD
.Sh NAME
.Nm lmcctl
.Nd "configuration utility for Lan Media SSI, HSSI, and DS3 cards"
.Sh SYNOPSIS
.Nm ""
.Op Fl i Ar interface
.Op Fl l Ar speed
.Op Fl cCeEkKsSoO
.Sh DESCRIPTION
.Nm ""
is the user-land control program for the Lan Media SSI,
HSSI, and DS3 network interfaces.  The SSI is the LMC1000, and runs at
various speeds up to 10Mbps.  The DS3 is the LMC5245 and runs at a speed of
45Mbps.  The HSSI is the LMC5200, and has no internal clock generator.
.Nm ""
is used to configure various media and protocol options dealing with HDLC
serial links and hardware configurations.
.Pp
When no change is specified on the command line, the interface status is
displayed.
.Pp
The command-line options for 
.Nm ""
are as follows:
.Bl -tag -width indent
.It Fl i Ar interface
Use the specified
.Ar interface
name rather than the default of lmc0.
.It Fl l Ar speed
(SSI card only)
Set the interface to use a clock speed of
.Ar speed .
This is only used if the clock sourse is set to internal clocking.
.It Fl c
(SSI, HSSI)
Set the interface to use external clocking.
This is the default.
.It Fl C
(SSI, HSSI)
Set the interface to use internal clocking.  On the SSI card this uses the
internal baud rate generator.  On the HSSI card it uses the PCI bus clock.
.It Fl e
Select 16-bit CRC.
This is the default.
.It Fl E
Select 32-bit CRC
.It Fl k
Enable Cisco HDLC keepalive protocol.
This is the default.
.It Fl K
Disable Cisco HDLC keepalive protocol.
.It Fl s
(DS3)
Disable the DS3 scrambler function.
This is the default.
.It Fl S
(DS3)
Enable the DS3 scrambler function.
.It Fl o
(DS3)
Program the card for cable lengths of less than 100 feet.  In this mode,
the card uses lower power to transmit data for short cable runs, which might
otherwise overdrive a receiver.  This is the default, and will work in most
situations even with runs more than 100 feet.
.It Fl O
(DS3)
Program the card for cable lengths greater than 100 feet.
.El
.Pp
.Sh EXAMPLES

To set a SSI card for a speed of 2048000 bits/sec with HDLC keepalive off,
one could use:

.Bd -unfilled -offset indent
lmcctl -i lmc0 -l 2048000 -K
.Ed
.Pp
.Sh SEE ALSO
.Xr ifconfig 8 .
.Sh HISTORY
The
.Nm ""
program first appeared in
.Nx 1.4 .
.Sh COPYRIGHT
.Bd -unfilled
Copyright (c) 1997-1999 LAN Media Corporation (LMC)
All rights reserved.  www.lanmedia.com
.Ed
