NetBSD/src/usr.sbin/puffs/mount_psshfs/mount_psshfs.8
.\"	$NetBSD: mount_psshfs.8,v 1.1 2007/01/07 19:56:26 pooka Exp $
.\"
.\" Copyright (c) 2007 Antti Kantee.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 7, 2007
.Dt MOUNT_PSSHFS 8
.Os
.Sh NAME
.Nm mount_psshfs
.Nd mount a puffs file system using ssh sftp
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Ar user@host[:path]
.Ar mount_point
.Sh DESCRIPTION
The
.Nm
utility can be used to mount a file system using the ssh sftp
subprotocol, making a remote directory hierarchy appear in the
local directory tree.
.Pp
The mandatory parameters are the target host name and local mount
point.
The target host parameter can optionally contain a username who's
credentials will be used by the remote sshd, and a relative or
absolute path for the remote mountpoint's root.
If no user is given, the credentials of the user issuing the mount
command are used.
If no path is given, the user's home directory on the remote machine
will be used.
.Pp
The
.Fl o
flag can be used to give standard mount options and options to puffs.
The most notable of these is
.Fl o Ar nocache ,
which disables the name cache and page cache for the file system.  It
slows operations down, but will behave better when multiple entities
are accessing the same directory tree via various routes.
.Sh SEE ALSO
.Xr mount 8 ,
.Xr puffs 3 ,
.Xr puffs 4 ,
.Xr sftp 1 ,
.Xr sshd 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 5.0.
.Sh CAVEATS
Permissions are not handled.  Do not expect the file system to
behave except for a single user.
.Pp
The implementation does not currently behave if the file system is
being accessed from other locations besides through the mounting
host.
Mount the file system without caching if the usage pattern is going
to be such.
