NetBSD/src/sbin/mount_full/mount_full.8
.\"	$NetBSD$
.\"
.\" Copyright (c) 1992, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 6, 2026
.Dt MOUNT_FULL 8
.Os
.Sh NAME
.Nm mount_full
.Nd mount a disk-full simulation filesystem layer
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Ar target
.Ar mount-point
.Sh DESCRIPTION
The
.Nm
command mounts a
.Em fullfs
layer over
.Ar target ,
making it accessible at
.Ar mount-point .
.Pp
.Em fullfs
is a stackable filesystem layer built on the same layerfs infrastructure as
.Xr mount_null 8 .
It presents the contents of
.Ar target
unchanged, but intercepts any vnode operation that would allocate disk space
and returns
.Er ENOSPC
immediately, without touching the underlying filesystem.
.Pp
This makes it possible to test an application's handling of disk-full
conditions without filling an actual disk.
.Pp
Both
.Ar target
and
.Ar mount-point
are converted to absolute paths before use.
.Sh BEHAVIOR
The following operations always fail with
.Er ENOSPC
through a fullfs mount:
.Bl -bullet -compact
.It
.Xr write 2
.It
.Xr open 2
with
.Dv O_CREAT
(new file creation)
.It
.Xr mkdir 2
.It
.Xr mknod 2
.It
.Xr symlink 2
.It
.Xr link 2
.El
.Pp
The following operations pass through to the underlying filesystem unchanged:
.Bl -bullet -compact
.It
.Xr read 2 ,
.Xr readdir 2 ,
.Xr stat 2 ,
and other read-only operations
.It
.Xr unlink 2
and
.Xr rmdir 2
(these free space rather than allocating it)
.It
.Xr rename 2
.El
.Pp
.Xr statvfs 2
reports zero free and available blocks and inodes, regardless of the
actual state of the underlying filesystem.
.Sh OPTIONS
.Bl -tag -width Fl
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma-separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.El
.Sh EXAMPLES
Mount
.Pa /var/db
under
.Pa /mnt/full
to test how a program behaves when the database volume is full:
.Pp
.Dl mount_full /var/db /mnt/full
.Pp
Verify that the layer is working correctly:
.Bd -literal -offset indent
# Existing data is still readable:
ls /mnt/full

# Writes fail immediately:
echo hello >> /mnt/full/somefile
echo $?    # non-zero; "No space left on device"

# Free space is reported as zero:
df /mnt/full
.Ed
.Sh SEE ALSO
.Xr mount 8 ,
.Xr mount_null 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 11 .
