NetBSD/src/usr.sbin/yp/yp.8
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)yp.8	1.0 (deraadt) 4/26/93
.\"
.Dd April 5, 1993
.Dt YP 8
.Os BSD 4.2
.Sh NAME
.Nm yp
.Nd description of the YP system
.Sh SYNOPSIS
.Nm yp
.Sh DESCRIPTION
The
.Nm YP
subsystem allows network management of passwd and group file
entries through the functions getpwent(3) and getgrent(3).
The
.Nm YP 
subsystem is started automatically in
.Nm /etc/netstart
if the directory
.Nm /var/yp
exists.
.Sh BUGS
Only
.Nm YP
client functionality exists -- the server code has not yet been
written. Brave folk can contact the author.

.Nm /etc/passwd
supports "+" and "+user" entries.
.Nm /etc/group only supports "+" entries.

Many more manual pages should be written, especially ypclnt(3).
For the time being, seek out a local Sun machine and read the
manuals for there.

Neither Sun nor this author have found a clean way to handle
the problems that occur when ypbind cannot find its server
upon bootup.
.Sh HISTORY
The
.Nm YP
subsystem was written from the ground up by Theo de Raadt
to be compatible to Sun's implimentation. No Sun code was
referenced.
