NetBSD/src/share/man/man4/man4.arm26/podulebus.4
.\" $NetBSD: podulebus.4,v 1.2 2000/05/14 10:04:21 bjh21 Exp $
.\"
.\" Copyright (c) 2000 Ben Harris
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 14, 2000
.Os
.Dt PODULEBUS 4 arm26
.Sh NAME
.Nm podulebus
.Nd Acorn Expansion Card bus driver
.Sh SYNOPSIS
.Cd podulebus0 at ioc0 bank 4
.Sh DESCRIPTION
The
.Nm
driver handles the expansion-card interface in Archimedes machines and their
successors.  This includes conventional expansion cards, mini expansion cards
(as introduced in the A3000) and network expansion cards (as introduced in
the A3020).  Drivers for individual cards attach as children of the
.Nm
device.
.Sh SUPPORTED DEVICES
Expansion cards are identified by a manufacturer and product identifier.
These are listed against each card in the table in the form
.Sm off
.No < Ar manu : prod No > .
.Sm on
.Bl -tag -width Nm
.It Nm ei
Acorn
.Tn AKA25
Ethernet card (Ether1)
.Sm off
.No < Li 0000 : 0003 No >
.Sm on
.It Nm dtide
D.T. Software IDE interface
.Sm off
.No < Li 0037 : 0055 No >
.Sm on
.El
.Sh SEE ALSO
.Xr dtide 4 ,
.Xr ei 4 .
.Sh BUGS
The
.Nx Ns /arm26
.Nm
driver is not compatible with the
.Nx Ns /arm32
one.
