NetBSD/src/usr.sbin/gspa/gspa/gspa.8
.\" $NetBSD: gspa.8,v 1.4 2008/04/30 13:11:02 martin Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 27, 2002
.Dt GSPA 8
.Os
.Sh NAME
.Nm gspa
.Nd assembler for the GSP chip
.Sh SYNOPSIS
.Nm
.Op Fl c Ar c_array_name
.Op Fl l Ar list_file
.Op Fl o Ar hex_file
.Op infile
.Sh DESCRIPTION
.Nm
is an assembler for the TMS34010 and TMS34020 graphics processor
chips.
.Pp
The supported options are:
.Bl -tag -width xxxlistname -compact
.It Fl c Ar c_array_name
Create a pre-initialized C-structure
.Ar c_array_name
with the hex code of the assembler output.
.It Fl l Ar list_file
Create commented (with the input file) hex code of the assembler
output in
.Ar list_file .
.It Fl o Ar hex_file
Create the output in
.Ar hex_file .
If
.Fl c
is used, C code will be written to
.Ar hex_file ,
otherwise uncommented hex code of the assembler output will be
written.
.El
.Pp
If no
.Fl o
option is given, output will be written to stdout.
.Pp
If no
.Ar infile
is given, input will be read from stdin.
.Sh HISTORY
.Nm
appeared in
.Nx 1.1 .
.Sh AUTHORS
.Nm
was written by
.An Paul Mackerras .
The
.Fl c
mode was added by
.An Ignatios Souvatzis
.Aq is@NetBSD.org .
This man page was written by
.An Thomas Klausner
.Aq wiz@NetBSD.org .
