NetBSD/src/share/man/man4/man4.hp300/dvbox.4
.\"	$NetBSD: dvbox.4,v 1.6 2011/02/09 14:13:09 tsutsui Exp $
.\"
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)dv.4	8.1 (Berkeley) 6/9/93
.\"
.Dd February 9, 2011
.Dt DVBOX 4 hp300
.Os
.Sh NAME
.Nm dvbox
.Nd
.Tn HP98730
``DaVinci'' graphics device interface
.Sh SYNOPSIS
.Cd "dvbox* at intio?"
.Cd "dvbox* at dio? scode ?"
.Cd "wsdisplay* at dvbox?"
.Sh DESCRIPTION
This driver is for the
.Tn HP98730
and 98731 graphics device, also known as
the DaVinci.  This driver has not been tested with all possible
combinations of frame buffer boards and scan boards installed in the device.
The driver merely checks for the existence of the device and does minimal set
up.
.Pp
The DaVinci can be configured at either the ``internal'' address
(frame buffer address 0x200000, control register space address 0x560000)
or at an external select code less than 32.
At the internal address it will be the ``preferred'' console device.
The hardware installation manual describes the procedure for
setting these values.
.Pp
.Sh SEE ALSO
.Xr wsdisplay 4 ,
.Xr wscons 4
