NetBSD/src/share/man/man4/man4.hp300/le.4
.\"	$NetBSD: le.4,v 1.5 1999/12/15 23:44:52 abs Exp $
.\"
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)le.4	8.2 (Berkeley) 11/30/93
.\"
.Dd November 30, 1993
.Dt LE 4 hp300
.Os
.Sh NAME
.Nm le
.Nd
.Tn HP AMD
7990
.Tn LANCE
Ethernet interface
.Sh SYNOPSIS
.Cd "le0 at scode?"
.Sh DESCRIPTION
The
.Nm le
interface provides access to a 10 Mb/s Ethernet network via the
.Tn AMD
7990
.Tn LANCE
Ethernet chip set.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl .
The
.Xr le
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network.
.Pp
The use of ``trailer'' encapsulation to minimize copying data on
input and output is supported by the interface but offers no advantage
due to the large
.Tn HP
page size.
The use of trailers is negotiated with
.Tn ARP .
This negotiation may be disabled, on a per-interface basis,
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Sh DIAGNOSTICS
.Bl -diag
.It le%d: hardware address %s.
This is a normal autoconfiguration message noting the 6 byte physical
Ethernet address of the adapter.
.Pp
.It de%d: can't handle af%d.
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.Pp
The following message indicates a possible hardware error performing
the indicated operation during autoconfiguration or initialization.
.Pp
.It le%d: init timeout, stat = 0x%x.
The hardware did not respond to an initialize command during reset.
The reset procedure continues anyway.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4 ,
.Xr arp 4
