NetBSD/src/share/man/man4/man4.hp300/topcat.4
.\"	$NetBSD: topcat.4,v 1.7 2011/02/09 14:37:56 wiz Exp $
.\"
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)tc.4	8.1 (Berkeley) 6/9/93
.\"
.Dd February 9, 2011
.Dt TOPCAT 4 hp300
.Os
.Sh NAME
.Nm topcat
.Nd
.Tn HP98544
98550
.Dq Topcat
and
.Dq Catseye
device interface
.Sh SYNOPSIS
.Cd "topcat* at intio?"
.Cd "topcat* at dio? scode ?"
.Cd "wsdisplay* at topcat?"
.Sh DESCRIPTION
This driver is for the
.Tn HP98544 ,
98545 and 98547
.Dq Topcat
and
.Tn HP98548 ,
98549, and 98550
.Dq Catseye
display cards.
This driver merely checks for the existence of the device
and does minimal setup, as it is expected the applications will initialize
the device to their requirements.
The Topcat and Catseye are nearly identical in common usage and only the
Topcat will be referred to from now on.
.Pp
The Topcat display cards are not user configurable.
If one is present on a system, it will always have a frame buffer
address of 0x200000 and a control register address of 0x560000.
These are the
.Tn HP
series 300
.Tn ITE
(Internal
Terminal Emulator) defaults.
The device can also be used as a graphics output
device.
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsdisplay 4
