NetBSD/src/share/man/man4/man4.emips/autoconf.4
.\"	$NetBSD: autoconf.4,v 1.4 2017/02/17 22:24:46 christos Exp $
.\"
.\" Copyright (c) 2010 NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This file is derived from work contributed by Microsoft Corporation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt AUTOCONF 4 emips
.Os
.Sh NAME
.Nm autoconf
.Nd diagnostics from the autoconfiguration code
.Sh DESCRIPTION
When
.Nx
bootstraps it probes the innards of the machine on which it is running
and locates controllers, drives, and other devices, printing out what
it finds on the console.
This procedure is driven by a system
configuration table which is processed by
.Xr config 1
and compiled into each kernel.
Devices which exist in the machine but are not configured into the
kernel are not detected.
.Sh DIAGNOSTICS
.Bl -diag
.It CPU type (0x%x) not supported.
You tried to boot
.Nx
on a type of
.Tn CPU
type which it doesn't
(or at least this compiled version of
.Nx
doesn't) understand.
.El
.Sh SEE ALSO
.Xr config 1 ,
.Xr emips/intro 4 ,
.Xr boot 8
