NetBSD/src/share/man/man4/man4.emips/ebus.4
.\"	$NetBSD: ebus.4,v 1.4 2017/02/17 22:24:46 christos Exp $
.\"
.\" Copyright (c) 2010 NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This file is derived from work contributed by Microsoft Corporation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt EBUS 4 emips
.Os
.Sh NAME
.Nm ebus
.Nd eMIPS Extensible I/O BUS driver
.Sh SYNOPSIS
.Cd "ebus0 at mainbus0"
.Sh DESCRIPTION
.Nm
is a virtual device for the Extensible I/O BUS realized with eMIPS
on FPGA boards such as the BEE3, Xilinx XUP, and Xilinx ML40x systems.
.Pp
Devices on the BUS can generally be relocated and can be found by
scanning the Peripheral Mapping Table at the top of the BUS physical space.
The driver is responsible for identifying devices that are currently available,
and to map them into the kernel virtual space during the kernel startup procedure.
.Pp
The
.Nm
driver manages the Extensible I/O BUS on eMIPS and provides
.Pp
.Bl -bullet -offset indent
.It
Address range management to avoid conflicts.
.It
Interrupt vector management.
.It
Other utility functions.
.El
.Pp
.Nm
is always required to run the
.Nx
kernel.
.Sh SEE ALSO
.Xr emips/ace 4 ,
.Xr emips/dz 4 ,
.Xr emips/eclock 4 ,
.Xr emips/enic 4 ,
.Xr emips/intro 4
