NetBSD/src/share/man/man4/man4.emips/enic.4
.\"	$NetBSD: enic.4,v 1.3 2011/02/14 21:13:17 pooka Exp $
.\"
.\" Copyright (c) 2001, 2010 The NetBSD Foundation, Inc.
.\"
.\" This file is derived from work contributed by Microsoft Corporation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 27, 2010
.Dt ENIC 4
.Os
.Sh NAME
.Nm enic
.Nd eMIPS ExtensibleNIC Ethernet interface driver
.Cd "enic* at ebus0 addr ?"
.Sh DESCRIPTION
The
.Nm
interface provides access to a
.Tn Ethernet
network via the eMIPS builtin 
.Tn eNIC
(Extensible Network Interface Controller - Ethernet) interface.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm
interface employs the Address Resolution Protocol (ARP) described in
.Xr arp 4
to dynamically map between Internet and
.Tn Ethernet
addresses on the local network.
.Pp
Multicast Ethernet frames are unconditionally received and must be filtered in software.
.Sh HARDWARE
.Ss emips
The
.Tn ENIC
interface is present on the BEE3 and Xilinx XUP boards. The interface speed is wired at 1Gbps.
.Sh DIAGNOSTICS
.Bl -diag
.It "enic%d: enic_put: no mem?"
The driver could not allocate a transmit buffer, packet was not sent.
.It "enic%d: internal error"
This and other messages are indicative of bad hardware or software driver coding errors.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr ifconfig 8
.Sh HISTORY
.Nm
driver first appeared in
.Nx 6.0 .
