NetBSD/src/share/man/man4/man4.emips/intro.4
.\"	$NetBSD: intro.4,v 1.3.4.1 2017/04/21 16:53:16 bouyer Exp $
.\"
.\" Copyright (c) 2010 NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This file is derived from work contributed by Microsoft Corporation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt INTRO 4 emips
.Os
.Sh NAME
.Nm intro
.Nd introduction to emips special files and hardware support
.Sh DESCRIPTION
This section describes the special files, related driver functions,
and networking support available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 1
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation; see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices which may be configured into
the system and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported on eMIPS
(Microsoft Extensible MIPS processor)-based platforms.
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the autoconfiguration facilities
in the system probe for the device and, if found, enable the software
support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system must be rebooted.
.Pp
The autoconfiguration system is described in
.Xr emips/autoconf 4 .
A list of the supported devices is given below.
.Sh SEE ALSO
.Xr config 1 ,
.Xr emips/autoconf 4
.Sh SUPPORTED SYSTEMS
The following systems are supported:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It BeSquare BErkeley Emulation System-3 FPGA development board
known as the "BEE3".
This is a quad-chip FPGA system where eMIPS can run on each FPGA separately,
on multiple FPGAs in concert, and in multi-processor configurations.
.It Xilinx University Program board
known as "XUP".
This is the Xilinx reference board for the Virtex-5 series chips.
It can use the same XL110T FPGA chip present on the BEE3.
.It Xilinx ML402
Xilinx reference board for the Virtex-4 series chip, including the SX35.
.It Xilinx ML401
Same as the above, but with the smaller LX25 chip.
.El
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of the system.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width speaker -offset indent -compact
.It ace
Xilinx SystemACE interface for Compact-FLASH cards, bears similarities to the IDE interface.
Present on XUP and ML40x boards.
Not present on BEE3.
.It dz
serial driver for the eMIPS console serial device.
Present on all systems.
.It enic
Ethernet driver for the eNIC device.
Present on XUP and BEE3 systems.
Not present on ML40x systems.
.It eclock
System clock, must be configured on all systems.
.It ebus
Extensible BUS, present on all systems.
.El
.Sh HISTORY
This
.Tn eMIPS
.Nm intro
appeared in
.Nx 6.0 .
