NetBSD/src/usr.sbin/crash/crash.8
.\"	$NetBSD: crash.8,v 1.8 2019/03/23 02:07:32 mrg Exp $
.\"
.\" Copyright (c) 2009 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Andrew Doran.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 22, 2019
.Dt CRASH 8
.Os
.Sh NAME
.Nm crash
.Nd examine and debug system images
.Sh SYNOPSIS
.Nm
.Op Fl w
.Op Fl M Ar core
.Op Fl N Ar kernel
.Sh DESCRIPTION
The
.Nm
command is used to examine and debug system images.
.Pp
If run without any arguments,
.Nm
operates on the running system.
.Pp
The options are as follows:
.Bl -tag -width xpalidocious
.It Fl M Ar core
Operate on the specified crash dump instead of the default
.Pa /dev/mem .
Crash dumps should be from the same version of the system and same machine
architecture as the running version of
.Nm crash ,
and must be uncompressed.
.It Fl N Ar kernel
Extract the name list from the specified kernel instead of the default
.Pa /dev/ksyms .
.It Fl w
Enable writing.
.El
.Pp
The command syntax used by
.Nm
is the same as the in-kernel debugger.
See the
.Xr ddb 4
manual page for more information.
.Pp
Operations and facilities that require a running system, such as breakpoints,
are not supported by
.Nm crash .
.Pp
.Nm
does not provide pagination.
However, by using the pipe symbol, output may be sent to commands available
from the shell.
For example:
.Bd -literal -offset abcd
crash> ps | more
crash> ps | grep ioflush
.Ed
.Sh EXAMPLES
You can obtain a full list of all kernel stack traces with a shell pipeline
like the following:
.Bd -literal -offset abcd
# echo ps | crash | grep '^[0-9]' | cut -c 30-46 | \\
  sed 's,^,bt/a ,' | crash
.Ed
.Sh SEE ALSO
.Xr ps 1 ,
.Xr vmstat 1 ,
.Xr ddb 4 ,
.Xr pstat 8
.Sh HISTORY
The
.Nm
command appeared in
.Nx 6.0 .
.Sh BUGS
The
.Nm
command for the sparc port is unstable.
