NetBSD/src/usr.sbin/installboot/installboot.8
.\"	$NetBSD: installboot.8,v 1.6 2002/04/04 11:06:47 wiz Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Luke Mewburn of Wasabi Systems.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the NetBSD
.\"	Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 4, 2002
.Dt INSTALLBOOT 8
.Os
.Sh NAME
.Nm installboot
.Nd install disk bootstrap software
.
.Sh SYNOPSIS
.Nm ""
.Op Fl nv
.Bk -words
.Op Fl m Ar machine
.Ek
.Bk -words
.Op Fl o Ar options
.Ek
.Bk -words
.Op Fl t Ar fstype
.Ek
.Bk -words
.Op Fl b Ar bno
.Ek
.Ar filesystem
.Ar bootstrap
.Nm ""
.Fl c
.Op Fl nv
.Bk -words
.Op Fl m Ar machine
.Ek
.Bk -words
.Op Fl o Ar options
.Ek
.Bk -words
.Op Fl t Ar fstype
.Ek
.Ar filesystem
.
.Sh DESCRIPTION
The
.Nm
utility installs and removes
.Nx
disk bootstrap software.
.Nm
can install
.Ar bootstrap
into
.Ar filesystem ,
or disable an existing bootstrap in
.Ar filesystem .
.Pp
Generally,
.Nx
disk bootstrap software consists of two parts: a
.Dq primary
bootstrap program usually written into the disklabel area of the
disk by
.Nm "" ,
and a
.Dq secondary
bootstrap program that usually resides in a file system on the disk.
.Pp
When booting, the primary bootstrap program is loaded and invoked by
the machine's PROM or BIOS.
After receiving control of the system it loads and runs the secondary
bootstrap program, which in turn loads and runs the kernel.
The secondary bootstrap may allow control over various boot parameters
passed to the kernel.
.Pp
To make a disk bootable, copy the secondary bootstrap
(usually
.Pa /usr/mdec/boot. Ns Sy MACHINE )
to the root directory of the first file system on the disk.
.Nx Ns Tn /pmax
requires this file system to start at block 0 of the disk.
Then use
.Nm
to install the primary bootstrap program
(usually
.Pa /usr/mdec/bootxx. Ns Sy <fs> )
into the disk's raw partition
.Po
usually
.Dq c
.ig
but
.Dq d
on platforms such as
.Sy i386 .
..
.Pc .
.Pp
The options recognized by
.Nm
are as follows:
.
.Bl -tag -width "foobar"
.
.It Fl b Ar bno
Install
.Ar bootstrap
at block number
.Ar bno
instead of the default location for the machine and file system type.
.
.It Fl c
Clear (remove) any existing bootstrap instead of installing one.
.
.It Fl m Ar machine
Use
.Ar machine
as the target machine type.
The default machine is determined from
.Xr uname 3
and then
.Ev MACHINE .
.Pp
The following machines are currently supported by
.Nm "" :
.Bd -ragged -offset indent
.Sy alpha ,
.Sy pmax ,
.Sy vax
.Ed
.
.
.It Fl n
Do not write to
.Ar filesystem .
.
.It Fl o Ar options
Machine specific
.Nm
options, comma separated.
.Pp
Supported options are (with the machines for they are valid in brackets):
.
.Bl -tag -offset indent -width alphasum
.
.It Sy alphasum
.Em [ alpha ]
Recalculate and restore the Alpha checksum.
This is the default for
.Nx Ns Tn /alpha .
.
.It Sy append
.Em [ pmax ,
.Em vax ]
Append
.Ar bootstrap
to the end of
.Ar filesystem ,
which must be a regular file in this case.
.
.It Sy sunsum
.Em [ pmax ,
.Em vax ]
Recalculate and restore the Sun and
.Nx Ns Tn /sparc
compatible checksum.
.Em Note :
The existing
.Nx Ns Tn /sparc
disklabel should use no more than 4 partitions.
.El
.
.It Fl t Ar fstype
Use
.Ar fstype
as the type of
.Ar filesystem .
The default operation is to attempt to auto-detect this setting.
.
.It Fl v
Verbose operation.
.El
.Pp
.Nm
exits 0 on success, and \*[Gt]0 if an error occurs.
.
.Sh ENVIRONMENT
.Nm
uses the following environment variables:
.
.Bl -tag -width "MACHINE"
.
.It Ev MACHINE
Default value for
.Ar machine ,
overriding the result from
.Xr uname 3 .
.
.El
.
.Sh FILES
Most NetBSD ports will contain variations of the following files:
.Pp
.Bl -tag -width /usr/mdec/boot.$MACHINE
.
.It Pa /usr/mdec/bootxx_ Ns Sy <fs>
Primary bootstrap for file system
.Sy <fs> .
Installed into the bootstrap area of the file system by
.Nm "" .
.
.It Pa /usr/mdec/boot. Ns Sy MACHINE
Secondary bootstrap for machine type
.Sy MACHINE .
This should be installed into the file system before
.Nm
is run.
.
.It Pa /boot. Ns Sy MACHINE
Installed copy of secondary bootstrap for machine type
.Sy MACHINE .
.
.It Pa /boot
Installed copy of secondary bootstrap.
Searched for by the primary bootstrap if
.Pa /boot. Ns Sy MACHINE
is not found.
.
.El
.
.
.Sh EXAMPLES
.\".if t .ne 4
Install the Berkeley Fast File System primary bootstrap on to disk sd0:
.D1 Ic installboot /dev/rsd0c /usr/mdec/bootxx_ffs
.Pp
Remove the primary bootstrap from disk wd1:
.Dl Ic installboot -c /dev/rwd1c
.Ss NetBSD/pmax examples
Install the ISO 9660 primary bootstrap in the file
.Pa /tmp/cd-image :
.Dl Ic installboot -m pmax /tmp/cd-image /usr/mdec/bootxx_cd9660
.Pp
Make an ISO 9660 filesystem in the file
.Pa /tmp/cd-image
and install the ISO 9660 primary bootstrap in the filesystem, where the
source directory for the ISO 9660 filesystem contains a kernel, the
primary bootstrap
.Pa bootxx_cd9660
and the secondary bootstrap
.Pa boot.pmax :
.Dl Ic mkisofs -o /tmp/cd-image -a -l -v iso-source-dir
.Dl ...
.Dl 48 51 iso-source-dir/bootxx_cd9660
.Dl ...
.Dl Ic installboot -b `expr 48 \e* 4` /tmp/cd-image /usr/mdec/bootxx_cd9660
.
.Sh SEE ALSO
.Xr uname 3 ,
.Xr boot 8 ,
.Xr disklabel 8 ,
.Xr init 8
.
.Sh HISTORY
This implementation of
.Nm
appeared in
.Nx 1.6 .
.
.Sh AUTHORS
The machine independent portion of this implementation of
.Nm
was written by Luke Mewburn.
The following people contributed to the various machine dependent
back-ends:
Simon Burge (pmax),
Chris Demetriou (alpha),
Ross Harvey (alpha),
Matt Thomas (vax).
.
.Sh BUGS
There are not currently primary bootstraps to support all file systems
types which are capable of being the root file system.
.Ss NetBSD/pmax bugs
The
.Nx Ns Tn /pmax
secondary bootstrap program can only load kernels from file
systems starting at the beginning of disks.
.Pp
The size of primary bootstrap programs is restricted to 7.5KB, even
though some file systems (e.g. ISO 9660) are able to accommodate larger
ones.
