> 1.2.3.4
Code: 1.2.3.4
> 1.2.300.4
Error: need decimal number 0..255 or "[" at "1.2.>300<.4"
> 1.2.3000.4
Error: need decimal number 0..255 or "[" at "1.2.>3000<.4"
> 1.2.3.
Error: need decimal number 0..255 or "[" at "1.2.3.><"
> 1.2.3
Error: need "." at "1.2.3><"
> a
Error: need decimal number 0..255 or "[" at ">a<"
> 1.2.3;4
Error: need "." at "1.2.3>;<4"
> 1.2.[3].4
Code: 1.2.[3].4
> 1.2.[].4
Error: need decimal number 0..255 at "1.2.[>]<.4"
> 1.2.[.4
Error: need decimal number 0..255 at "1.2.[>.<4"
> 1.2.].4
Error: need decimal number 0..255 or "[" at "1.2.>]<.4"
> 1.2.[1..127;128..255].5
Code: 1.2.[1..127;128..255].5
> 1.2.[1-255].5
Error: need ";" or "]" at "1.2.[1>-<255].5"
> 1.2.[1..127.128..255].5
Error: need ";" or "]" at "1.2.[1..127>.<128..255].5"
> 1.2.3.[4]
Code: 1.2.3.[4]
> 1.2.3.[4..1]
Error: numeric range error at "1.2.3.[4..>1<]"
> 1.2.3.[4.1]
Error: numeric range error at "1.2.3.[4.>1<]"
> 1.2.3.[4.x]
Error: numeric range error at "1.2.3.[4.>x<]"
> 1.2.3.[x]
Error: need decimal number 0..255 at "1.2.3.[>x<]"
> 1.2.3.4x
Error: garbage after pattern at "1.2.3.4>x<"
> 1.2.[3..11].5	1.2.3.5	1.2.2.5	1.2.11.5 1.2.12.5  1.2.11.6
Code: 1.2.[3..11].5
Match 1.2.3.5: yes
Match 1.2.2.5: no
Match 1.2.11.5: yes
Match 1.2.12.5: no
Match 1.2.11.6: no
> 1.2.[3;5;7;9;11].5	1.2.3.5	1.2.2.5	1.2.4.5 1.2.11.5 1.2.12.5  1.2.11.6
Code: 1.2.[3;5;7;9;11].5
Match 1.2.3.5: yes
Match 1.2.2.5: no
Match 1.2.4.5: no
Match 1.2.11.5: yes
Match 1.2.12.5: no
Match 1.2.11.6: no
> [1;2].3.4.5 1.3.4.5 2.3.4.5 3.3.4.5
Code: [1;2].3.4.5
Match 1.3.4.5: yes
Match 2.3.4.5: yes
Match 3.3.4.5: no
> [[1;2].3.4.5] 1.3.4.5 2.3.4.5 3.3.4.5
Code: [1;2].3.4.5
Match 1.3.4.5: yes
Match 2.3.4.5: yes
Match 3.3.4.5: no
> [[1;2].3.4.5
Error: missing "]" character
> 1;2].3.4.5
Error: need "." at "1>;<2].3.4.5"
