NetBSD/src/share/man/man8/man8.arm26/BBBB.8
.Dd November 21, 2000
.Dt BBBB 8 arm26
.Os
.Sh NAME
.Nm BBBB
.Nd Bootloader for
.Nx Ns /arm26
.Sh SYNOPSIS
.Nm
.Op Fl adsqv
.Op Ar file
.Sh DESCRIPTION
.Nm
is a program that runs under
.Tn RISC OS
and launches the
.Nx Ns /arm26
kernel.  It needs to be installed in a
.Tn RISC OS
filesystem and given file type FFB (BASIC).  The kernel it is to load
also needs to be stored in a
.Tn RISC OS
filesystem.
.Pp
It takes the following options, which set flags in the
.Va boothowto
variable in the booted kernel:
.Bl -tag -width Fl
.It Fl a
.Pq Dv RB_ASKNAME
Cause the kernel to prompt the user for the name of the device containing the
root filesystem.  This also causes
.Nm
to prompt for the name of the kernel to be loaded.
.It Fl s
.Pq Dv RB_SINGLE
Cause the kernel to ask
.Nm init
to boot into single-user mode.
.It Fl d
.Pq Dv RB_KDB
Cause the kernel to ented the kernel debugger as soon as possible.
.It Fl q
.Pq Dv RB_QUIET
Cause the kernel to emit fewer messages than normal while starting up.
.It Fl v
.Pq Dv RB_VERBOSE
Cause the kernel to emit more messages than normal while starting up.
.El
.Pp
.Nm
attempts to load the kernel from the
.Tn RISC OS
file specified as
.Ar file ,
or from
.Pa netbsd
if
.Ar file
is not specified.
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr init 8
.Sh HISTORY
.Nm
is as old as
.Nx Ns /arm26 ,
which isn't very old.  Its name is a contraction of
.Dq Ben's BASIC BSD Bootloader .
.Sh BUGS
.Nm
cannot load kernels from a
.Nx
filesystem, nor can it load compressed kernels.
