NetBSD/src/usr.sbin/rtadvd/rtadvd.8
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     $Id: rtadvd.8,v 1.1 1999/07/02 09:28:17 itojun Exp $
.\"
.Dd May 17, 1998
.Dt RTADVD 8
.Os
.Sh NAME
.Nm rtadvd
.Nd router advertisement daemon
.Sh SYNOPSIS
.Nm
.Op Fl c Ar configfile
.Op Fl dDfs
.Ar interface ...
.Sh DESCRIPTION
.Nm Rtadvd
advertises router advertisement packet to the specified
.Ar interfaces .
.Pp
The program will daemonize itself on invocation.
Then, it will voluntarily send router advertisement packet periodically.
If a router solicitation packet from host has reached the program,
the program will respond by router advertisement packet.
.Pp
For each interface, which is called advertising interface,
content of router advertisement can be described in
.Xr rtadvd.conf 5 .
.Pp
If there is no description for the interface in the configuration file
or if the configuration file does not exist,
.Nm
sets all the parameters to their default values.
In particular,
.Nm
gets all the interface routes from the routing table and advertises
them as on-link prefixes.
.Pp
.Nm Rtadvd
watches the routing table.
By default, if an interface direct route is
added/deleted on an advertising interface,
.Nm
adds/deletes the corresponding prefix to/from its advertising list,
respectively.
If you do not want to enable this feature, you should specify the
.Ic Fl s
command line option when advocation.
.Bl -tag -width indent
.\"
.It Fl c
Specify an alternate location,
.Ar configfile ,
for the configuration file.
By default,
.Pa /usr/local/v6/etc/rtadvd.conf
is used.
.It Fl d
Debug.
.It Fl D
More debug.
.It Fl f
Foreground mode.
Do not become daemon.
.It Fl s
Static prefix.
Do not watch the routing table.
.El
.Sh RETURN VALUES
The program exits with 0 on success, and non-zero on failures.
.Sh FILES
.Bl -tag -width /usr/local/v6/etc/rtadvd.conf -compact
.It Pa /usr/local/v6/etc/rtadvd.conf
The default configuration file.
.El
.Sh SEE ALSO
.Xr daemon 3 ,
.Xr rtadvd.conf 5 ,
.Xr rtsol 8
.Sh HISTORY
The
.Nm
command first appeared in WIDE Hydrangea IPv6 protocol stack kit.
.\" .Sh BUGS
.\" (to be written)
