NetBSD/src/usr.sbin/sysinst/sysinst.8
.\"	$NetBSD: sysinst.8,v 1.5 2022/01/28 19:36:00 wiz Exp $
.\"
.\" Copyright (c) 2007 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 28, 2022
.Dt SYSINST 8
.Os
.Sh NAME
.Nm sysinst
.Nd install or upgrade a NetBSD system
.Sh SYNOPSIS
.Nm
.Op Fl Dp
.Op Fl C Ar bg:fg
.Op Fl f Ar definition_file
.Op Fl m Ar message_catalog_dir
.Sh DESCRIPTION
.Nm
is a menu-based program that may be used to install or upgrade a
.Nx
system.
It
is usually invoked automatically when the system is booted
from appropriate installation media.
.Pp
The following options are available:
.Bl -tag -width 24n
.It Fl C Ar bg:fg
Use the ansi colors (see
.In curses.h )
bg as background (default: 4 for blue)
and fg as foreground/text color (default: 7 for white).
.It Fl D
Switch on debugging.
.It Fl f Ar definition_file
Use
.Ar definition_file
as a file for definitions other than the defaults.
See the
.Sx DEFINITION FILE
section for its format.
.It Fl m Ar message_catalog_dir
Search for available language files in
.Ar message_catalog_dir .
If this argument is missing and there are
.Pa sysinstmsgs.*
files in the current directory, those are used.
If no such files are found, a compiled in default catalog directory
is used.
.It Fl p
Start the extended partition editor instead of the installer.
This option is not available on some versions compiled for space limited
install media.
.El
.Sh DEFINITION FILE
A definition file can be used with
.Nm
to control several aspects of the installation or upgrade process.
Options can be stored within the file as
.Dl option = value
pairs.
Options include the following, shown with their defaults
as well as a description
.Dq ( REL
and
.Dq MACH
are the release and architecture
respectively, as determined by the image
.Nm
is used on):
.Bl -column "targetroot mount" "pub/NetBSD/NetBSD-REL"
.It Sy "option name" Ta Sy "default value" Ta Sy "description"
.It machine Ta MACH Ta Machine architecture
.It xfer dir Ta /usr/INSTALL Ta Transfer dir
.It ext dir Ta "" Ta Extract dir (will usually be set later on)
.It ftp host Ta "ftp.NetBSD.org" Ta FTP host for fetching files
.It ftp dir Ta "pub/NetBSD/NetBSD-REL" Ta FTP directory for fetching files
.It ftp prefix Ta "/MACH/binary/sets" Ta Directory to look for sets,
used for all methods of fetching (i.e., not just FTP)
.It ftp user Ta "ftp" Ta FTP user for connecting
.It ftp pass Ta "-" Ta FTP password
.It ftp proxy Ta "-" Ta FTP proxy
.It nfs host Ta "-" Ta NFS host for fetching via NFS
.It nfs dir Ta "/bsd/release" Ta NFS directory for fetching files
.It cd dev Ta "cd0a" Ta Name of CD device for fetching files
.It fd dev Ta "/dev/fd0a" Ta Name of floppy device for fetching files
.It local dev Ta "-" Ta Other device to be mounted for fetching files
.It local fs Ta "ffs" Ta File system type for local device
.It local dir Ta "release" Ta Directory to look for in the mounted local file system
.It targetroot mount Ta "/targetroot" Ta Directory to mount target root dir to
.It dist postfix Ta ".tgz" Ta Suffix of set files to be extracted
.It diskname Ta "mydisk" Ta Xr disktab 5 diskname to use for target disk
.El
.Sh SEE ALSO
.Xr release 7 ,
.Xr afterboot 8 ,
.Xr boot 8 ,
.Xr diskless 8
.Pp
.Em <machine> Ns Pa /INSTALL.*
files on CD-ROM installation media
.Pa .../NetBSD- Ns Em <rel> Ns Pa / Ns Em <machine> Ns Pa /INSTALL.*
files in
.Nx
releases or snapshots.
.Pp
The default message catalog files are installed in
.Pa /usr/share/sysinst/catalog .
.Sh HISTORY
A
.Nm
command appeared in
.Nx 1.3 .
