NetBSD/src/share/man/man4/man4.alpha/intro.4
.\"     $NetBSD: intro.4,v 1.4 2001/12/06 15:51:47 ross Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 19, 2001
.Dt INTRO 4 alpha
.Os
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
This section describes the special files, related driver functions,
and networking support available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation; see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices which may be configured into
the system and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh DEVICE SUPPORT
This section describes the hardware supported by
.Nx Ns /alpha .
Software support for these devices comes in two forms.
A hardware device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then
compiled into the system.  When the resultant system is booted, the
autoconfiguration facilities in the system probe for the device and,
if found, enable the software support for it.  If a device does not
respond at autoconfiguration time it is not accessible at any time
afterwards.  To enable a device which did not autoconfigure, the
system must be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr config 8
.Sh HARDWARE
The following systems are supported:
.Pp
.ds x \fIx\fP
.Bl -tag -width speaker -offset indent -compact
.It AXPpci Systems
.\"The AXPpci family is Digital's lowest-end family of PCI-based systems,
.\"and includes machines like the UDB and the Multia.
Includes machines like the UDB and the Multia.
.It EB64+-family Systems
Includes the Digital EB64+ and third-party AlphaPC 64 systems.
.It DECpc AXP 150 (Jensen)
.It API UP1000
.\"Alpha Processor, Inc.'s UP1000 system.
.It Personal Workstation 600a, 600au (and others)
.\"The Personal Workstations are Digital's PCI-based workstations in
.\"small deskside boxes.
.It AlphaStation 200, 250, 255, and 400 Systems
.\"The AlphaStation 200, 250, 255, and 400 are Digital's lower-end
.\"PCI-based workstations.
.It DEC 3000/300-family Systems
The DEC 3000/300 family is an early low-end series of
TURBOchannel-based workstations including the DEC 3000/300, DEC 3000/300L,
DEC 3000/300X and DEC 3000/300LX.
.It DEC 3000/500-family Systems
.\"The DEC 3000/500 family is an early, high-end family of
TURBOchannel-based workstations including the DEC 3000/400, DEC
3000/500, DEC 3000/600, DEC 3000/700, DEC 3000/800 and DEC
3000/900 as well as several minor variations.
.It EB164-family Systems
Includes the Digital EB164 and third-party AlphaPC 164 systems.
.It Digital Personal Workstation ("au" series)
.It Digital AlphaServer 800 Systems
.It Digital AlphaServer 1000 and 1000A Systems
.It Digital Server 330\*x Systems
.It AlphaServer 4\*x00 Systems
.\"The AlphaServer 4\*x00 Systems are Digital's very fast medium server
.\"systems.
.It AlphaServer 8\*x00 Systems
.\"The AlphaServer 8\*x00 Systems are Digital's very high-end systems,
.\"including the AlphaServer 8200 and AlphaServer 8400.
.It AlphaStation 500 and 600 Systems
.\"The AlphaStation 500 and 600 systems are Digital's high-end PCI-based
.\"workstations.
.It API UP1000 and UP1100
AMD 751-based EV6 systems.
.It 264DP, XP1000, DS10, DS20, API UP2000, UP2000+
Tsunami-based EV6 (21264) systems.
.El
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of the system.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
.Bl -tag -width jensenio -offset indent -compact
.It apecs
DECchip 21072/21071 Core Logic chipset
.It asc
TURBOchannel single-channel SCSI adapter
.It cia
DECchip 2117x Core Logic chipset
.It dwlpx
DEC DWLPA and DWLPB PCI adapter
.It gbus
internal bus on AlphaServer CPU modules
.It irongate
API UP1000 AMD751 Core Logic + AGP chipset
.It jensenio
DEC 2000/300 (Jensen) I/O module
.It kft
KFTIA and KFTHA Bus Adapter Node for I/O hoses
.It lca
DECchip 21066 Core Logic chipset
.It mcbus
MCBUS system bus found on AlphaServer 4100 systems
.It mcpcia
MCPCIA MCBUS-to-PCI bus adapter
.It sableio
AlphaServer 2100 (Sable) STD I/O module
.It tcasic
TURBOchannel host bus support
.It tlsb
AlphaServer 8x00 TurboLaser System bus
.It tsc
DECchip 21272 Core Logic chipset
.It tsp
DECchip 21272 Core Logic chipset PCI controller
.It ttwoga
DEC T2 Gate Array
.It ttwopci
DEC T2 Gate Array PCI controller
.El
.Pp
TURBOchannel devices are supported through the
.Xr tc 4
bus and associated device drivers.
.Pp
PCI devices are supported through the
.Xr pci 4
bus and associated device drivers.
.Pp
ISA devices are supported through the
.Xr isa 4
bus and associated device drivers.
.Pp
EISA devices are supported through the
.Xr eisa 4
bus and associated device drivers.
.Pp
PCMCIA devices are supported through the
.Xr pcmcia 4
bus and associated device drivers.
.Pp
Console devices using ISA, EISA, or PCI video adaptors and standard AT
or PS/2 keyboards are supported by the machine independent
.Xr wscons 4
console driver.
.\" .Sh UNSUPPORTED DEVICES
.\" The following devices are not supported, due to unavailability of
.\" either documentation or sample hardware:
.\" .Pp
.\" .Bl -tag -width jensenio -offset indent -compact
.\" .It not yet
.\" .El
.\" .Pp
.Sh HISTORY
This
.Tn alpha
.Nm intro
appeared with
.Nx 1.6 .
