NetBSD/src/share/man/man4/man4.alpha/tlsb.4
.\"     $NetBSD: tlsb.4,v 1.3 2017/02/17 22:24:45 christos Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt TLSB 4 alpha
.Os
.Sh NAME
.Nm tlsb
.Nd
AlphaServer 8x00 TurboLaser System bus
.Sh SYNOPSIS
.Cd "tlsb* at mainbus0"
.Cd "tlsbmem* at tlsb? node ? offset ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the TurboLaser System Bus found on
AlphaServer 8200 and 8400 systems.
.Pp
The following devices are supported by the
.Nm
driver:
.Pp
.Bl -tag -width mcclock -offset indent -compact
.It gbus
internal bus on AlphaServer CPU modules
.It kft
KFTIA and KFTHA Bus Adapter Node for I/O hoses
.It tlsbmem
TurboLaser system memory
.El
.Sh SEE ALSO
.Xr alpha/gbus 4 ,
.Xr alpha/intro 4 ,
.Xr alpha/kft 4 ,
.Xr mainbus 4
