NetBSD/src/usr.sbin/postinstall/postinstall.8
.\"	$NetBSD: postinstall.8,v 1.5.2.1 2007/04/16 19:44:50 bouyer Exp $
.\"
.\" Copyright (c) 2005 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 25, 2007
.Dt POSTINSTALL 8
.Os
.Sh NAME
.Nm postinstall
.Nd check and fix installation after system upgrades
.Sh SYNOPSIS
.Nm postinstall
.Op Fl a Ar arch
.Op Fl d Ar destdir
.Op Fl m Ar machine
.Op Fl s Brq Ar srcdir | Ar tgzdir | Ar tgzfile
.Ar operation
.Op Ar item Op ...
.Sh DESCRIPTION
The
.Nm
utility performs post-installation checks and/or fixes on a system's
configuration files.
It is especially useful after system upgrades, e.g. after updating
from
.Nx 1.6.2
to
.Nx 2.0 .
If no
.Ar items
are provided, all checks or fixes are applied.
.Pp
Supported options:
.Bl -tag -width XsXsrcdirXXX -offset indent
.It Fl a Ar arch
MACHINE_ARCH.
Defaults to machine of the host operating system.
.It Fl d Ar destdir
Destination directory to check.
Defaults to
.Pa / .
.It Fl m Ar machine
MACHINE.
Defaults to machine of the host operating system.
.It Fl s Brq Ar srcdir | Ar tgzdir | Ar tgzfile
The location of the reference files, or the
.Nx
source files used to create the reference files.
This may be specified in one of three ways:
.Bl -tag -width XXsXtgzfileXX
.It Fl s Ar srcdir
The top level directory of the
.Nx
source tree.
By default this is
.Pa /usr/src .
.It Fl s Ar tgzdir
A directory in which reference files have been
extracted from one or more of the
.Dq Pa etc.tgz
or
.Dq Pa xetc.tgz
files from a binary distribution of
.Nx .
.It Fl s Ar tgzfile
The location of one or more set files
(or
.Dq "tgz files" )
from a binary distribution of
.Nx .
Each set file is a compressed archive containing reference files.
More than one set file may be specified, either by
using a single
.Fl s
option with a colon-separated list of
.Ar tgzfile
names, or by using multiple
.Fl s
options; this is likely to be useful to specify the locations of both the
.Pa etc.tgz
and
.Pa xetc.tgz
set files.
Note that file names may not contain embedded colon
.Pq Ql \&:
characters, because that would conflict with the use of the colon
character to delimit multiple file names with a single argument.
.El
.El
.Pp
The
.Ar operation
argument may be one of:
.Bl -tag -width usageXX -offset indent
.It Cm check
Perform post-installation checks on items.
.It Cm diff Op Xr diff 1 options
Similar to
.Cm check ,
but also show the differences between the files.
.It Cm fix
Apply fixes that
.Cm check
determines need to be applied.
Not all items can be automatically fixed by
.Nm .
.Xr etcupdate 8
may help, and in some cases manual intervention is required.
.It Cm help
Display a short help.
.It Cm list
List available
.Ar items .
.It Cm usage
Same as
.Cm help .
.El
.Sh EXIT STATUS
The
.Nm
utility exits 0 on success, and \*[Gt]0 if an error occurs
or a problem was found.
.Sh SEE ALSO
.Xr etcupdate 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 1.6 .
