NetBSD/src/share/man/man9lua/pmf.9lua
.\"	$NetBSD: pmf.9lua,v 1.1 2013/10/29 09:40:44 mbalmer Exp $
.\"
.\" Copyright (c) 2013 Marc Balmer <mbalmer@NetBSD.org>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd October 29, 2013
.Dt PMF 9lua
.Os
.Sh NAME
.Nm pmf
.Nd Lua binding to the power management framework
.Sh SYNOPSIS
.Cd "local pmf = require 'pmf'"
.Pp
.Bl -tag -width XXXX -compact
.It Dv pmf.system_shutdown(howto)
.It Dv pmf.set_platform(key, value)
.It Dv value = pmf.get_platform(key)
.El
.Sh DESCRIPTION
The
.Nm
Lua binding provides access to the power management framework.
.Pp
.Bl -tag -width XXXX -compact
.It Dv pmf.system_shutdown(howto)
Shutdown all attached devices.
.Ar howto
should contain the
.Xr reboot 2
.Ar howto
argument.
The following values are defined as constants in the
.Nm
table:
.Pp
.Bl -tag -width XXXX -compact
.It Dv pmf.RB_AUTOBOOT
.It Dv pmf.RB_ASKNAME
.It Dv pmf.RB_DUMP
.It Dv pmf.RB_HALT
.It Dv pmf.RB_POWERDOWN
.It Dv pmf.RB_KDB
.It Dv pmf.RB_NOSYNC
.It Dv pmf.RB_RDONLY
.It Dv pmf.RB_SINGLE
.It Dv pmf.RB_USERCONF
.El
.Pp
.It Dv pmf.set_platform(key, value)
Insert a name-value pair into the platform information database.
.Pp
.It Dv value = pmf.get_platform(key)
Retrieve the value for
.Ar key
from the platform information database.
Returns nil if the key is not present.
.El
.Sh SEE ALSO
.Xr lua 1 ,
.Xr luac 1 ,
.Xr intro 9lua ,
.Xr lua 4 ,
.Xr pmf 9
.Sh HISTORY
An
.Nm
Lua manual appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
Lua binding was written by
.An Marc Balmer Aq Mt mbalmer@NetBSD.org .
