NetBSD/src/usr.sbin/yppoll/yppoll.8
.\" Copyright (c) 1994 Mats O Jansson <moj@stacken.kth.se>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: yppoll.8,v 1.1 1994/08/23 17:03:14 deraadt Exp $
.\"
.Dd August 18, 1994
.Dt YPPOLL 8
.Os NetBSD
.Sh NAME
.Nm yppoll
.Nd get version of a YP map from YP server
.Sh SYNOPSIS
.Nm yppoll
.Op Fl h Ar host
.Op Fl d Ar domainname
.Ar mapname
.Sh DESCRIPTION
.Nm yppoll 
is used to get information of a maps order number and master server.
This utility is useful when determining if different servers have the
same version of a map.
.Nm yppoll
normally talks with the default
.Xr ypserv 8
process, but by using the 
.Fl h
option it is possible to talk with a specific server.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl d Ar domain
Don't use default domain, use the specified domain.
.It Fl h Ar host
Get map information from host instead of the default YP server.
.El
.Sh SEE ALSO
.Xr ypserv 8 
.Sh AUTHOR
Theo de Raadt, John Brezak and Mats O Jansson
