NetBSD/src/usr.sbin/btdevctl/btdevctl.8
.\" $NetBSD: btdevctl.8,v 1.2 2006/08/27 11:41:58 plunky Exp $
.\"
.\" Copyright (c) 2006 Itronix Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of Itronix Inc. may not be used to endorse
.\"    or promote products derived from this software without specific
.\"    prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY ITRONIX INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL ITRONIX INC. BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Copyright (c) 2004 Maksim Yevmenkin <m_evmenkin@yahoo.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id: btdevctl.8,v 1.2 2006/08/27 11:41:58 plunky Exp $
.\" $FreeBSD: src/usr.sbin/bluetooth/bthidcontrol/bthidcontrol.8,v 1.3 2005/01/18 20:02:30 ru Exp $
.\"
.Dd August 27, 2006
.Dt BTDEVCTL 8
.Os
.Sh NAME
.Nm btdevctl
.Nd Bluetooth remote device control utility
.Sh SYNOPSIS
.Nm
.Ar btdev
.Ar command
.Op Ar parameters
.Sh DESCRIPTION
The
.Nm
utility is used to configure
.Xr btdev 4
devices in the system, and manage the configuration entries stored in the
.Pa /var/db/btdev.xml
file.
.Pp
The
.Nm
utility will print results to the standard output and error messages to the
standard error.
.Pp
The commands are as follows:
.Bl -tag -width indent
.It Cm Attach Op Fl q
Attach device to
.Ar btdev .
If the
.Fl q
flag is given, be quiet about unconfigured devices.
.It Cm Detach Op Fl q
Detach device from
.Ar btdev .
.It Cm Parse
Parse HID descriptor in configuration entry for
.Ar btdev
and print in legible format.
.It Cm Print
Print configuration entry for
.Ar btdev
.It Cm Query Oo Fl d Ar device Oc Fl a Ar address Fl s Ar service
Perform an SDP query to the remote Bluetooth
.Ar address
for the given
.Ar service
and create a configuration entry for
.Ar btdev .
.Ar address
may be given as BDADDR or a name.
If a name was specified,
.Nm
attempts to resolve the name via
.Xr bt_gethostbyname 3 .
Communications can be limited to a specific controller by use of the
.Fl d
option.
Known services are:
.Pp
.Bl -tag -compact
.It Dv HID
Human Interface Device
.It Dv HFP
Hands Free Profile
.It Dv HSET
Headset
.El
.Pp
.It Cm Remove
Remove config entry for
.Ar btdev
from configuration file.
.El
.Sh EXIT STATUS
.Ex -std
.Sh FILES
.Bl -tag -compact
.It Pa /dev/btdevN
.It Pa /var/db/btdev.xml
.El
.Sh SEE ALSO
.Xr btdev 4 ,
.Xr bthidev 4 ,
.Xr btsco 4
.Sh HISTORY
Parts of the
.Nm
program originated in the
.Fx
.Nm bthidcontrol
program.
.Sh AUTHORS
.An Iain Hibbert
for Itronix, Inc.
.An Maksim Yevmenkin Aq m_evmenkin@yahoo.com
