NetBSD/src/distrib/utils/mksunbootcd/mksunbootcd.1
.\"	$NetBSD: mksunbootcd.1,v 1.1.1.1 1999/01/18 07:37:24 mrg Exp $
.\"
.\" Copyright (c) 1999 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 14, 1999
.Dt MKSUNBOOTCD 8
.Os NetBSD
.Sh NAME
.Nm mksunbootcd
.Nd combine filesystem for Sun Microsystems, Inc. computers for creating
bootable compact discs images.
.Sh SYNOPSIS
.Nm
.Op Fl c Ar cylsz
.Op Fl d
.Op Fl v
.Ar filesystem
.\" XXXX someone fix me!  i get lost after sun4m :(
.\" .Op Ar sun4 Op Ar sun4c Op Ar sun4m Op Ar "sun3 | sun4d" Op Ar "sun3x | sun4e"
.Ar sun4
.Ar sun4c
.Ar sun4m
.Ar "sun3|sun4d"
.Ar "sun3x|sun4e"
.Sh DESCRIPTION
The
.Nm
program combines filesystem partitions for Sun Microsystems, Inc. computers into
an image suitable for writing to a compact disc, that will allow the disc
to be booted on the sun3, sun3x, sun4, sun4c, sun4m and sun4u platforms.  This
hardware is supported by the
.Nx
.Em sparc ,
.Em sparc64
and
.Em sun3
ports.  The architecture arguments above must be the bootable filesystem images
for the named architecture.
.Ar filesystem
is typically an iso9660 filesystem, see
.Xr mount_cd9660 8
for details, but can be any type as long as the first 512 bytes of the image are
not used.  This image is modified, and the additional partitions added after this
partition, in order.  If any architecture image is missing, that partition is
not used.  If a disc with sun4 and sun4m support only was to be created, a dummy
image would need to be in place for sun4c.
.Pp
If the same boot image maybe used for multiple architectures (as the NetBSD/sparc
ports for sun4, sun4c and sun4m allow), the same bootfile can be listed multiple
times on the command line.  The
.Nm
program will detect this and only write one copy of the boot image.
.Sh NOTES
For the UltraSPARC line of computers, the PROM decodes a file in the first
partition of the CD-ROM, which must be an ISO9660 file-system, called
.Pa .slicemapfile .
The format of this file is an
.Dq m
followed by a partition number, starting at offset 0, plus an architecture
identifier, such as
.Dq sun4c
or
.Dq sun4u .
The UltraSPARC uses the
.Dq sun4u
partition as it's boot partition.  An example file that would be compatible with
older hardware would look like:
.Bd -literal
        m       1       sun4
        m       2       sun4c
        m       3       sun4m
        m       4       sun4d
        m       5       sun4u
.Ed
.Pp
As such, to enable UltraSPARC booting, such a file must be present on the
image before
.Nm
adds bootable partitions to the image.
.Sh OPTIONS
The following options are available:
.Bl -tag -width 123456
.It Fl c
The
.Fl c
option sets cylinder size for this cd to
.Ar cylsz ,
which must be a multiple of 4.  The default cylinder size is 640.
.It Fl d
The
.Fl d
option turns on debugging output.
.It Fl v
The
.Fl v
option turns on verbose output.
.Sh AUTHOR
The
.Nm
program was written by Ignatios Souvatzis <is@netbsd.org>, with some
help from Matthew Green <mrg@eterna.com.au>, who also wrote this
manual page.
.Sh SEE ALSO
.Xr newfs 8 ,
.Xr mount 8 ,
.Xr mount_ffs 8 .
