NetBSD/src/sys/arch/amiga/stand/iteconfig/iteconfig.8
.\"
.\" Copyright (c) 1994 Christian E. Hopps
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christian E. Hopps.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$Id: iteconfig.8,v 1.1 1994/02/03 18:48:38 chopps Exp $
.\"
.Dd February 3, 1994
.Dt ITECONFIG 8 amiga
.Os 
.Sh NAME
.Nm iteconfig 
.Nd modify bitmaped console attributes at run time.
.Sh SYNOPSIS
.Nm iteconfig
.Fl h
|
.Fl v
.Nm iteconfig
.Op Fl i
.Op Fl V Ar volume
.Op Fl T Ar time
.Op Fl P Ar pitch
.Op Fl W Ar width
.Op Fl H Ar height
.Op Fl D Ar depth
.Op Fl X Ar offset
.Op Fl Y Ar offset
.Op Ar color0 Op Ar color1 Op Ar ...
.Sh DESCRIPTION
.Nm iteconfig
is used to modify or examine the amiga's bitmaped console.  There are
two areas in the console, the speaker and the display.
.Pp
With the display flags and values, you can set the
.Ar width
,
.Ar height
and
.Ar depth
of the console display.  You can also move the display around on the
monitor with a horizontal and vertical
.Ar offset .
Finally the remaining arguments to
.Nm iteconfig
are used as color values for the view, beginning with color 0.
.Pp
The speaker options allow you to set the
.Ar volume
,
.Ar pitch
and length in 
.Ar time
(100's of a second) of a console beep.
.Pp
The following flags are interpreted by
.Nm iteconfig
.Bl -tag -width indent
.It Fl i
Print information about the console's current state after
.Nm iteconfig
finishes processing all other arguments.
.It Fl V
Set the volume of the console beep to
.Ar volume
(0 to 63).
.It Fl P
Set the pitch of the console beep to
.Ar pitch
(10 to 1299).
.It Fl T
Set the length of the console beep to
.Ar time
100's of a second.  Therefore if
.Ar time
is 100 then a beep will last 1 second.
.It Fl W
Set the width of the console display to
.Ar width
pixel columns. (positive integer)
.It Fl H
Set the height of the console display to
.Ar height
pixels rows (
.Ar height
should be an even positive integer).
.It Fl D
Set the number of bitplanes the console should use to
.Ar depth .
Therefore if
.Ar depth
is 3 then the number of color will be 8.
.It Fl X
Set the horizontal offset of the console view on the monitor in
.Ar offset
pixel columns. (positive or negative integer)
.It Fl Y
Set the vertical offset of the console view on the monitor in
.Ar offset
pixel rows. (positive or negative integer)
