NetBSD/src/usr.bin/gcore/gcore.1
.\"     $NetBSD: gcore.1,v 1.5 2003/01/23 17:52:14 jdolecek Exp $
.\"
.\" Copyright (c) 1983, 1990, 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)gcore.1	8.2 (Berkeley) 4/18/94
.\"
.Dd "January 23, 2003"
.Dt GCORE 1
.Os
.Sh NAME
.Nm gcore
.Nd get core images of running process
.Sh SYNOPSIS
.Nm
.Ar pid
.Op Ar pid ...
.Sh DESCRIPTION
.Nm 
creates a core image of the specified processes
suitable for use with
.Xr gdb  1 .
By default, the core is written to the file
.Dq Pa progname.<core> 
(where 
.Dq Pa progname
is the program name of the process corresponding to the pid that is given on
the command line) or to what the
.Xr sysctl 8
.Dq Pa proc.<pid>.corename 
argument is set to.
.Sh FILES
.Bl -tag -width /var/log/messages -compact
.It Pa progname.<core>
The core image.
.El
.Dp
.Sh HISTORY
.Nm
appeared in BSD 4.2, dissappeared in
.Nx 1.2 ,
and reappeared in
.Nx 2.0 .
.Sh SEE ALSO
.Xr gdb 1 ,
.Xr sysctl 8
.Sh BUGS
The 
.Op Fl o Ar corename
option is not implemented.
