NetBSD/src/usr.bin/aiomixer/aiomixer.1
.\"     $NetBSD: aiomixer.1,v 1.1 2021/05/07 16:29:24 nia Exp $
.\"
.\" Copyright (c) 2021 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Nia Alarie.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 4, 2019
.Dt AIOMIXER 1
.Os
.Sh NAME
.Nm aiomixer
.Nd graphical mixer for
.Nx
audio
.Sh SYNOPSIS
.Nm aiomixer
.Op Fl d Ar device
.Op Fl u
.Sh DESCRIPTION
.Nm
is a graphical frontend for
.Xr mixer 4
devices that runs in your terminal.
.Pp
.Nm
is primarily controlled using the cursor keys, e.g. to select a
control, or change a control's value.
Movement similar to
.Xr vi 1
is also supported.
The current class can be changed with the number keys.
The Q or Escape key can be used to return to the previous pane or exit
.Nm .
.Pp
By default, volume levels for individual channels cannot be changed
separately.
The U key can be pressed to toggle changing the volume of individual
channels.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl d Ar device
Used to specify an alternative mixer device.
.It Fl u
Used to unlock channels on start up.
.El
.Sh FILES
.Bl -tag -width /dev/mixer[0-3] -compact
.It Pa /dev/mixer
.It Pa /dev/mixer[0-3]
.El
.Sh SEE ALSO
.Xr mixerctl 1 ,
.Xr mixer 4
.Sh HISTORY
The first version (only available in pkgsrc) didn't support
.Dv AUDIO_MIXER_SET
properly, among other bugs.
.Sh AUTHORS
.Nm
was written by 
.An Nia Alarie
.Aq nia@NetBSD.org .
.Sh BUGS
.Nm aiomixer
shows whatever mixer nodes the audio device's driver returns.
Some drivers do not provide the most user-friendly control names.
