NetBSD/src/share/man/man4/man4.sgimips/hpc.4
.\"	$NetBSD: hpc.4,v 1.9 2006/07/20 13:23:29 rumble Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This document is derived from work contributed to The NetBSD Foundation
.\" by Antti Kantee.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 20, 2006
.Dt HPC 4 sgimips
.Os
.Sh NAME
.Nm hpc
.Nd SGI High performance Peripheral Controller
.Sh SYNOPSIS
.Cd "hpc0 at gio0 addr 0x1fb80000 flags 0x0000"
.Cd "hpc1 at gio0 addr 0x1fb00000 flags 0x0000"
.Cd "hpc2 at gio0 addr 0x1fb98000 flags 0x0000"
.Cd "hpc3 at gio0 addr 0x1fb90000 flags 0x0000"
.Sh DESCRIPTION
.Nm
interfaces the peripherals connected to it to the
.Xr gio 4
bus.
.Nm
is found on the Personal Iris 4D/3x, Indigo, Indy, Challenge-S, and Indigo2
machines.
.Pp
There are three different numerical revisions of the
.Nm
controller.
Revisions 1 and 1.5 exist on Personal Iris 4D/3x and Indigo machines,
as well as GIO32bis expansion cards such as the E++ SEEQ-based
Ethernet adapter.
Revision 1.5 supports bi-endian operation.
Revision 3 exists on Indy and Indigo2 systems.
It is possible to have an on-board HPC3 as well as HPC1.5-based
GIO32bis adapters in the Indy.
.Pp
The
.Nm
driver will attempt to detect the revision present, but since
this is a heuristic exercise, flags exist to force the detected
revision:
.Bl -tag -compact -width "0x0000" -offset "xxxx"
.It 0x0001
Force HPC Revision to 1
.It 0x0002
Force HPC Revision to 1.5
.It 0x0003
Force HPC Revision to 3
.El
.Sh HARDWARE
.Bl -tag -width dsclock -offset indent
.It dsclock
DS1286-based RTC
.It dpclock
DP8573A-based RTC
.It haltwo
HAL2 audio controller
.It sq
Seeq 8003 and 80C03
.Tn Ethernet
controllers
.It wdsc
WD33c93
.Tn SCSI
controller
.It zsc
Zilog Z8530 UART
.El
.Sh SEE ALSO
.Xr gio 4 ,
.Xr imc 4 ,
.Xr pic 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.6
with support for Revision 3.
Revision 1 and 1.5 support was added in
.Nx 2.0 .
.Sh BUGS
.Nm
Revisions 1 and 1.5 support DMA buffer pointers of only 28 bits
and may therefore only address 256 megabytes of memory.
The R4k Indigo and Indy are the only systems that support sufficient
memory to illustrate this drawback.
A software workaround is not currently implemented.
Revision 3, with 32 bit pointers, does not have this limitation.
