NetBSD/src/share/man/man4/man4.sgimips/hpc.4
.\"	$NetBSD: hpc.4,v 1.3 2003/12/15 06:28:01 lonewolf Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This document is derived from work contributed to The NetBSD Foundation
.\" by Antti Kantee.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 15, 2003
.Dt HPC 4 sgimips
.Os
.Sh NAME
.Nm hpc
.Nd SGI High performance Peripheral Controller
.Sh SYNOPSIS
.Cd "hpc0 at gio0 addr 0x1fb80000"
.Sh DESCRIPTION
.Nm hpc
interfaces the peripherals connected to it to the
.Xr gio 4
bus.
.Nm
is found for example on the Indy and Indigo2 machines.
.Sh HARDWARE
.Bl -tag -width dsclock -offset indent
.It dsclock
DS1286-based RTC
.It haltwo
HAL2 audio controller
.It sq
Seeq 8003 and 80C03
.Tn Ethernet
controllers
.It wdsc
WD33c93
.Tn SCSI
controller
.It zsc
Zilog Z8530 UART
.El
.Sh SEE ALSO
.Xr gio 4 ,
.Xr imc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.6 .
