NetBSD/src/sbin/newfs_exfatfs/newfs_exfatfs.8
.\"	$NetBSD: newfs_exfatfs.8,v 1.1.2.3 2024/08/02 00:23:21 perseant Exp $
.\"
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)newlfs.8	8.1 (Berkeley) 6/19/93
.\"
.Dd October 17, 2022
.Dt NEWFS_EXFATFS 8
.Os
.Sh NAME
.Nm newfs_exfatfs
.Nd construct a new exFAT file system
.Sh SYNOPSIS
.Nm
.Op Ar newfs_exfatfs-options
.Ar special
.Sh DESCRIPTION
.Nm
builds an exFAT file system on the specified special
device basing its defaults on the information in the disk label.
Before running
.Nm
the disk must be labeled using
.Xr disklabel 8 .
The proper fstype is exFAT.
.Pp
The following options define the general layout policies.
.Bl -tag -width Fl
.It Fl # Ar serial-number
Use the given serial number, rather than generating one at random.
.It Fl a Ar fat-alignment
The alignment of the File Allocation Table in bytes.
If not specified, the alignment is made according to XXX.
.It Fl b Ar bootcode-file
Use the bootcode contained in the given file.
If not specified, the bootcode field will be filled with NUL (0x00).
.It Fl c Ar cluster-size
The cluster size of the file system in bytes.
If not specified, the block size is generated based on the file system size.
.It Fl D
Print debugging information to stdout.
.It Fl F
Force creation of a file system even on a partition labeled as another type.
.It Fl h Ar heap-alignment
The alignment of the cluster heap, in bytes.
If not specified, the FAT alignment will be used.
.It Fl L Ar label
Specify the file system label.  The default label is "NONE GIVEN".
.It Fl N
Do not actually create the filesystem.
.It Fl o Ar partition-offset
The offset of this partition from the beginning of the disk, in sectors.
The default value is taken from the disklabel.
.It Fl q
Do not print anything on stdout.
.It Fl S Ar sector-size
Use this as the size of filesystem sectors, in bytes.  The default is to
use the sector size from the disk label.
.It Fl s Ar size
The size of the file system in sectors.
.It Fl T Ar type
Use the given disk type when there is no disk label.
.It Fl u Ar upcase-file
Use the given file for the filesystem's upcase table.
The default is to use the recommended upcase table from
section 7.2.5.1 of the specification.
.It Fl v
Be more verbose about what is being done.
.It Fl w
Do not attempt to read the existing superblock, if any.
By default the existing superblock will be read and the
existing file system parameters will be used unless
overridden by command-line arguments.
.El
.Sh SEE ALSO
.Xr disktab 5 ,
.\" .Xr exfatfs 5 ,
.Xr disklabel 8 ,
.Xr diskpart 8
.Rs
.%A Microsoft
.%T "exFAT file system specification"
.%D April 14, 2022
.Re
.Sh HISTORY
A
.Nm
command appeared in
.Nx 11.0 .
