NetBSD/src/usr.sbin/amd/fsinfo/fsinfo.8
.\" Copyright (c) 1993 Jan-Simon Pendry.
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)fsinfo.8	8.1 (Berkeley) 6/28/93
.\"	$Id: fsinfo.8,v 1.3 1997/07/24 23:18:30 christos Exp $
.\"
.TH FSINFO 8 "June 28, 1993"
.SH NAME
fsinfo \- co-ordinate site-wide filesystem information
.SH SYNOPSIS
.B fsinfo
[
.B \-v
] [
.B \-a
.I autodir
] [
.B \-b
.I bootparams
] [
.B \-d
.I dumpsets
] [
.B \-e
.I exports
] [
.B \-f
.I fstabs
] [
.B \-h
.I hostname
] [
.B \-m
.I automounts
] [
.B \-I
.I dir
] [
.B \-D
.I string[=string]]
] [
.B \-U
.I string[=string]]
]
.I config
.I ...
.SH DESCRIPTION
The
.B fsinfo
utility takes a set of system configuration information, and generates
a co-ordinated set of
.I amd
,
.I mount
and
.I mountd
configuration files.
.PP
The
.B fsinfo
command is fully described in the document
.I "Amd - The 4.4BSD Automounter"
.SH "SEE ALSO"
.BR amd (8),
.BR mount (8),
.BR mountd (8).
.SH HISTORY
The
.B fsinfo
command first appeared in 4.4BSD.
