NetBSD/src/share/man/man5/daily.conf.5
.\"	$NetBSD: daily.conf.5,v 1.4 1999/03/17 20:19:44 garbled Exp $
.\"
.\" Copyright (c) 1996 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 30, 1996
.Dt DAILY.CONF 5
.Os
.Sh NAME
.Nm daily.conf
.Nd daily maintenance configuration file
.Sh DESCRIPTION
The
.Nm
file specifies which of the standard
.Pa /etc/daily
services are performed.  The
.Pa /etc/daily
script is run, by default, every night on a
.Nx
system.
.Pp
The variables described below can be set to "NO" to disable the test:
.Bl -tag -width purge_accounting
.It Sy find_core
This runs
.Xr find 1
over the entire local filesystem, looking for core files.
.It Sy run_msgs
This runs
.Xr msgs 1
with the ``-c'' argument.
.It Sy expire_news
This runs the
.Pa /etc/expire.news
script.
.It Sy purge_accounting
This ages accounting files in
.Pa /var/account .
.It Sy run_calendar
This runs
.Xr calendar 1
with the ``-a'' argument.
.It Sy check_uucp
This runs the
.Pa /etc/uuclean.daily
script, as the daemon user, and runs
.Xr uustat 1
with the ``-a'' argument.
.It Sy check_disks
This uses the
.Xr df 1
and
.Xr dump 8
to give disk status.
.It Sy check_mailq
This runs
.Xr mailq 1 .
.It Sy check_network
This runs
.Xr netstat 1
with the ``-i'' argument, and also checks the
.Xr rwhod 8
database, and runs
.Xr ruptime 1
if there are hosts in
.Pa /var/rwho .
.It Sy run_fsck
This runs
.Xr fsck 8
with the ``-n'' option.
.It Sy run_rdist
This runs
.Xr rdist 1
with
.Pa /etc/Distfile .
.It Sy run_security
This runs the
.Pa /etc/security
script looking for possible security problems with the system.
.El
.Pp
.Sh FILES
.Pa /etc/daily
.Pa /etc/daily.conf
.Sh SEE ALSO
.Xr weekly.conf 5 ,
.Xr monthly.conf 5 ,
.Xr security.conf 5
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.3 .
