NetBSD/src/share/man/man5/floppytab.5
.\"	$NetBSD: floppytab.5,v 1.4 2013/03/15 19:32:31 njoly Exp $
.\"
.\" Copyright (c) 2011 Jukka Ruohonen
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 4, 2011
.Dt FLOPPYTAB 5
.Os
.Sh NAME
.Nm floppytab
.Nd parameters for floppy diskettes
.Sh DESCRIPTION
The
.Nm
file defines parameters for
.Dq floppy
diskettes.
The format of the file matches the arguments passed to the
.Xr fdformat 1
utility.
When invoked with the
.Fl t
flag,
.Xr fdformat 1
can use the known floppy formats from
.Pa /etc/floppytab
directly.
.Sh FILES
.Bl -tag -width /etc/floppytab -compact
.It Pa /etc/floppytab
.El
.Sh SEE ALSO
.Xr eject 1 ,
.Xr fdformat 1
