NetBSD/src/share/man/man5/genassym.cf.5
.\"	$NetBSD: genassym.cf.5,v 1.2 1997/11/24 06:29:15 lukem Exp $
.\"
.\" Copyright (c) 1997 Matthias Pfaller.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	  This product includes software developed by Matthias Pfaller.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd Jan 25, 1997
.Dt GENASSYM.CF 5
.Os NetBSD
.Sh NAME
.Nm genassym.cf
.Nd assym.h definition file.
.Sh DESCRIPTION
The
.Nm
file is used by 
.Xr genassym.sh 5
to make constant C expressions known to assembler source files.
Lines starting with '#' are discarded by
.Xr genassym.sh 5 .
Lines starting with 
.Em include , 
.Em ifdef ,
.Em if ,
.Em else
or
.Em endif
are proceeded with '#' and passed otherwise unmodied to the C compiler.
Lines starting with
.Em quote
get passed on with the
.Em quote
command removed. The last command
.Xr genassym.sh 5
understands is
.Em define .
The first word after
.Em define
should be a valid CPP identifier. The rest of the line should be a constant
C expression. The output of
.Xr genassym.sh 5
will assign the numerical value of this expression to the CPP identifier.
.Sh FILES
.Pa /sys/arch/${MACHINE}/${MACHINE}/genassym.cf
.Sh SEE ALSO
.Xr genassym.sh 8 ,
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.3 .
