NetBSD/src/share/man/man5/ifaliases.5
.\"	$NetBSD: ifaliases.5,v 1.9 2000/11/08 01:33:18 lukem Exp $
.\"
.\" Copyright (c) 1996 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 8, 2000
.Dt IFALIASES 5
.Os
.Sh NAME
.Nm ifaliases
.Nd interface aliases file
.Sh DESCRIPTION
The
.Nm
file specifies the additional addresses (aliases) that each interface
has.
.Nm
is processed by
.Pa /etc/rc.d/network
at system boot time.
.Pp
Each line of the file is of the form:
.D1 address interface [netmask]
.Pp
The
.Ar address
is a network address of the alias.  This must be a number, or must be in
.Pa /etc/hosts ,
since the nameserver is not running at this point.
.Pp
The
.Ar interface
is the network interface the alias will be configured on.
.Pp
The
.Ar netmask
is the netmask of the alias's network address.  Although this is
optional, omitting the netmask is discouraged.  Omission results in
the use of the classful netmask associated with 
.Ar address .
.Sh FILES
.Pa /etc/ifaliases ,
.Pa /etc/rc.d/network
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.2 .
