NetBSD/src/share/man/man5/ipsec.conf.5
.\"	$NetBSD: ipsec.conf.5,v 1.2 2001/06/19 12:34:27 wiz Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This document is derived from works contributed to The NetBSD Foundation
.\" by Hubert Feyrer.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 19, 2001
.Dt IPSEC.CONF 5
.Os
.Sh NAME
.Nm ipsec.conf
.Nd static IPsec configuration read at system startup
.Sh DESCRIPTION
The
.Nm
file is read at system startup time if
.Sy ipsec
is set to
.Dq yes
in
.Xr rc.conf 5 .
.Xr setkey 8
is run with the
.Fl f
option to load in IPsec manual keys and policies from
.Pa /etc/ipsec.conf
at boot time, before any interfaces are configured.
.Pp
Please see the
.Xr setkey 8
manpage for all the commands available.
.Sh FILES
.Bl -tag -width /etc/ipsec.conf -compact
.It Pa /etc/ipsec.conf
The file
.Nm
resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr setkey 8 ,
.Xr ipsec 4
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.5 .
