NetBSD/src/share/man/man5/ld.so.conf.5
.\"	$NetBSD: ld.so.conf.5,v 1.8 1997/10/10 05:40:01 mrg Exp $
.\"
.\" Copyright (c) 1996 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 24, 1997
.Dt LD.SO.CONF 5
.Os NetBSD 1.3
.Sh NAME
.Nm ld.so.conf
.Nd run-time link-editor configuration file
.Sh DESCRIPTION
The
.Nm
file specifies additional default directories (beyond the standard set,
normally
.Dq /usr/lib )
to be scanned by
.Nm ldconfig
for shared libraries to include in the hints file used by the run-time linker
.Pa /usr/libexec/ld.so .
.Pp
Lines beginning with
.Dq #
are treated as comments and ignored.  Any other non-blank lines
are stripped of leading whitespace and trailing comments (introduced with
.Dq # )
together with any preceding whitespace, then treated as directories to be
scanned for shared libraries to add to the hints.
.Sh FILES
.Pa /etc/ld.so.conf
.Sh SEE ALSO
.Xr ldconfig 8
.Sh BUGS
Directory names containing the comment character
.Pq Dq #
and/or leading or trailing whitespace cannot be included.  (Embedded blanks
are allowed, however.)
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.3 .
