NetBSD/src/share/man/man5/ld.so.conf.5
.\"	$NetBSD: ld.so.conf.5,v 1.14 2001/09/08 01:29:06 wiz Exp $
.\"
.\" Copyright (c) 1996 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 24, 1997
.Dt LD.SO.CONF 5
.Os
.Sh NAME
.Nm ld.so.conf
.Nd run-time link-editor configuration file
.Sh DESCRIPTION
The
.Nm
file specifies additional default directories (beyond the standard set,
normally
.Dq /usr/lib
).
.Pp
On
.Xr a.out 5
systems, this file is scanned by
.Xr ldconfig 8
to create the hints files used by the run-time linker
.Pa /usr/libexec/ld.so
to locate shared libraries.
.Pp
On elf
.\" .Xr elf 5
systems, this file is scanned directly by the run-time linker
.Pa /usr/libexec/ld.elf_so .
.Pp
Lines beginning with
.Dq #
are treated as comments and ignored.  Any other non-blank lines beginning
with '/' are stripped of leading whitespace and trailing comments
(introduced with
.Dq # )
together with any preceding whitespace, then treated as directories to be
scanned for shared libraries to add to the hints.
.Pp
On elf
.\" .Xr elf 5
lines that do not begin with a '/' are parsed as hardware dependent per
library directives:
.sp
.nf
<library_name> <sysctl_variable> <variable_value>[,...]:<library_name>[,...] ...
.fi
.sp
If there is no match, the standard action is taken.
.Sh EXAMPLES
.sp
.nf
libm.so.0	machdep.fpu_present	1:libm387.so.0,libm.so.0
.fi
.sp
The above line loads both libm387 and libm when the
.Xr sysctl 3
variable fpu_present has the value 1.
.Sh FILES
.Pa /etc/ld.so.conf
.Sh SEE ALSO
.\" .Xr ld.elf_so 1
.\" .Xr ld.aout_so 1
.Xr a.out 5
.\" .Xr elf 5
.Xr ldconfig 8
.Sh BUGS
Directory names containing the comment character
.Pq Dq #
and/or leading or trailing whitespace cannot be included.  (Embedded blanks
are allowed, however.)
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.3 .
The ELF support for it was added in
.Nx 1.5 .
