NetBSD/src/share/man/man5/lkm.conf.5
.\"	$NetBSD: lkm.conf.5,v 1.8 2008/05/29 14:51:25 mrg Exp $
.\"
.\" Copyright (c) 1996 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 8, 2000
.Dt LKM.CONF 5
.Os
.Sh NAME
.Nm lkm.conf
.Nd loadable kernel module configuration file
.Sh DESCRIPTION
The
.Nm
file specifies loadable kernel modules, see
.Xr lkm 4 ,
that are to be loaded a boot time.
The
.Nm
file is processed by
.Pa /etc/rc.lkm
at system boot time, if it exists.
.Pp
Each line of the file is of the form
.Dl path options entry postinstall output when
.Pp
Except for the
.Em path ,
all other fields can be "-" to indicate empty.
.Pp
The
.Em path
is either an absolute pathname, or the name of a file in
.Pa /lkm
or
.Pa /usr/lkm
that is the LKM to be loaded.
.Pp
The
.Em options
are some combination of the -d and -v options to
.Xr modload 8 .
.Pp
The
.Em entry
is the C symbol to call to initialize the module, defaulting to
.Fn xxxinit .
.Pp
The
.Em postinstall
script is run after the LKM is installed.
.Pp
The output of the
.Xr ld 1
command is stored in
.Em output .
.Pp
The
.Em when
field specifies at which time in the startup process the LKM is loaded.
There are three predefined values which correspond to three points in
the processing of the system startup script
.Pa /etc/rc :
.Bl -tag -width XXX
.It BEFORENET
Before networking is started. This works only if the
.Pa /usr
file system can already be mounted at this time.
.It BEFOREMOUNT
Before all file systems listed in
.Pa /etc/fstab
are mounted (the
.Pa /usr
and
.Pa /var
file systems are already present).
.It AFTERMOUNT
After all file systems are mounted.
.El
.Pp
A "-" entry defaults to BEFORENET.
.Sh FILES
.Pa /etc/lkm.conf ,
.Pa /etc/rc ,
.Pa /etc/rc.d/lkm ,
.Pa /etc/rc.lkm
.Sh SEE ALSO
.Xr lkm 4 ,
.Xr modload 8
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.3 .
