NetBSD/src/share/man/man5/mk.conf.5
.\"	$NetBSD: mk.conf.5,v 1.13 2002/05/03 08:58:46 lukem Exp $
.\"
.\"  Copyright (c) 1999 The NetBSD Foundation, Inc.
.\"  All rights reserved.
.\"
.\"  This code is derived from software contributed to The NetBSD Foundation
.\"  by Luke Mewburn.
.\"
.\"  Redistribution and use in source and binary forms, with or without
.\"  modification, are permitted provided that the following conditions
.\"  are met:
.\"  1. Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\"  2. Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\"  3. All advertising materials mentioning features or use of this software
.\"     must display the following acknowledgement:
.\"  	This product includes software developed by Luke Mewburn.
.\"  4. The name of the author may not be used to endorse or promote products
.\"     derived from this software without specific prior written permission.
.\"
.\"  THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\"  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\"  OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\"  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\"  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\"  BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
.\"  OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\"  ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR
.\"  TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE
.\"  USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 27, 2001
.Dt MK.CONF 5
.Os
.\" turn off hyphenation
.hym 999
.Sh NAME
.Nm mk.conf
.Nd make configuration file
.Sh DESCRIPTION
The
.Nm
file overrides various parameters used during the build of the system.
.Pp
Listed below are the
.Nm
variables that may be set, the values to which each may be set,
a brief description of what each variable does, and a reference to
relevant manual pages.
.Ss NetBSD System variables
.Bl -tag -width NETBSDSRCDIR
.It Sy NETBSDSRCDIR
The path to the top level of the NetBSD sources.
If
.Xr make 1
is run from within the NetBSD source tree, the default is the top
level of that tree (as determined by the presence of
.Pa build.sh
and
.Pa tools/ ) ,
otherwise
.Sy BSDSRCDIR
will be used.
.It Sy BSDOBJDIR
The real path to the
.Sq obj
tree for the NetBSD source tree.
Default:
.Pa /usr/obj .
.It Sy BSDSRCDIR
The real path to the NetBSD source tree.
Default:
.Pa /usr/src .
.It Sy BUILD
If defined,
.Sq "make install"
checks that the targets in the source directories are up-to-date and
re-makes them if they are out of date, instead of blindly trying to install
out of date or non-existent targets.
.It Sy COPTS
Extra options for the C compiler.
Should be appended to (e.g.,
.Sy COPTS+=-g ) ,
rather than explicitly set.
.It Sy MANZ
Install manual pages compressed with
.Xr gzip 1 .
.It Sy MKCATPAGES
If
.Sq no ,
don't build or install the formatted manual pages.
.It Sy MKDOC
If
.Sq no ,
don't build or install the miscellaneous documentation.
.It Sy MKINFO
If
.Sq no ,
don't build or install the TeXinfo Info documentation.
.It Sy MKLINT
If
.Sq no ,
don't build or install the lint libraries.
.It Sy MKMAN
If
.Sq no ,
don't build or install the manual pages.
Sets
.Sy MKCATPAGES=no .
.It Sy MKNLS
If
.Sq no ,
don't build or install the NLS (Native Language Support) files.
.It Sy MKOBJ
If
.Sq no ,
don't create objdirs.
.It Sy MKPIC
If
.Sq no ,
don't build or install shared libraries.
.It Sy MKPICINSTALL
If
.Sq no ,
don't install the
.Sq *_pic.a
libraries.
.It Sy MKPROFILE
If
.Sq no ,
don't build or install the
.Sq *_p.a
profiling libraries.
.It Sy MKSHARE
If
.Sq no ,
set
.Sy MKCATPAGES=no ,
.Sy MKDOC=no ,
.Sy MKINFO=no ,
.Sy MKMAN=no ,
.Sy MKNLS=no .
.It Sy OBJMACHINE
If defined, creates objdirs of the form
.Pa obj.\*[Lt]arch\*[Gt] ,
where
.Sq \*[Lt]arch\*[Gt]
is the current architecture (as per
.Sq "uname -m" ) .
.It Sy UPDATE
If defined,
.Sq "make install"
only installs targets that are more recently modified in the source
directories that their installed counterparts.
.It Sy UNPRIVED
If defined,
.Sq "make install"
will not attempt to set the ownership or permissions of the target
file, and will instead attempt to log the information to
.Pa ${DESTDIR}/METALOG .
.El
.Ss Pkgsrc system variables
Please see
.Xr packages 7
for more variables used internally by the package system and
.Pa /usr/pkgsrc/mk/bsd.pkg.defaults.mk
for package-specific examples.
.Sh FILES
.Bl -tag -width /etc/mk.conf
.It Pa /etc/mk.conf
This file.
.It Pa /usr/pkgsrc/mk/bsd.pkg.defaults.mk
Examples for settings regarding the pkgsrc collection.
.El
.Sh SEE ALSO
.Xr make 1 ,
.Xr packages 7
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.2 .
