NetBSD/src/share/man/man5/modules.conf.5
.\"        $NetBSD: modules.conf.5,v 1.2 2015/04/20 06:50:13 wiz Exp $
.\"
.\" Copyright (c) 2015 Jared McNeill <jmcneill@invisible.ca>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 21, 2015
.Dt MODULES.CONF 5
.Os
.Sh NAME
.Nm modules.conf
.Nd Kernel module config file
.Sh DESCRIPTION
The
.Nm
file is read by the
.Pa modules
rc.d script during system start-up to load modules at boot,
before the system security level is raised.
.Ss FILE FORMAT
Lines starting with a hash
.Pq Sq #
and empty lines are ignored.
All other lines are passed to
.Xr modload 8 .
.Sh FILES
.Bl -tag -width XXetcXmodulesXconfXX
.It Pa /etc/modules.conf
The
.Nm
configuration file resides in
.Pa /etc .
.It Pa /etc/rc.d/modules
.Xr rc.d 8
script that parses
.Nm .
.El
.Sh SEE ALSO
.Xr modload 8 ,
.Xr rc 8
