NetBSD/src/share/man/man5/pkgpath.conf.5
.\" $NetBSD: pkgpath.conf.5,v 1.1 2020/07/13 09:10:35 jruoho Exp $
.\"
.\" Copyright (c) 2020 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jukka Ruohonen.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 13, 2020
.Dt PKGPATH.CONF 5
.Os
.Sh NAME
.Nm pkgpath.conf
.Nd paths for package utilities
.Sh DESCRIPTION
The
.Pa /etc/pkgpath.conf
file provides definitions of the paths to different
package utilities, including
.Xr pkg_admin 1
and
.Xr pkg_info 1
in particular.
These definitions are used by maintenance scripts such as
.Xr daily 5 .
.Pp
The definitions may be altered when using package utilities from
.Xr pkgsrc 7
instead of the default ones supplied by
.Nx .
.Sh FILES
.Bl -tag -width /etc/pkgpath.conf -compact
.It Pa /etc/pkgpath.conf
paths used by package utilities
.El
.Sh SEE ALSO
.Xr pkg_admin 1 ,
.Xr pkg_info 1 ,
.Xr daily 5 ,
.Xr security.conf 5
.Sh HISTORY
The
.Pa /etc/pkgpath.conf
file first appeared in
.Nx 7.0 .
