NetBSD/src/share/man/man5/rc.conf.5
.\"	$NetBSD: rc.conf.5,v 1.18 1999/01/16 14:16:43 lukem Exp $
.\"
.\" Copyright (c) 1996 Matthew R. Green
.\" Copyright (c) 1997 Curt J. Sampson
.\" Copyright (c) 1997 Michael W. Long
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 16, 1999
.Dt RC.CONF 5
.Os NetBSD 1.3
.\" turn off hyphenation
.hym 999
.Sh NAME
.Nm rc.conf
.Nd system startup configuration file
.Sh DESCRIPTION
The
.Nm
file specifies which services are enabled during system startup by
the startup script
.Pa /etc/rc .
The
.Nm
file is a shell script that is sourced by
.Pa /etc/rc
if it exists, meaning that
.Nm
must contain valid shell commands.
.Pp
Listed below are the
.Nm
variables that may be set, the values to which each may be set,
a brief description of what each variable does, and a reference to
relevant manual pages.
.Pp
Most variables are one of two types: enabling variables or flags
variables.
Enabling variables, such as
.Sy inetd ,
are generally named after the program or the system they enable,
and are set to "YES" or "NO".
Flags variables, such as
.Sy inetd_flags
have the same name with "_flags" appended, and determine what
arguments are passed to the program if it is enabled.
.Pp
If a variable that
.Pa /etc/rc
expects to be set is not set, or the value is not one of the allowed
values, a warning will be printed.
.Pp
Basic network configuration:
.Bl -tag -width net_interfaces
.It Sy hostname
Name of host.
If empty or not set, then the contents of
.Pa /etc/myname
(if it exists) are used.
.It Sy domainname
.Tn NIS
(YP) domain of host.
If empty or not set, then the contents of
.Pa /etc/defaultdomain
(if it exists) are used.
.It Sy defaultroute
Default network route.
If empty or not set, then the contents of
.Pa /etc/mygate
(if it exists) are used.
.El
.Pp
Boottime file-system and swap configuration:
.Bl -tag -width critical_filesystems
.It Sy critical_filesystems
File systems mounted very early in the system boot, except for the
.Pa /usr
and
.Pa /var
file-systems.
.It Sy no_swap
Set the
.Sy no_swap
variable to YES if you have configured your system with no swap on purpose.
If not set, or set to anything other than YES, and no swap devices
are configured, the system will warn you.
.El
.Pp
One-time actions to perform or programs to run on boot-up:
.Bl -tag -width net_interfaces
.It Sy lkm
YES or NO.
Runs
.Pa /etc/rc.lkm .
.It Sy savecore
YES or NO.
Runs the
.Xr savecore 8
utility.
Passes
.Sy savecore_flags .
.It Sy update_motd
YES or NO.
Updates the
.Nx
version string in the
.Pa /etc/motd
file to reflect the version of the running kernel.
See
.Xr motd 5 .
.El
.Pp
Networking startup:
.Bl -tag -width net_interfaces
.It Sy ipfilter
YES or NO.
Runs
.Xr ipf 8
to load in packet filter specifications from
.Pa /etc/ipf.conf
at network boot time, before any interfaces are configured.
See
.Xr ipf 5 .
.It Sy auto_ifconfig
YES or NO.
Sets the
.Sy net_interfaces
variable (see below) to the output of
.Xr ifconfig 8
with the
.Ar -l
flag and suppresses warnings about interfaces in this list that
do not have an ifconfig file or variable.
.It Sy net_interfaces
The list of network interfaces to be configured at boot time.
For each interface "xxn", the system first looks for ifconfig
parameters in
.Pa /etc/ifconfig.xxn
and then in the variable
.Sy ifconfig_xxn .
The contents of the file or the variable are handed to ifconfig
after the interface name.
If
.Sy auto_ifconfig
is set to "NO" and neither the file nor the variable is found,
a warning is printed.
.It Sy ifaliases_*
List of
.Sq Ar "address netmask"
pairs to configure additional network addresses for the given
configured interface
.Dq *
(e.g.
.Sy ifaliases_le0 ) .
If
.Ar netmask
is
.Dq - ,
then use the default netmask for the interface.
.It Sy flushroutes
YES or NO.
Flushes the route table on networking startup.
Useful when coming up to multiuser mode after going down to
single-user mode.
.It Sy ntpdate
YES or NO.
Runs
.Xr ntpdate 8
to set the system time from one of the hosts in
.Sy ntpdate_hosts .
If
.Sy ntpdate_hosts
is empty, it will attempt to find a list of hosts in
.Pa /etc/ntp.conf .
.It Sy ppp_peers
If
.Sy ppp_peers
is not empty, then
.Pa /etc/netstart
will check each word in
.Sy ppp_peers
for a coresponding ppp configuration file in
.Pa /etc/ppp/peers
and will call
.Xr pppd 8
with the
.Dq call Sy peer
option.
.El
.Pp
Daemons required by other daemons:
.Bl -tag -width net_interfaces
.It Sy inetd
YES or NO.
Runs the
.Xr inetd 8
daemon to start network server processes (as listed in
.Pa /etc/inetd.conf )
as necessary.
Passes
.Sy inetd_flags .
The
.Ar -l
flag turns on libwrap connection logging.
.It Sy portmap
YES or NO.
The
.Xr portmap 8
daemon is required for any
.Xr rpc 3
services.
These include NFS,
.Tn NIS ,
.Xr bootparamd 8 ,
.Xr rstatd 8 ,
.Xr rusersd 8 ,
and
.Xr rwalld 8 .
.El
.Pp
Commonly used daemons:
.Bl -tag -width net_interfaces
.It Sy update
YES or NO.
Runs
.Xr update 8
and passes
.Sy update_flags .
.It Sy syslogd
YES or NO.
Runs
.Xr syslogd 8
and passes
.Sy syslogd_flags .
.It Sy named
YES or NO.
Runs
.Xr named 8
and passes
.Sy named_flags .
.It Sy timed
YES or NO.
Runs
.Xr timed 8
and passes
.Sy timed_flags .
The
.Ar -M
option allows
.Xr timed 8
to be a master time source as well as a slave.
If you are also running
.Xr xntpd 8 ,
only one machine running both should have the
.Ar -M
flag given to
.Xr timed 8 .
.It Sy xntpd
YES or NO.
Runs
.Xr xntpd 8
and passes
.Sy xntpd_flags .
.It Sy sendmail
YES or NO.
Runs
.Xr sendmail 8
and passes
.Sy sendmail_flags .
.It Sy lpd
YES or NO.
Runs
.Xr lpd 8
and passes
.Sy lpd_flags .
The
.Ar -l
flag will turn on extra logging.
.El
.Pp
Routing daemons:
.Bl -tag -width net_interfaces
.It Sy routed
YES or NO.
Runs
.Xr routed 8 ,
the RIP routing protocol daemon.
Passes
.Sy routed_flags .
This should be NO if
.Sy gated
is YES.
.It Sy gated
YES or NO.
Runs
.Xr gated 8 ,
the multiprotocol routing daemon.
Passes
.Sy gated_flags .
This should be NO if
.Sy routed
is YES.
.Xr gated 8
is not included with
.Nx .
.It Sy mrouted
YES or NO.
Runs
.Xr mrouted 8 ,
the DVMRP multicast routing protocol daemon.
Passes
.Sy mrouted_flags .
.El
.Pp
Daemons used to boot other hosts over a network:
.Bl -tag -width net_interfaces
.It Sy rarpd
YES or NO.
Runs
.Xr rarpd 8 ,
the reverse ARP daemon, often used to boot
.Nx
and Sun workstations.
Passes
.Sy rarpd_flags .
.It Sy bootparamd
YES or NO.
Runs
.Xr bootparamd 8 ,
the boot parameter server, with
.Sy bootparamd_flags
as options.
Used to boot
.Nx
and
.Tn "SunOS 4.x"
systems.
.It Sy dhcpd
YES or NO.
Runs
.Xr dhcpd 8 ,
the Dynamic Host Configuration Protocol (DHCP) daemon,
for assigning IP addresses to hosts and passing boot information.
Passes
.Sy dhcpd_flags .
.It Sy rbootd
YES or NO.
Runs
.Xr rbootd 8 ,
the
.Tn HP
boot protocol daemon; used for booting
.Tn HP
workstations.
Passes
.Sy rbootd_flags .
.It Sy mopd
YES or NO.
Runs
.Xr mopd 8 ,
the
.Tn DEC
.Tn MOP
protocol daemon; used for booting
.Tn VAX
and other
.Tn DEC
machines.
Passes
.Sy mopd_flags .
.El
.Pp
.Tn NIS
(YP) daemons:
.Bl -tag -width net_interfaces
.It Sy ypbind
YES or NO.
Runs
.Xr ypbind 8 ,
which lets
.Tn NIS
(YP) clients use information from a
.Tn NIS
server.
Passes
.Sy ypbind_flags .
.It Sy ypserv
YES or NO.
Runs
.Xr ypserv 8 ,
the
.Tn NIS
(YP) server for distributing information from certain files in
.Pa /etc .
Passes
.Sy ypserv_flags .
The
.Ar -d
flag causes it to use DNS for lookups in
.Pa /etc/hosts
that fail.
.It Sy yppasswdd
YES or NO.
Runs
.Xr yppasswdd 8 ,
which allows remote
.Tn NIS
users to update password on master server.
Passes
.Sy yppasswdd_flags .
.El
.Pp
NFS daemons and parameters:
.Bl -tag -width net_interfaces
.It Sy nfs_client
YES or NO.
Runs
.Xr nfsiod 8
to increase performance of an NFS client host.
Passes
.Sy nfsiod_flags .
.It Sy nfs_server
YES or NO.
Sets up a host to be a NFS server by running
.Xr mountd 8
and
.Xr nfsd 8 ,
and passing
.Sy mountd_flags
and
.Sy nfsd_flags
to them, respectively.
.It Sy lockd
YES or NO.
Runs
.Xr rpc.lockd 8
if either
.Sy nfs_server
or
.Sy nfs_client
is (or both are) set to YES.
Passes
.Sy lockd_flags .
.It Sy statd
YES or NO.
Runs
.Xr rpc.statd 8 ,
a status monitoring daemon used when
.Xr rpc.lockd 8
is running, if either
.Sy nfs_server
or
.Sy nfs_client
is (or both are) set to YES.
Passes
.Sy statd_flags .
.It Sy amd
YES or NO.
Runs
.Xr amd 8 ,
the automounter daemon, which automatically mounts NFS file systems
whenever a file or directory within that filesystem is accessed.
Passes
.Sy amd_flags .
.It Sy amd_dir
The
.Xr amd 8
mount directory.
Used only if
.Sy amd
is set to YES.
.It Sy amd_master
The
.Xr amd 8
automounter master map.
Used only if
.Sy amd
is set to YES.
.El
.Pp
X Window System daemons:
.Bl -tag -width net_interfaces
.It Sy xfs
YES or NO.
Runs the
.Xr xfs 1
X11 font server, which supplies local X font files to X terminals.
.It Sy xdm
YES or NO.
Runs the
.Xr xdm 1
X display manager.
These X daemons are available only with the optional X distribution of
.Nx .
.El
.Pp
Other daemons:
.Bl -tag -width net_interfaces
.It Sy apmd
YES or NO.
Runs
.Xr apmd 8
and passes
.Sy apmd_flags .
.It Sy rwhod
YES or NO.
Runs
.Xr rwhod 8
to support the
.Xr rwho 1
and
.Xr ruptime 1
commands.
.It Sy kerberos
YES or NO.
Runs the kerberos server
.Xr kerberos 8
and the kerberos admininstration server,
.Xr kadmind 8 .
This should only be run on the kerberos master server.
Both servers implement version IV of the Kerberos protocol, not the
newer Kerberos version 5.
The kerberos server is only available with the domestic distribution of
.Nx .
.It Sy screenblank
YES or NO.
Runs
.Xr screenblank 1
and passes
.Sy screenblank_flags .
.El
.Sh FILES
.Pa /etc/rc.conf
.Sh SEE ALSO
.Xr boot 8 ,
.Xr rc 8
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.3 .
