NetBSD/src/share/man/man5/rc.conf.5
.\"	$NetBSD: rc.conf.5,v 1.3 1997/03/10 07:06:17 scottr Exp $
.\"
.\" Copyright (c) 1996 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Matthew R. Green for
.\"      the NetBSD Project.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 30, 1996
.Dt RC.CONF 5
.Os NetBSD 1.3
.Sh NAME
.Nm rc.conf
.Nd system startup configuration file
.Sh DESCRIPTION
The
.Nm
file specifies which services are enabled during system startup by
the startup script
.Pa /etc/rc .
The
.Nm
file is a shell script that is sourced by
.Pa /etc/rc
if it exists, meaning
that
.Nm
must be valid shell commands.
.Pp
Unless specified otherwise below, the variables of the from
daemon_flags are set to the flags to be passed to the program,
or "NO" if the program is not to be executed.
.Pp
The following variables are used:
.Bl -tag -width bootparamd_flags
.It Sy syslog_flags
Typically set to "" if system logging is to be performed by
.Xr syslogd 8 .
.It Sy routed_flags
Typically set to "-q" if
.Xr routed 8
is used, or "NO".
.It Sy mrouted_flags
Typically set to "" if
.Xr mrouted 8
is used, or "NO".
.It Sy rarpd_flags
Typically set to "-a" if
.Xr rarpd 8
is used, or "NO".
.It Sy bootparamd_flags
Typically set to "" if
.Xr bootparamd 8
is used, or "NO".
.It Sy rbootd_flags
Typically set to "" if
.Xr rbootd 8
is used, or "NO".
.It Sy sendmail_flags
Typically set to "-bd -q30" if
.Xr sendmail 8
is used, or "NO".
.It Sy named_flags
Typically set to "" if
.Xr named 8
is used, or "NO".
.It Sy dhcpd_flags
Typically set to "" if
.Xr dhcpd 8
is used, or "NO".
.It Sy timed_flags
Typically set to "" if
.Xr timed 8
is used, or "NO".
.It Sy inetd_flags
Typically set to "" or "-l" (for extra logging), if
.Xr inetd 8
is used, or "NO".
.It Sy lpd_flags
Typically set to "" or "-l" (for extra logging), if the printer daemon,
.Xr lpd 8 ,
is used, or "NO".
.It Sy ypserv_flags
Typically set to "-d" if your system is to be a YP server,
.Xr ypserv 8
is used, or "NO".
.It Sy yppasswdd_flags
Typically set to "" if your system is to be a YP password server,
.Xr yppasswdd 8
is used, or "NO".
.It Sy ypbind_flags
Typically set to "" if your system is to be a YP client,
.Xr ypbind 8
is used, or "NO".
.It Sy savecore_flags
Typically set to "" if your system is to check for kernel
crash dumps with
.Xr savecore 8 ,
or "NO".
.It Sy gated_flags
Typically set to "" if
.Xr gated 8
is used, or "NO".  Note that gated is not supplied with
.Nx .
.El
.Pp
.Bl -tag -width bootparamd_flags
The following variables turn services on or off:
.It Sy ipfilter
Set to YES if ip-filter will be run.  Typically reads
.Pa /etc/ipf.conf
at network boot time, before any interfaces are,
configured.
.It Sy lkm_init
Set to YES if
.Xr lkm 4
modules are to be loaded, from the file
.Pa /etc/lkm.conf ,
whose configuration is described in
.Xr lkm.conf 5 .
.It Sy rwhod
Set to "YES" if
.Xr rwhod 8
is to be run.
.It Sy nfs_server
Set to "YES" if the nfs server,
.Xr nfsd 8 ,
and
.Xr mountd 8
are to be run.  Additional variables available
.Sy nfs_server
enabled:
.Bl -tag -width mountd_flags
.It Sy mountd_flags
These are flags passed to
.Xr 8 mountd ,
if
.Sy nfs_server
is configured.
.It Sy nfsd_flags
These are flags passed to
.Xr 8 nfsd ,
if
.Sy nfs_server
is configured.  They default to ``-tun 4''.
.El
.It Sy nfs_client
Set to "YES" if the nfs client,
.Xr nfsiod 8 ,
is to be run.  Additional variables available
.Sy nfs_client
enabled:
.Bl -tag -width nfsiod_flags
.It Sy nfsiod_flags
These are flags passed to
.Xr nfsiod 8
if
.Sy nfs_client
is configured.  They default to ``-n 4''
.El
.It Sy statd_flags
Typically set to "" if your system is to run the status monitoring
daemon,
.Xr rpc.statd 8 ,
or "NO"; ignored if neither
.Sy nfs_server
nor
.Sy nfs_client
are set to "YES".
.It Sy lockd_flags
Typically set to "" if your system is to run the NFS locking
daemon,
.Xr rpc.lockd 8 ,
or "NO"; ignored if neither
.Sy nfs_server
nor
.Sy nfs_client
are set to "YES".
.It Sy kerberos
Set to "YES" if the kerberos server,
.Xr kerberos 8 , 
and the kerberos admininstration server,
.Xr kadmind 8 ,
are to be run.  This
should only be run on the kerberos master server.  Note that
the kerberos server is only available with the domestic distribution
of
.Nx .
.It Sy portmap
Set to "NO" if the port mapper,
.Xr portmap 8 ,
is not run.
.It Sy amd
Set to "YES" if automounter,
.Xr amd 8 ,
is to be run.  Additional variables available with
.Sy amd
enabled:
.Bl -tag -width amd_master
.It Sy amd_flags
The flags used for logging, etc, for
.Xr amd 8 .
Typically "-l syslog -x error,noinfo,nostats".
.It Sy amd_dir
The
.Xr amd 8 
mount directory.  Typically /amd.
.It Sy amd_master
The
.Xr amd 8 
automounter master map.
.El
.El
.Pp
The
.Sy portmap
keyword must be "YES" if any of the
.Sy ypserv_flags ,
.Sy yppasswdd_flags ,
.Sy ypbind_flags ,
.Sy bootparamd_flags ,
.Sy nfs_server ,
.Sy nfs_client
keywords are not "NO", as they all depend on the portmapper.
.Pp
Only one of the
.Sy routed_flags
or
.Sy gated_flags
keywords should be set.
.Sh FILES
.Pa /etc/rc.conf
.Sh SEE ALSO
.Xr boot 8
.Sh BUGS
The
.Sy kerberos_server
variable is actually used by the default
.Pa /etc/rc.local
script, not the
.Pa /etc/rc
script.
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.3 .
