NetBSD/src/share/man/man5/weekly.conf.5
.\"	$NetBSD: weekly.conf.5,v 1.4 1999/03/17 20:19:49 garbled Exp $
.\"
.\" Copyright (c) 1996 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 30, 1996
.Dt WEEKLY.CONF 5
.Os
.Sh NAME
.Nm weekly.conf
.Nd weekly maintenance configuration file
.Sh DESCRIPTION
The
.Nm
file specifies which of the standard
.Pa /etc/weekly
services are performed.  The
.Pa /etc/weekly
script is run, by default, every Saturday morning on a
.Nx
system.
.Pp
The variables described below can be set to "NO" to disable the test:
.Bl -tag -width check_network
.It Sy clean_uucp
This runs the weekly uucp clean script,
.Pa /usr/lib/uucp/clean.weekly .
.It Sy rebuild_locatedb
This rebuilds the locate database,
.Pa /var/db/locate.database ,
which must also exist, in order to be rebuilt.
.El
.Pp
.Sh FILES
.Pa /etc/weekly
.Pa /etc/weekly.conf
.Sh SEE ALSO
.Xr daily.conf 5 ,
.Xr monthly.conf 5
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.3 .
