NetBSD/src/share/man/man5/wscons.conf.5
.\"	$NetBSD: wscons.conf.5,v 1.4 2001/04/09 16:53:57 wiz Exp $
.\"
.\" Copyright notice
.\"
.\" The following requests are required for all man pages.
.Dd September 2, 2000
.Dt WSCONS.CONF 5
.Os
.Sh NAME
.Nm wscons.conf
.Nd workstation console config file
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
The
.Nm
file defines parameters regarding to the workstation console (wscons).
The file consists of lines starting with a keyword, and one or more arguments.
Empty lines and lines starting with a hash
.Pq Dq \&#
are ignored.

The following keywords and arguments are recognized:
.Pp
.Bl -tag -width keyboard -compact
.It Sy screen      idx scr emul
Add and configure virtual console number
.Sy idx
using a screen type of
.Sy scr
(e.g. 80x25) and a
.Sy emul
terminal emulation (e.g. vt100). See
.Xr wsconscfg 8
for further parameter description.
.Pp
.It Sy font        name width height enc file
Used to load a font via
.Xr wsfontload 8 .
.Sy name
gives a font name that can be used later,
.Sy width
can be used to specify the width of a font character in pixel,
.Sy height
is the same, just for the font characters' height.
.Sy enc
is used to declare the font's encoding, see the description on
.Xr wsfontload 8 's
.Fl e
option for more detail.
.Sy file
gives the absolute path to the font file.
See
.Xr wsfontload 8
for more information.
.Pp
.It Sy keyboard    <wsconscfg -k args>
The given argument(s) are handed off to
.Dq Li "wsconscfg -k"
for attaching and configuration of keyboards. See
.Xr wsconscfg 8
for more information.
.Pp
.It Sy mux         <wsconscfg -m args>
Used to attach and configure keyboard/mouse multiplexors. See
.Xr wsconscfg 8
for more information.
.Pp
.El
Command arguments can be specified as
.Dq -
which makes default values come into effect as described in the
documentation of the utilities.
.Sh FILES
.Bl -tag -width /etc/wscons.conf -compact
.It Pa /etc/wscons.conf
.El
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsconscfg 8 ,
.Xr wsfontload 8
