NetBSD/src/usr.sbin/dhcp/statmsg/statmsg.8
.\"	statmsg.8
.\"
.\" Copyright (c) 1998 The Internet Software Consortium.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of The Internet Software Consortium nor the names
.\"    of its contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INTERNET SOFTWARE CONSORTIUM AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE INTERNET SOFTWARE CONSORTIUM OR
.\" CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" This software has been written for the Internet Software Consortium
.\" by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
.\" Enterprises.  To learn more about the Internet Software Consortium,
.\" see ``http://www.isc.org/isc''.  To learn more about Vixie
.\" Enterprises, see ``http://www.vix.com''.
.TH statmsg 8
.SH NAME
statmsg - System configuration status Message generator
.SH SYNOPSIS
.B statmsg
.I message
.SH DESCRIPTION
Statmsg is an experimental and soon-to-be-deprecated mechanism for
distributing system status change messages.   It is currently used
only by the DHCP client.   Two message types are supported:
.I network-location-changed
and
.I release-current-dhcp-leases .
In order to use statmsg, sysconfd must be running.
.PP
The \fInetwork-location-changed\fR message instructs the DHCP client to
recheck all leases it has acquired.   This can be useful when a laptop
has been put to sleep, moved, and then reawakened.   The leased addresses
are not relinquished unless the network location actually has changed, so
it's safe to run this command at any time.
.PP
The \fIrelease-current-dhcp-leases\fR message instructs the DHCP client to
send a DHCPRELEASE message to the DHCP server for each lease it currently
holds, and to then unconfigure the IP address of each such lease.   The
client does not attempt to reacquire a lease - if that behaviour is desired,
the \fInetwork-location-changed\fR message can be sent after the
\fIrelease-current-dhcp-leases\fI message.
.SH SEE ALSO
dhclient(8), sysconfd(8)
.SH AUTHOR
.B statmsg(8)
has been written for the Internet Software Consortium
by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
Enterprises.  To learn more about the Internet Software Consortium,
see
.B http://www.vix.com/isc.
To learn more about Vixie Enterprises, see
.B http://www.vix.com.
