NetBSD/src/share/examples/refuse/pcifs/pcifs.8
.\" $NetBSD: pcifs.8,v 1.1.10.1 2008/06/02 13:21:24 mjf Exp $
.\"
.\" Copyright © 2007 Alistair Crooks.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 16, 2007
.Dt PCIFS 8
.Os
.Sh NAME
.Nm pcifs
.Nd refuse-based virtual file system to display devices on PCI bus
.Sh SYNOPSIS
.Nm
.Op Fl v
.Op Fl b Ar bus
.Ar mount_point
.Sh DESCRIPTION
The
.Nm
utility can be used to mount a virtual file system which
under the
mount point, showing the layout
of devices on the PCI bus.
.Pp
The following arguments can be used:
.Bl -tag -width Ds
.It Fl b Ar bus
Use the numeric bus number from the argument for
the PCI bus number to list.
.It Fl v
Produce verbose output
.El
.Pp
The
.Nm
utility makes use of the
.Xr virtdir 3
virtual directory routines.
.Pp
The
.Xr refuse 3
library is used to provide the file system features.
.Pp
The mandatory parameter is
the local mount
point.
.Pp
The
.Xr pcictl 8
utility is used to retrieve the information on
PCI devices.
.Sh SEE ALSO
.Xr puffs 3 ,
.Xr refuse 3 ,
.Xr virtdir 3 ,
.Xr pcictl 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 5.0 .
.Sh AUTHORS
.An Alistair Crooks Aq agc@NetBSD.org
