NetBSD/src/usr.bin/fdformat/fdformat.1
.\"	$NetBSD: fdformat.1,v 1.6 1997/10/21 00:14:45 thorpej Exp $
.\"
.\" Copyright (c) 1996, 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by John Kohl.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 28, 1996
.Dt fdformat 1
.Os NetBSD
.Sh NAME
.Nm fdformat
.Nd format a floppy diskette
.Sh SYNOPSIS
.Nm
.Op Fl f Ar device
.Op Fl t Ar type
.Op Fl n
.Op Fl B Ar nbps
.Op Fl S Ar nspt
.Op Fl T Ar ntrk
.Op Fl C Ar ncyl
.Op Fl P Ar stepspercyl
.Op Fl G Ar gaplen
.Op Fl F Ar fillbyte
.Op Fl X Ar xfer_rate
.Op Fl I Ar interleave
.Sh DESCRIPTION
The
.Nm
utility formats a floppy diskette.
With no arguments, it formats the default floppy device with the default
density parameters (as provided by the floppy diskette device driver).
.Pp
As the each track of the floppy diskette is formatted, it is read to
verify the format was successful.  A status is printed for each track.
.Em F
indicates a track was formatted.
.Em V
indicates the track was successfully verified.
.Em E
indicates an error in formatting or verifying a track.
.Pp
Available command-line flags are:
.Bl -tag -width indent -compact
.It Fl f Ar device
Format the floppy using
.Ar device
instead of the default
.Pa /dev/rfd0a .
.It Fl t Ar type
Format the floppy using parameters for the diskette named
.Ar type
in 
.Pa /etc/floppytab
instead of the device default parameters.
.It Fl n
Do not verify each track as it is read.
.It Fl B Ar nbps
Set the number of bytes per sector for the formatted diskette.
.It Fl S Ar nspt
Set the number of sectors per track for the formatted diskette.
.It Fl T Ar ntrk
Set the number of tracks (heads) per cylinder for the formatted diskette.
.It Fl C Ar ncyl
Set the number of cylinders for the formatted diskette.
.It Fl P Ar stepspercyl
Set the number of motor steps per cylinder for the formatted diskette.
.It Fl G Ar gaplen
Set the sector gap length for the formatted diskette.
.It Fl F Ar fillbyte
Set the fill byte for the formatted diskette.
.It Fl X Ar xfer_rate
Set the bit transfer rate for the formatted diskette.
.It Fl I Ar interleave
Set the interleave factor for the formatted diskette.
.El
.Sh BUGS
Some floppy drive units have physical 
diskette format sensors which automatically select a diskette
density for reading.  Such drives can format at alternate densities, but
they cannot successfully verify the formatted diskette except at the
diskette's normal density.
.Sh SEE ALSO
.Xr fdc 4
(i386 port).
.Sh HISTORY
The
.Nm
utility appeared in NetBSD-1.3.
