NetBSD/src/sbin/fsck_v7fs/fsck_v7fs.8
.\"	$NetBSD: fsck_v7fs.8,v 1.3 2016/09/11 04:19:52 sevan Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by UCHIYAMA Yasushi.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 11, 2016
.Dt FSCK_V7FS 8
.Os
.Sh NAME
.Nm fsck_v7fs
.Nd 7th Edition(V7) filesystem consistency checker
.Sh SYNOPSIS
.Nm
.Op Fl FnPpy
.Op Fl B Ar byteorder
.Op Fl o Ar options
.Ar filesystem ...
.Sh DESCRIPTION
The
.Nm
utility verifies and repairs
.Tn Version 7
file systems.
.Pp
The following flags are interpreted by
.Nm .
.Bl -tag -width XBXbyteorderXX -offset indent
.It Fl B Ar byteorder
Convert the file system metadata to
.Ar byteorder
byte order if needed.
Valid byte orders are
.Dq be ,
.Dq le ,
and
.Dq pdp .
.It Fl F
Check file system inside a regular file.
.It Fl n
Do not correct file system.
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
The following options are available:
.Bl -tag -width data
.It Cm data
Check data block duplication.
.It Cm free
Check free block duplication.
.El
.It Fl P
Display a progress meter for the file system check.
.It Fl p
Preen mode.
See
.Xr fsck 8 .
.It Fl y
Causes
.Nm
to assume yes as the answer to all operator questions.
.El
.Sh SEE ALSO
.Xr fsck 8 ,
.Xr mount_v7fs 8 ,
.Xr newfs_v7fs 8
.Sh HISTORY
A
.Nm
utility appeared in
.Nx 6.0 .
.Sh AUTHORS
.Nm
was written by
.An UCHIYAMA Yasushi Aq Mt uch@NetBSD.org .
.Sh BUGS
.Nm
is still under construction.
