NetBSD/src/share/man/man8/man8.next68k/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.next68k/MAKEDEV and
.\" *** src/share/man/man8/man8.next68k/MAKEDEV.8.template
.\" *** 
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\"	$NetBSD: MAKEDEV.8,v 1.4 2000/11/07 06:43:28 lukem Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)makedev.8	8.1 (Berkeley) 6/5/93
.\"
.Dd September 21, 1999
.Dt MAKEDEV 8 next68k
.Os
.Sh NAME
.Nm MAKEDEV ,
.Nm makedev
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm "" ,
found in the
.Pa /dev
directory, is used to create
the common special
files.
.\" See
.\" .Xr special 8
.\" for a more complete discussion of special files.
.Pp
.Nm
takes any number of device names as arguments,
where the names are the common abbreviation for
the device.  There are several special device names:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
A smattering--at least one of each except fd* (unimp.) and ch*
.It Ar std
Standard devices
.It Ar fd
File descriptor device nodes
.It Ar local
Configuration specific devices
.It Ar raminst
For RAM disk install
.El
.Pp
The next68k port supports the following devices.
Where a device name is followed by a hash
sign ("#"), the hash sign must be replaced
by a unit number.
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar st#
Scsi tapes, see
.Xr st 4 
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar fd#
Floppy disk drives (3 1/2") (unimp.)
. It Ar sd#
SCSI disks, see
.Xr sd 4 
. It Ar cd#
SCSI compact discs, see
.Xr cd 4 
. It Ar vnd#
Vnode pseudo-disks, see
.Xr vnd 4 
. It Ar ccd#
Concatenated disk driver, see
.Xr ccd 4 
. It Ar raid#
RAIDframe disk driver, see
.Xr raid 4 
. It Ar md#
Memory pseudo-disk devices, see
.Xr md 4 
. El
.It Terminal ports:
. Bl -tag -width 0123456789 -compact
. It Ar tty#
Standard built-in serial ports (2), see
.Xr tty 4 
. It Ar ttyE?
Workstation console (``wscons'') glass-tty emulators
. El
.It Pointing devices:
. Bl -tag -width 0123456789 -compact
. It Ar wsmouse#
Wscons mouse events, see
.Xr wsmouse 4 
. El
.It Keyboard devices:
. Bl -tag -width 0123456789 -compact
. It Ar wskbd#
Wscons keyboard events, see
.Xr wskbd 4 
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr pty 4 
. El
.It Graphics devices:
. Bl -tag -width 0123456789 -compact
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar tun#
Network tunnel driver, see
.Xr tun 4 
. It Ar bpf#
Packet filter, see
.Xr bpf 4 
. It Ar lkm
Loadable kernel modules interface, see
.Xr lkm 4 
. It Ar ipl
IP filter
. It Ar random
Random number generator
. It Ar scsibus#
SCSI busses
. It Ar ss#
SCSI scanner, see
.Xr ss 4 
. It Ar uk#
SCSI unknown, see
.Xr uk 4 
. It Ar ch#
SCSI changer, see
.Xr ch 4 
. El
.El
.Pp
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.\" .Xr special 8
