NetBSD/src/usr.sbin/pkg_install/audit-packages/audit-packages.conf.5
.\" $NetBSD: audit-packages.conf.5,v 1.1 2007/07/14 20:03:42 adrianp Exp $
.\"
.\" Copyright (c) 2007 Adrian Portelli.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Adrian Portelli
.\"      for the NetBSD project.
.\" 4. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
.\" OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
.\" GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
.\" WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 07, 2007
.Os
.Dt audit-packages.conf 5
.Sh NAME
.Nm audit-packages.conf
.Nd audit-packages and download-vulnerability-list configuration file.
.Sh DESCRIPTION
The
.Nm
file contains the configuration information for
.Xr download-vulnerability-list 8
and
.Xr audit-packages 8 .
.Pp
These variables can be defined in the
.Xr audit-packages.conf 8
file.
.Pp
.Bl -tag -width COMPRESS_TYPE
.It Ev GPG
The full path to the location of the binary used to verify the signature
on the downloaded 
.Pa pkg-vulnerabilities 
file.  Currently only GnuPG is supported.  
.Pp
The default is "/usr/pkg/bin/gpg".
.It Ev PKGVULNDIR
Specifies the directory containing the
.Pa pkg-vulnerabilities
file.  
.Pp
The default is "/var/db/pkg".
.It Ev COMPRESS_TYPE
Specifies which type of compressed
.Pa pkg-vulnerabilities 
file to download.  You can also specify COMPRESS_TYPE="" to use
and uncompressed version of the file.  If you change this from the 
default you must specify a COMPRESS_TOOL.  The 
currently accepted options are gzip and bzip2.
.It Ev COMPRESS_TOOL
The full path to the location of the binary used to 
decompress the downloaded 
.Pa pkg-vulnerabilities 
file.  
.Pp
The default is "/usr/bin/gzcat".
.It Ev FETCH_CMD
Specifies the client used to download the
.Pa pkg-vulnerabilities 
file.  Currently known tools include curl, ftp, wget and fetch.
.Pp
The default is "/usr/bin/ftp". 
.It Ev FETCH_ARGS
Specifies optional arguments for the client used to download the
.Pa pkg-vulnerabilities 
file.
.It Ev FETCH_PROTO
Specifies the protocol to use when fetching the
.Pa pkg-vulnerabilities
file.
Currently supports only http and ftp.
.Pp
The default is "ftp".
.It Ev IGNORE_URLS
A list of vulnerability URLs to be ignored.
This allows for ignoring certain URLs that are attached to a
vulnerability.
.El
.Sh FILES
/etc/audit-packages.conf
.Sh SEE ALSO
.Xr pkg_info 1 ,
.Xr mk.conf 5 ,
.Xr packages 7 ,
.Xr audit-packages 8 and
.%T "Documentation on the NetBSD Package System"
.Sh HISTORY
The
.Nm
and
.Nm download-vulnerability-list
commands were originally implemented and added to
.Nx Ap s
pkgsrc by
.An Alistair Crooks
on September 19, 2000.  During April 2007 
.Nm 
was re-written by Adrian Portelli
and support was added for compressed files and checking signatures on downloaded
files.
The original idea came from Roland Dowdeswell and Bill Sommerfeld.
