NetBSD/src/sbin/mount_chfs/mount_chfs.8
.\" $NetBSD: mount_chfs.8,v 1.4 2016/09/12 00:38:42 sevan Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 12, 2016
.Dt MOUNT_CHFS 8
.Os
.Sh NAME
.Nm mount_chfs
.Nd mount a CHFS flash file system
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
Mounts a flash file system from a
.Xr flash 4
device.
CHFS file systems can be only mounted from flash devices.
For regular block devices like SSD drives or USB drives,
please use a regular file system.
The file system will be created during the first mount.
CHFS stands for Chip File System.
.Sh EXAMPLES
.Dl mount_chfs /dev/flash0 /mnt
.Sh SEE ALSO
.Xr flash 4 ,
.Xr fstab 5 ,
.Xr mount 8 ,
.Xr flash 9
.Sh HISTORY
A
.Nm
utility appeared in
.Nx 6.0 .
CHFS was originally called ChewieFS during development.
The name was changed to avoid legal issues and to have a more
neutral name.
.Sh AUTHORS
CHFS was developed at the
.An Department of Software Engineering, University of Szeged, Hungary.
.Sh BUGS
CHFS has a few known bugs as of 2011.
Writing the FS full can cause problems.
Truncating a file and growing it again can cause the new bytes
not having all zeroes, but filled with the old content instead.
