NetBSD/src/usr.sbin/dhcp/relay/dhcrelay.8
.\"	dhcrelay.8
.\"
.\" Copyright (c) 1997 The Internet Software Consortium.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of The Internet Software Consortium nor the names
.\"    of its contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE INTERNET SOFTWARE CONSORTIUM AND
.\" CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
.\" INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE INTERNET SOFTWARE CONSORTIUM OR
.\" CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" This software has been written for the Internet Software Consortium
.\" by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
.\" Enterprises.  To learn more about the Internet Software Consortium,
.\" see ``http://www.isc.org/isc''.  To learn more about Vixie
.\" Enterprises, see ``http://www.vix.com''.
.TH dhcrelay 8
.SH NAME
dhcpd - Dynamic Host Configuration Protocol Relay Agent
.SH SYNOPSIS
.B dhcrelay
[
.B -p
.I port
]
[
.B -d
]
[
.B -i
.I if0
[
.B ...
.B -i
.I ifN
]
]
.I server0
[
.I ...serverN
]
.SH DESCRIPTION
The Internet Software Consortium DHCP Relay Agent, dhcrelay, provides a
means for relaying DHCP and BOOTP requests from a subnet to which
no DHCP server is directly to one or more DHCP servers on other
subnets.
.SH OPERATION
.PP
The DHCP Relay Agent listens for DHCP requests on all interfaces
attached to a host, or only on those interfaces specified on the
command line with the
.I -i
flag.   When a query is received, it forwards it to the list of DHCP
servers specified on the command line.   When a reply is received, it
is broadcast or unicast on the network from whence the original
request came.
.PP
It is possible to specify a set of interfaces on which dhcrelay will
listen, so that if dhcrelay is connected through one interface to a
network on which there is no DHCP server, but is connected on another
interface to a network on which there is a DHCP server, it will not
relay DHCP and BOOTP requests from the network on which the server
exists to that server.   This is an imperfect solution.
.SH COMMAND LINE
.PP
The names of the network interfaces that dhcrelay should attempt to
configure may be specified on the command line using the
.I -i
option.  If no interface names
are specified on the command line dhcrelay will identify all network
interfaces, elimininating non-broadcast interfaces if possible, and
attempt to configure each interface.
.PP
If dhcrelay should listen and transmit on a port other than the
standard (port 67), the
.B -p
flag may used.  It should be followed by the udp port number that
dhcrelay should use.  This is mostly useful for debugging purposes.
.PP
Dhclient will normally run in the foreground until it has configured
an interface, and then will revert to running in the background.
To run force dhcrelay to always run as a foreground process, the
.B -d
flag should be specified.  This is useful when running dhcrelay under
a debugger, or when running it out of inittab on System V systems.
.PP
The name of at least one DHCP server to which DHCP and BOOTP requests
should be relayed must be specified on the command line.
.PP
.SH SEE ALSO
dhclient(8), dhcpd(8), dhcrelay.conf(5), dhcrelay.leases(5)
.SH AUTHOR
.B dhcrelay(8)
has been written for the Internet Software Consortium
by Ted Lemon <mellon@fugue.com> in cooperation with Vixie
Enterprises.  To learn more about the Internet Software Consortium,
see
.B http://www.vix.com/isc.
To learn more about Vixie
Enterprises, see
.B http://www.vix.com.
.PP
