NetBSD/src/usr.bin/audio/ctl/audioctl.1
.\" $NetBSD: audioctl.1,v 1.26 2025/06/03 19:31:25 kre Exp $
.\"
.\" Copyright (c) 1997, 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson and Charles M. Hannum
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 3, 2025
.Dt AUDIOCTL 1
.Os
.Sh NAME
.Nm audioctl
.Nd control software audio format
.Sh SYNOPSIS
.Nm
.Op Fl n
.Op Fl d Ar device
.Fl a
.Nm
.Op Fl n
.Op Fl d Ar device
.Ar name ...
.Nm
.Op Fl n
.Op Fl d Ar device
.Fl w
.Ar name=value ...
.Sh DESCRIPTION
The
.Nm
command displays or sets the parameters that determine the playback and
recording format for software using an audio device.
It is most useful when the full
.Xr audio 4
API is not available, e.g. when playing or recording raw audio data from a
.Xr sh 1
script, or from the command line.
It does not control the underlying hardware format, which can be
changed with
.Xr audiocfg 1 .
.Pp
The variables that can be inspected and changed with
.Nm
are normally per-application and are reset when a
.Pa /dev/audioX
device is opened.
This can be circumvented by using
.Pa /dev/soundX
instead, which retains global state.
.Pp
If a list of variables is present on the command line, then
.Nm
prints the current value of those variables for the specified device.
If the
.Fl a
flag is specified, all variables for the device are printed.
If the
.Fl w
flag is specified
.Nm
attempts to set the specified variables to the given values.
.Pp
The
.Fl d
flag can be used to give an alternative audio control device.
The default can be set using the
.Ev AUDIOCTLDEVICE
variable in the environment,
or set for the system using
.Xr audiocfg 1 ,
or if neither of those applies is
.Pa /dev/audioctl0 .
.Pp
The
.Fl n
flag suppresses printing of the variable name.
.Sh ENVIRONMENT
.Bl -tag -width AUDIOCTLDEVICE
.It Ev AUDIOCTLDEVICE
the audio control device to use,
unless overridden by
.Fl d .
.El
.Sh FILES
.Bl -tag -width /dev/audioctl0 -compact
.It Pa /dev/audio
a symlink indicating the default audio device
.It Pa /dev/audio0
state resetting audio I/O device
(others: audio1, audio2, ...)
.It Pa /dev/sound
a symlink indicating the default sound device
.It Pa /dev/sound0
state retaining audio I/O device
(also sound1, sound2, ...)
.It Pa /dev/audioctl
a symlink indicating the default audio control device
.It Pa /dev/audioctl0
audio control device
(and audioctl1, audioctl2, ...)
.El
.Pp
The
.Pa /dev/audioN ,
.Pa /dev/soundN ,
and
.Pa /dev/audioctlN ,
devices with the same value of
.Pa N
refer to the same audio stream.
Different values for
.Pa N
refer to different audio streams,
which may use different parameters.
.Sh EXAMPLES
To set the playing sampling rate to 11025, you can use
.Dl audioctl -w play.sample_rate=11025
To set all of the play parameters for CD-quality audio, you can use
.Dl audioctl -w play=44100,2,16,slinear_le
.Sh COMPATIBILITY
The old
.Fl f
flag is still supported.
This support will be removed eventually.
.Sh SEE ALSO
.Xr audiocfg 1 ,
.Xr audioplay 1 ,
.Xr audiorecord 1 ,
.Xr mixerctl 1 ,
.Xr audio 4 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.3 .
.Sh CAVEATS
Since the parameters controlled by
.Nm
are global, they can be changed unexpectedly if another application
uses the same audio device.
.Pp
It is always preferable to use
.Dv AUDIO_SETINFO
on a per-process
.Pa /dev/audioX
device, if the
.Xr audio 4
ioctls are available in the programming environment.
Similarly,
.Xr audioplay 1
and
.Xr audiorecord 1
are more safe for use in scripting.
