NetBSD/src/share/man/man4/man4.x68k/mfp.4
.\"	$NetBSD: mfp.4,v 1.1 1999/03/17 12:27:22 minoura Exp $
.\"
.\" Copyright (c) 1998 MINOURA Makoto
.\" Copyright (c) 1998 NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"    This product includes software developed by Minoura Makoto.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd Mar. 17, 1999
.Os
.Dt MFP 4 x68k
.Sh NAME
.Nm mfp
.Nd "X68K Multi-function Periferals"
.Sh SYNOPSIS
.Cd mfp0 at intio0 addr 0xe88000 size 0x2000 intr 64
.Sh DESCRIPTION 
.Nm
drives Motorola MC68901 MFP (Multi-function Periferal).
.Nm
driver is always required to run the NetBSD/x68k kernel,
because it is connected to importand devices such as
the display controler, and provides fundamental functionalities
like the system clock tick and interrupt controler.
Since 
.Nm
provides many functionarities, most of the jobs as a
device driver is done by its child drivers such as
.Xr kbd 4
and
.Xr clock 4 .
.Nm
driver itself only provides the common way to access its
registers and a few utility functions for other non-child drivers.
.Pp
.Sh BUGS
Machine-dependent part and machine-independent part should be splitted.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr kbd 4 ,
.Xr clock 4 .
