NetBSD/src/share/man/man4/man4.x68k/powsw.4
.\" $NetBSD: powsw.4,v 1.1.4.2 2012/04/17 00:05:47 yamt Exp $
.\"
.\" Copyright (c) 2011 Tetsuya Isaki. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 27, 2011
.Dt POWSW 4 x68k
.Os
.Sh NAME
.Nm powsw
.Nd x68k power switch handler
.Sh SYNOPSIS
.Cd powsw0 at mfp0
.Cd powsw1 at mfp0
.Sh DESCRIPTION
The
.Nm
driver monitors x68k's power switch,
and is made as interface to
.Xr sysmon_pswitch 9 .
.Pp
.Nm powsw0
monitors a front switch.
.Nm powsw1
monitors an external power switch (EXPWON signal in I/O slot).
.Sh SEE ALSO
.Xr powerd 8
.Sh HISTORY
.Nm
appeared in
.Nx 6.0 .
.Sh BUGS
I have no idea for
.Nm powsw2
(rtc alarm).
