NetBSD/src/usr.sbin/iwictl/iwictl.8
.\" $NetBSD: iwictl.8,v 1.8.26.1 2009/05/13 19:20:26 jym Exp $
.\"
.\" Copyright (c) 2004, 2005
.\"	Damien Bergamini <damien.bergamini@free.fr>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice unmodified, this list of conditions, and the following
.\"    disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 9, 2006
.Dt IWICTL 8
.Os
.Sh NAME
.Nm iwictl
.Nd configure Intel(R) PRO/Wireless 2200BG/2915ABG network adapters
.Sh SYNOPSIS
.Nm
.Op Fl i
.Ar iface
.Nm
.Op Fl i
.Ar iface Fl r
.Sh DESCRIPTION
The
.Nm
utility controls the operation of Intel(R) PRO/Wireless 2200BG/2915ABG
networking devices via the
.Xr iwi 4
driver.
.Pp
You should not use this program to configure IEEE 802.11 parameters.
Use
.Xr ifconfig 8
instead.
.Sh OPTIONS
The options are as follows:
.Bl -tag -width indent
.It Fl i Ar iface
Displays adapter's internal statistics.
Firmware binary images can be found in the
.Pa pkgsrc/sysutils/iwi-firmware
package.
.It Fl i Ar iface Fl r
Displays the radio transmitter state (on or off).
.El
.Sh FILES
The firmware is not shipped with
.Nx .
It can be obtained via installing the
.Pa pkgsrc/sysutils/iwi-firmware
package and is loaded automatically by the kernel once installed.
.Sh SEE ALSO
.Xr iwi 4 ,
.Xr ifconfig 8
.Pa pkgsrc/sysutils/iwi-firmware
.Sh AUTHORS
The
.Nm
utility and this man page were written by
.An Damien Bergamini Aq damien.bergamini@free.fr .
.Sh CAVEATS
Monitor mode requires firmware version 1.0.4 (included in the
.Pa pkgsrc/sysutils/iwi-firmware
package version 2.3) or newer.
