NetBSD/src/share/man/man8/man8.vax/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.vax/MAKEDEV and
.\" *** src/share/man/man8/man8.vax/MAKEDEV.8.template
.\" *** 
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\"	$NetBSD: MAKEDEV.8,v 1.8 2000/05/02 00:31:01 hubertf Exp $
.\"
.\" Copyright (c) 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	8.1 (Berkeley) 6/5/93
.\"
.Dd June 5, 1993
.Dt MAKEDEV 8 vax
.Os
.Sh NAME
.Nm MAKEDEV ,
.Nm makedev
.Nd create system and device special files
.Sh SYNOPSIS
MAKEDEV name ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the ``/dev'' directory, is used to create the common special
files.
.\" See
.\" .IR special (8)
.\" for a more complete discussion of special files.
.Pp
.Pa MAKEDEV
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are several special devices:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar std
Standard devices
.It Ar local
Configuration specific devices
.It Ar all
Create a reasonable amount of all files
.El
.Pp
The VAX supports the following devices.
Where a device name is followed by a hash sign (``#''), the hash sign
must be replaced by a unit number.
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar ht#
Massbus tm03 & tu??, see
.Xr ht 4 
. It Ar tm#
Unibus tm11 & te10 emulations (e.g. Emulex tc-11), see
.Xr tm 4 
. It Ar mt#
MSCP tapes (e.g. TU81, TK50), see
.Xr mt 4 
. It Ar ts#
Unibus ts11, see
.Xr ts 4 
. It Ar ut#
Unibus tu45 emulations (e.g.si 9700), see
.Xr ut 4 
. It Ar uu#
Tu58 cassettes on dl11 controller, see
.Xr uu 4 
. It Ar st#
SCSI tapes, see
.Xr st 4 
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar hp#
Massbus rm??, see
.Xr hp 4 
. It Ar hk#
Unibus rk06 and rk07, see
.Xr hk 4 
. It Ar up#
Other unibus devices (e.g. on Emulex sc-21v controller), see
.Xr up 4 
. It Ar ra#
MSCP disks (ra??, rd??)
. It Ar rx#
MSCP floppy disk (rx33/50/...), see
.Xr rx 4 
. It Ar rl#
Unibus rl02, see
.Xr rl 4 
. It Ar rb#
730 idc w/ rb80 and/or rb02
. It Ar ccd#
``concatenated'' pseudo-disks, see
.Xr ccd 4 
. It Ar raid#
RAIDframe disk driver, see
.Xr raid 4 
. It Ar vnd#
``file'' pseudo-disks, see
.Xr vnd 4 
. It Ar rd#
HDC9224 rd disks on VS2000
. It Ar sd#
SCSI disks, see
.Xr sd 4 
. It Ar cd#
SCSI CD-ROM, see
.Xr cd 4 
. It Ar md#
Memory pseudo-disk devices, see
.Xr md 4 
. El
.It Terminal multiplexors:
. Bl -tag -width 0123456789 -compact
. It Ar dz#
Unibus dz11 and dz32, see
.Xr dz 4 
. It Ar dh#
Unibus dh11 and emulations (e.g. Able dmax, Emulex cs-11), see
.Xr dh 4 
. It Ar dmf#
Unibus dmf32, see
.Xr dmf 4 
. It Ar dhu#
Unibus dhu11, see
.Xr dhu 4 
. It Ar dmz#
Unibus dmz32, see
.Xr dmz 4 
. It Ar dl#
Unibus dl11, see
.Xr dl 4 
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr pty 4 
. El
.It Printers:
. Bl -tag -width 0123456789 -compact
. It Ar ct#
Unibus parallel interface to CAT typesetter, see
.Xr ct 4 
. It Ar lp#
Unibus lp11 parallel interface, see
.Xr lp 4 
. It Ar va#
Unibus varian parallel interface, see
.Xr va 4 
. It Ar vp#
Unibus versatec parallel interface, see
.Xr vp 4 
. El
.It Call units:
. Bl -tag -width 0123456789 -compact
. It Ar dn#
Unibus dn11 and emulations (e.g. Able Quadracall), see
.Xr dn 4 
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar ik#
Unibus interface to ikonas frame buffer, see
.Xr ik 4 
. It Ar ps#
Unibus interface to e&s picture system 2, see
.Xr ps 4 
. It Ar ad#
Unibus interface to data translation a/d converter, see
.Xr ad 4 
. It Ar np#
Unibus ethernet co-processor interface, for downloading., see
.Xr np 4 
. It Ar qv#
Qvss (microvax) display
. It Ar ttyv0
Qvss (microvax) display reserved pty
. It Ar lkm
Loadable kernel modules, see
.Xr lkm 4 
. It Ar bpf#
Berkeley packet filter, see
.Xr bpf 4 
. It Ar tun#
Network tunnel device, see
.Xr tun 4 
. It Ar scsibus#
SCSI busses,
.Xr scsictl 8 ,
.Xr scsi 4 
. It Ar ss#
SCSI scanner, see
.Xr ss 4 
. It Ar uk#
SCSI unknown, see
.Xr uk 4 
. It Ar ch#
SCSI changer, see
.Xr ch 4 
. It Ar random
Random number generator
. El
.El
.Pp
.Sh FILES
/dev		The special file directory.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.\" .IR special (8)
