NetBSD/src/usr.bin/elfstrip/elfstrip.1
.\" Copyright (c) 1989, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)strip.1	6.6 (Berkeley) 5/26/91
.\"	$Id: elfstrip.1,v 1.1 1996/09/29 21:53:14 jonathan Exp $
.\"
.Dd September 30, 1996
.Dt ELFSTRIP 1
.Os
.Sh NAME
.Nm elfstrip
.Nd remove unnecessary information from ELF executable files
.Sh SYNOPSIS
.Nm elfstrip
.Ar file ...
.Sh DESCRIPTION
The
.Nm elfstrip
utility
deletes the relocation information and symbol table used by
assemblers, loaders and debuggers.
This significantly
decreases the size of the installed binaries and saves disk space.
.Pp
.Nm Elfstrip
is more aggressive about stripping unecessary information
than the GNU equivalent.  The
GNU binutils
.Xr size 1
utility uses the "unecessary" information and  may not be able to
find the size of executable segments of stripped files.
The strippped files are still correctly executed.
.Pp
.Nm Strip
exits 0 on success and 1 if an error occurred.
.Sh SEE ALSO
.Xr cc 1 ,
.Xr ld 1 ,
.Xr elf 5
.Sh BUGS
 The following
.Xr strip 1
options are not supported:
.Bl -tag -width Ds
.It Fl d
Delete only debugging and empty symbols.
.It Fl x
Delete only debugging, compiler identification, and local symbols.
.El
.Sh HISTORY
A
.Xr strip 1
command appeared in
.At v6 .
This
.Nm elfstrip
command first appeared in
.Nx 1.1 .
