NetBSD/src/usr.sbin/ypserv/ypinit/ypinit.8
.\"	$NetBSD: ypinit.8,v 1.6 1998/06/08 06:29:25 lukem Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundataion
.\" by Curt J. Sampson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 4, 1997
.Dt YPINIT 8
.Os
.Sh NAME
.Nm ypinit
.Nd initialise YP system
.Sh SYNOPSIS
.Nm
.Fl c
.Op Ar domainname
.Nm ypinit
.Fl m
.Op Ar domainname
.Nm ypinit
.Fl s
.Ar master_server
.Op Ar domainname
.Sh DESCRIPTION
.Nm
initialises the files and directories that are required for a
.Tn YP
client or server.
.Pp
If
.Ar domainname
isn't specified, the default domain (as returned by
.Xr domainname 1 )
is used.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl c
Create a
.Tn YP
client.
Initialises
.Pa /var/yp/binding/<domain>.ypservers
to contain a list of ypservers for
.Xr ypbind 8
to connect to.
.It Fl m
Create a master
.Tn YP
server.
Generates map data from local files
.Pa ( /etc/master.passwd ,
.Pa /etc/group ,
etc.).
.It Fl s Ar master_server
Create a slave server.
Downloads the maps from
.Ar master_server ,
which should be the active master
.Tn YP
server.
.El
.Pp
To rebuild or refresh the maps for the
.Tn YP
domain <domain>, change to the
.Pa /var/yp/<domain>
directory and run
.Ic make .
.Sh FILES
.Bl -tag -width /var/yp/ypserv.log -compact
.It Pa /var/yp
master
.Tn YP
directory; contains the template makefiles.
.It Pa /var/yp/<domain>
directory to store
.Tn YP
maps for <domain>.
.It Pa /var/yp/binding/<domain>.ypservers
list of
.Tn YP
servers to bind to.
.El
.Sh SEE ALSO
.Xr domainname 1 ,
.Xr makedbm 8 ,
.Xr stdhosts 8 ,
.Xr stdethers 8 ,
.Xr make 1 ,
.Xr mknetid 8 ,
.Xr yp 8 ,
.Xr ypbind 8 ,
.Xr yppush 8 ,
.Xr ypserv 8
.Sh AUTHOR
Originally written by Mats O Jansson <moj@stacken.kth.se>.
Modified by Jason R. Thorpe <thorpej@NetBSD.ORG>
