NetBSD/src/usr.sbin/ypserv/ypinit/ypinit.8
.\"	$NetBSD: ypinit.8,v 1.1 1997/01/05 09:49:41 cjs Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundataion
.\" by Curt J. Sampson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 4, 1997
.Dt YPINIT 8
.Os
.Sh NAME
.Nm ypinit
.Nd initialise YP system
.Sh SYNOPSIS
.Nm ypinit
.Fl m
.Op Ar domainname
.Nm ypinit
.Fl s
.Ar master_server
.Op Ar domainname
.Sh DESCRIPTION
.Nm Ypinit
initialises the directories that hold the maps for a YP domain on a
YP server.
.Pp
A master server, created with the
.Fl m
option, generates map data from local files
.Pa ( /etc/master.passwd ,
.Pa /etc/group ,
etc.).
A slave server, created with the
.Fl s
option, downloads the maps from
.Ar master_server .
.Pp
To rebuild or refresh the maps, change to the
.Pa /var/yp
directory and run
.Ic make .
.Sh FILES
.Bl -tag -width /var/yp/ypserv.log -compact
.It Pa /var/yp
.El
.Sh SEE ALSO
.Xr yp 8 ,
.Xr ypserv 8
.Sh AUTHOR
Originally written by Mats O Jansson <moj@stacken.kth.se>.
Modified by Jason R. Thorpe <thorpej@NetBSD.ORG>
