NetBSD/src/usr.sbin/ypbind/ypbind.8
.\"	$NetBSD: ypbind.8,v 1.6 1997/07/07 02:27:06 lukem Exp $
.\"
.\" Copyright (c) 1996 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 7, 1997
.Dt YPBIND 8
.Os
.Sh NAME
.Nm ypbind
.Nd create and maintain a binding to a YP server
.Sh SYNOPSIS
.Nm
.Op Fl broadcast
.Op Fl insecure
.Op Fl ypset
.Op Fl ypsetme
.Sh DESCRIPTION
.Nm
finds the server for a particular YP domain and stores information about it
in a
.Pa binding file.
This binding information includes the IP address of the server associated with
that particular domain and which port the server is using.  This information
is stored in the directory
.Pa /var/yp/binding
in a file named with the convention
.Pa domainname.version.
(The YP system only supplies information on version 2.)
.Pp
If
.Nm
is started without the
.Fl broadcast
option,
.Nm
steps through the list of YP servers specified in
.Pa /var/yp/binding/domainname.ypservers
and contacts each in turn attempting to bind to that server. 
It is strongly recommended that these hosts are in the local
hosts file, and that hosts are looked up in local files before
the YP hosts map.
.Pp
If
.Nm
is started with the
.Fl broadcast
option, or if
.Pa /var/yp/binding/domainname.ypservers
does not exist,
.Nm
broadcasts to find a process willing to serve maps for the
client's domain.
.Pp
Once a binding is established,
.Nm
maintains this binding by periodically communicating with the server to which
it is bound.
If the binding is somehow lost, e.g by server reboot,
.Nm
marks the domain as unbound and attempts to re-establish the binding.
When the binding is once again successful,
.Nm
marks the domain as bound and resumes its periodic check.
.Pp
The options are as follows:
.Bl -tag -width "-broadcast"
.It Fl broadcast
sends a broadcast requesting a YP server to which to bind.
.It Fl insecure
do not require that clients make requests from reserved ports.
This may be necessary for
.Tn SunOS 3.x
or
.Tn ULTRIX
clients.
.It Fl ypset
.Xr ypset 8
may be used to change the server to which a domain is bound.
.It Fl ypsetme
.Xr ypset 8
may be used only from this machine to change the server
to which a domain is bound.
.El
.Pp
The
.Fl broadcast
.Fl ypset ,
and
.Fl ypsetme ,
options are inherently insecure and should be avoided.
.Sh FILES
.Pa /var/yp/binding/domainname.version
- binding file for domainname
.Pa /var/yp/binding/domainname.ypservers
- explicit servers to bind to.
.Sh SEE ALSO
.Xr domainname 1 ,
.Xr ypcat 1 ,
.Xr ypmatch 1 ,
.Xr yppoll 8 ,
.Xr ypset 8 ,
.Xr ypwhich 1 ,
.Xr yp 8
.Sh AUTHOR
This version of
.Nm
was originally implemented by Theo de Raadt.  The ypservers support was
implemented by Luke Mewburn.
