NetBSD/src/share/man/man8/man8.acorn32/nbfs.8
.\" $NetBSD: nbfs.8,v 1.2 2010/11/25 09:13:37 wiz Exp $
.\"
.\" Copyright (c) 2006 Ben Harris
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 3, 2006
.Dt NBFS 8 acorn32
.Os
.Sh NAME
.Nm nbfs
.Nd NetBSD boot filing system for RISC OS
.Sh SYNOPSIS
.Nm *NBFS
.Sh DESCRIPTION
.Nm
is a filing system, implemented as a RISC OS relocatable module, to allow
read-only access to
.Nx
file systems from RISC OS.
It supports reading FFSv1, FFSv2, LFSv1, and LVSv2 partitions from disks
supported by FileCore-based filing systems such as ADFS.
.Pp
Pathnames on
.Nm
follow RISC OS conventions, as described in the various RISC OS
.%T User Guides .
The underlying FileCore instance used by
.Nm
is selected by the filing system's special field, while the disk and
.Nx
partition are selected by the disk name.
Thus, to refer to the first
.Nx
partition of the first ADFS hard disk, one
would use
.Pa NBFS#ADFS::4a .
RISC OS file names are generated from
.Nx
file names by replacing
.Ql .
with
.Ql / .
Files whose names contain characters not allowed in RISC OS file names
are not accessible through
.Nm .
Thus, as a full example, the file
.Pa /etc/resolv.conf
on the partition mentioned above would be referred to as
.Pa NBFS#ADFS::4a.$.etc.resolv/conf .
.Sh LIMITATIONS
.Nm
is very limited.
.Sh SEE ALSO
.Xr boot32 8
.Rs
.%Q Acorn Computers Ltd
.%T RISC OS 3.7 User Guide
.%C Cambridge
.%D January 1997
.Re
