NetBSD/src/usr.bin/iconv/iconv.1
.\" $NetBSD: iconv.1,v 1.1 2003/07/04 06:59:55 tshiozak Exp $
.\"
.\" Copyright (c)2003 Citrus Project,
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 4, 2003
.Dt iconv 1
.Os
.\" ----------------------------------------------------------------------
.Sh NAME
.Nm iconv
.Nd codeset conversion utility
.\" ----------------------------------------------------------------------
.Sh SYNOPSIS
.Nm
.Op Fl cs
.Fl f
.Ar from_name
.Fl t
.Ar to_name
.Op Ar file ...
.Nm
.Fl l
.\" ----------------------------------------------------------------------
.Sh DESCRIPTION
The
.Nm
utility converts the codeset of inputs (specified by
.Ar file ,
or the standard input unless it is specified) and puts the converted
texts to the standard output.
.Pp
The following options are available:
.Bl -tag -width 0123
.It Fl c
Prevent to put any invalid characters.  By default,
.Nm
puts "invalid character" specified by
.Ar to_name
codeset when it encounts a character
which is valid in
.Ar from_name
codeset but not corresponding to
.Ar to_name
codeset.
.It Fl s
Silent.  By default,
.Nm
puts the number of "invalid characters" to the standard error if they exist.
This option prevents this behaviour.
.It Fl f
Specifies the source codeset name as
.Ar from_name .
.It Fl t
Specifies the destination codeset name as
.Ar to_name .
.It Fl l
Lists available codeset names.
Note that not all combinations of
.Ar from_name
and
.Ar to_name
are valid.
.El
.\" ----------------------------------------------------------------------
.Sh EXIT STATUS
.Nm
exits with 0 on success, and with non-zero if an error occurs.
.\" ----------------------------------------------------------------------
.Sh SEE ALSO
.Xr iconv_open 3 ,
.Xr iconv_close 3
and
.Xr iconv 3 .
.\" ----------------------------------------------------------------------
.Sh HISTORY
.Nm
first appeared in
.Nx 2.0 .
.\" ----------------------------------------------------------------------
.Sh STANDARDS
.Nm
conform to
.St -p1003.1-2001 .
