NetBSD/src/share/man/man4/man4.x86/amdccp.4
.\" $NetBSD: amdccp.4,v 1.1 2021/07/25 07:35:55 nia Exp $
.\"
.\" Copyright (c) 2021 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 25, 2021
.Dt AMDCCP 4
.Os
.Sh NAME
.Nm amdccp
.Nd AMD Cryptographic Coprocessor device driver
.Sh SYNOPSIS
.Cd "amdccp* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for cryptographic coprocessors found on
certain AMD CPUs.
The coprocessor supports hardware offloading for common cryptographic
algorithms and a True Random Number Generator (TRNG).
.Pp
Currently, this driver only supports providing additional entropy
to the kernel's random number generator.
.Sh SEE ALSO
.Xr pci 4 ,
.Xr rnd 4 ,
.Xr entropy 7 ,
.Xr rnd 9
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 9.0 .
