NetBSD/src/share/man/man4/man4.x86/amdzentemp.4
.\" $NetBSD: amdzentemp.4,v 1.1 2018/01/25 01:25:39 christos Exp $
.\"-
.\" Copyright (c) 2008 Christoph Egger
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/coretemp.4,v 1.4 2007/10/15 20:00:19 netchild Exp $
.\"
.Dd January 24, 2018
.Dt AMDTEMP 4 x86
.Os
.Sh NAME
.Nm amdzentemp
.Nd AMD Zen CPU family on-die digital thermal sensor
.Sh SYNOPSIS
.Cd "amdzentemp* at amdsmn?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the on-die digital thermal sensor present
on AMD Ryzen CPUs
.Pp
These sensors provide 0.125 degC accuracy. There is one sensor for each
CPU socket.
.Pp
The
.Nm
driver reports temperatures through the
.Xr envsys 4
API.
.Bl -column "Sensor    " "Units" "Typical" -offset indent
.It Sy "Sensor     " Ta Sy "Units" Ta Sy "Typical Use"
.It Li "CPUN sensor0" Ta "uK" Ta "cpuN temperature"
.El
.Sh SEE ALSO
.Xr amdtemp 4 ,
.Xr envsys 4 ,
.Xr envstat 8 ,
.Xr powerd 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4
named
.Dq kate .
It was then ported to
.Nx 5.0 .
The driver has been renamed with support for newer AMD CPUs.
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Constantine A. Murenin Aq Mt cnst@openbsd.org
whilst at the University of Waterloo.
