NetBSD/src/share/man/man4/man4.x86/coretemp.4
.\" $NetBSD: coretemp.4,v 1.1.12.2 2014/08/20 00:02:36 tls Exp $
.\"-
.\" Copyright (c) 2007 Juan Romero Pardines.
.\" Copyright (c) 2007 Dag-Erling Coïdan Smørgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/coretemp.4,v 1.4 2007/10/15 20:00:19 netchild Exp $
.\"
.Dd February 23, 2010
.Dt CORETEMP 4
.Os
.Sh NAME
.Nm coretemp
.Nd Intel Core on-die digital thermal sensor
.Sh SYNOPSIS
.Cd "coretemp* at cpu?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the on-die digital thermal sensor present
on Intel Core and newer CPUs.
.Pp
The temperatures can be observed by using the
.Xr envsys 4
.Tn API
or the
.Xr envstat 8
command.
Temperatures are reported for each core separately.
.Sh EVENTS
The
.Nm
driver is able to send a
.Em critical
event to the
.Xr powerd 8
daemon.
The script
.Pa /etc/powerd/scripts/sensor_temperature
will be executed by the daemon (if running) when the limit has been reached.
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr envstat 8 ,
.Xr powerd 8
.Rs
.%A Michael Berktold
.%A Tian Tian (Intel Corporation)
.%T CPU Monitoring With DTS/PECI, White Paper
.%D September 2010
.%U http://edc.intel.com/Download.aspx?id=2612
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 7.0 .
It was later ported to
.Nx 5.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Rui Paulo Aq Mt rpaulo@FreeBSD.org
as part of a Google Summer of Code project.
It was adapted to
.Nx
by
.An Juan Romero Pardines .
