NetBSD/src/share/man/man4/man4.x86/est.4
.\" $NetBSD: est.4,v 1.3 2011/03/04 05:58:07 jruoho Exp $
.\"
.\" Copyright (c) 2011 Jukka Ruohonen <jruohonen@iki.fi>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 4, 2011
.Dt EST 4
.Os
.Sh NAME
.Nm est
.Nd Enhanced SpeedStep
.Sh SYNOPSIS
.Cd "est0 at cpu0"
.Sh DESCRIPTION
The
.Nm
driver provides support for Enhanced SpeedStep introduced in
Intel's first and second generation of Pentium M processors.
The following
.Xr sysctl 8
variables are available with
.Nm :
.Bl -tag -width "machdep.est.frequency.available" -offset indent
.It Ic machdep.est.frequency.target
The target frequency of the
.Tn CPUs .
.It Ic machdep.est.frequency.current
The current frequency.
.It Ic machdep.est.frequency.available
The frequencies recognized by
.Nm .
.El
.Pp
Note, however, that these variables are
not guaranteed to exist in the future versions of
.Nx .
.Sh SEE ALSO
.Xr acpicpu 4 ,
.Xr odcm 4 ,
.Xr powernow 4
.Sh CAVEATS
The
.Nm
driver is considered a legacy interface to be used only with old systems.
It is known to be problematic with new
.Tn CPUs .
Furthermore, in the unlikely case where both
.Nm
and
.Xr ichlpcib 4
or
.Xr piixpcib 4
provide support for SpeedStep,
the PCI-based interfaces should not be accessed due possible race conditions.
