NetBSD/src/share/man/man4/man4.x86/fwhrng.4
.\"	$NetBSD: fwhrng.4,v 1.2 2017/02/17 22:10:47 christos Exp $
.\"
.\" Copyright (c) 2010 Jukka Ruohonen <jruohonen@iki.fi>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt FWHRNG 4 x86
.Os
.Sh NAME
.Nm fwhrng
.Nd Intel Firmware Hub Random Number Generator
.Sh SYNOPSIS
.Cd "fwhrng* at ichlpcib?"
.Sh DESCRIPTION
The
.Nm
driver provides support for hardware Random Number Generator
.Pq Tn RNG
available on some Intel Firmware Hubs
.Pq Tn FWHs .
The
.Nm
driver accesses the
.Tn RNG
through an
.Tn I/O
controller hub
.Pq Tn ICH .
.Sh SEE ALSO
.Xr x86/ichlpcib 4 ,
.Xr rnd 4
.Rs
.%A Intel Corporation
.%T Intel 82802AB/82802AC Firmware Hub (FWH)
.%D November, 2000
.%U http://download.intel.com/design/chipsets/datashts/29065804.pdf
.Re
.Sh CAVEATS
The entropy source is not tested for randomness.
