NetBSD/src/share/man/man4/man4.x86/hpet.4
.\"	$NetBSD: hpet.4,v 1.2.2.1 2011/06/23 14:18:45 cherry Exp $
.\"
.\" Copyright (c) 2010 Jukka Ruohonen <jruohonen@iki.fi>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 14, 2011
.Dt HPET 4 x86
.Os
.Sh NAME
.Nm hpet
.Nd High Precision Event Timer
.Sh SYNOPSIS
.Cd "hpet* at acpihpetbus?"
.Cd "hpet* at acpinodebus?"
.Cd "hpet* at amdpcib?"
.Cd "hpet* at ichlpcib?"
.Sh DESCRIPTION
The
.Nm
driver supports High Precision Event Timers
.Pq Tn HPETs .
The
.Tn HPET
architecture defines one main 64-bit counter and several
additional timers with variable width.
The minimum clock frequency of the main timecounter is 10 MHz,
but much higher rates are common.
The additional 32 or 64 -bit parts are typically accessible via
.Tn MMIO
that is set by the system
.Tn BIOS
through
.Tn ACPI .
.Pp
As a
.Tn HPET
can provide higher interrupt rates than a
.Tn RTC
or
.Xr attimer 4 ,
multimedia is one typical application context.
The interrupt logic is configurable through
.Tn I/O
.Tn APIC ,
but a legacy mode is provided for older systems.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr attimer 4 ,
.Xr timecounter 9 ,
.Xr tsc 9
.Rs
.%A Intel Corporation
.%T IA-PC HPET (High Precision Event Timers) Specification
.%N Revision 1.0a
.%D October, 2004
.%U http://www.intel.com/hardwaredesign/hpetspec_1.pdf
.Re
