NetBSD/src/share/man/man4/man4.x86/odcm.4
.\" $NetBSD: odcm.4,v 1.4.32.1 2017/04/21 16:53:18 bouyer Exp $
.\"
.\" Copyright (c) 2011 Jukka Ruohonen <jruohonen@iki.fi>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt ODCM 4
.Os
.Sh NAME
.Nm odcm
.Nd On-demand Clock Modulation
.Sh SYNOPSIS
.Cd "odcm0 at cpu0"
.Sh DESCRIPTION
The
.Nm
driver provides support for changing the duty cycle of a
.Tn CPU .
This is sometimes known as
.Dq on-demand clock modulation
.Pq Tn ODCM .
Refer to
.Xr acpicpu 4
for additional details about
.Tn ODCM .
.Pp
The following
.Xr sysctl 8
variables are available with
.Nm :
.Bl -tag -width "machdep.clockmod.available " -offset indent
.It Ic machdep.clockmod.target
The target duty cycle of all
.Tn CPUs .
The values range from 7 (100 %) to 0 (approximately 13 %).
.It Ic machdep.clockmod.current
The current duty cycle of
.Tn CPUs .
.It Ic machdep.clockmod.available
A list of available duty cycles.
.El
.Pp
Note that some errata may limit the availability of some duty cycles.
.Sh SEE ALSO
.Xr acpicpu 4 ,
.Xr x86/est 4 ,
.Xr x86/powernow 4
.Sh CAVEATS
.Tn ODCM
is meant for short-term thermal management, not power management.
There is usually no reason for a system administrator
to change the values manually.
Lowering the duty cycle may dramatically decrease
performance and responsiveness of the system.
