NetBSD/src/share/man/man4/man4.x86/powernow.4
.\" $NetBSD: powernow.4,v 1.3 2017/02/17 22:10:47 christos Exp $
.\"
.\" Copyright (c) 2011 Jukka Ruohonen <jruohonen@iki.fi>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt POWERNOW 4
.Os
.Sh NAME
.Nm powernow
.Nd AMD PowerNow! and Cool'n'Quiet
.Sh SYNOPSIS
.Cd "powernow0 at cpu0"
.Sh DESCRIPTION
The
.Nm
driver supports
.Tn AMD
.Dq PowerNow!
and
.Dq Cool'n'Quiet
.Tn CPU
frequency scaling technologies.
The following
.Xr sysctl 8
variables are available with
.Nm :
.Bl -tag -width "machdep.powernow.frequency.available" -offset 2n
.It Ic machdep.powernow.frequency.target
The target frequency of the
.Tn CPUs .
.It Ic machdep.powernow.frequency.current
The current frequency.
.It Ic machdep.powernow.frequency.available
The available frequencies.
.El
.Pp
Note, however, that these variables are
not guaranteed to exist in the future versions of
.Nx .
.Sh SEE ALSO
.Xr acpicpu 4 ,
.Xr x86/est 4 ,
.Xr x86/odcm 4
.Sh CAVEATS
The
.Nm
driver is considered a legacy interface to
be used only with relatively old systems.
The driver supports only
.Tn AMD
processor families
.Tn K7
(for instance, Duron, Athlon, and some Semprons) and
.Tn K8
(namely, the early 64-bit family, including Athlon 64, Opteron, and Turion).
