NetBSD/src/share/man/man4/man4.x86/soekrisgpio.4
.\" $NetBSD: soekrisgpio.4,v 1.2 2013/06/10 07:14:01 kardel Exp $
.\" from OpenBSD
.\"
.\" Copyright (c) 2013 Matt Dainty <matt <at> bodgit-n-scarper.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt SOEKRIS 4 x86
.Os
.Sh NAME
.Nm soekrisgpio
.Nd Soekris net6501 GPIO and LEDs
.Sh SYNOPSIS
.Cd "soekrisgpio0 at isa? port 0x680"
.Cd "gpio* at soekrisgpio?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the GPIO and LEDs as implemented by the Xilinx
Spartan FGPA integrated into the Soekris net6501 programmed with the default
bitstream found in the BIOS.
.Pp
Two standard
.Xr gpio 4
interfaces are provided, one for the 16 real pins which can be configured as
either inputs or outputs and another with 2 output-only pins that map
to the error and ready LEDs respectively.
Both may be used with
.Xr gpioctl 8 .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr gpio 4 ,
.Xr gpioctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx
7.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Matt Dainty Aq matt@...
and imported from a patch for OpenBSD to
.Nx
by
.An Frank Kardel Aq kardel@NetBSD.org .
.Sh BUGS
If the Xilinx FPGA is programmed with a different bitstream, the driver will
likely not function.