NetBSD/src/share/man/man4/man4.x86/tco.4
.\"	$NetBSD: tco.4,v 1.4 2015/05/04 08:04:50 pgoyette Exp $
.\"	$OpenBSD: pwdog.4,v 1.6 2007/12/23 22:16:39 jmc Exp $
.\"
.\" Copyright (c) 2015 The NetBSD Foundation
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Goyette
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 4, 2015
.Dt TCO 4
.Os
.Sh NAME
.Nm tco
.Nd Intel Controller Hub TCO watchdog timer device
.Sh SYNOPSIS
.Cd "tco* at ichlpcib?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the watchdog timer included in the Intel
Controller Hub (ICH).
.Pp
Setting the timer interval and arming the watchdog is performed using
the
.Xr wdogctl 8
utility.
For ICH5 and earlier controllers, the interval is in the range of 2 to
23 seconds; for ICH6 and newer controllers, the interval is in the range
of 1 to 367 seconds.
.Sh SEE ALSO
.Xr wdogctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 8.0 .
In earlier releases of
.Nx
the driver was included as part of the
.Xr x86/ichlpcib 4
driver.
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Minoura Makoto Aq Mt minoura@NetBSD.org
and
.An Matthew R. Green Aq Mt mrg@NetBSD.org .
The
.Nm
driver was separated from the
.Xr x86/ichlpcib 4
driver by
.An Paul Goyette Aq Mt pgoyette@NetBSD.org .
