NetBSD/src/share/man/man4/man4.x86/tprof_pmi.4
.\"	$NetBSD: tprof_pmi.4,v 1.2.4.2 2012/04/17 00:05:47 yamt Exp $
.\"
.\" Copyright (c)2011 YAMAMOTO Takashi,
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" ------------------------------------------------------------
.Dd December 2, 2011
.Dt TPROF_PMI 4
.Os
.\" ------------------------------------------------------------
.Sh NAME
.Nm tprof_pmi
.Nd a tprof backend for Intel Pentium 4
.\" ------------------------------------------------------------
.Sh SYNOPSIS
.Cd pseudo-device tprof_pmi
.\" ------------------------------------------------------------
.Sh DESCRIPTION
The
.Nm
driver is a
.Xr tprof 4
backend driver, which uses performance-monitoring events available for
Intel Pentium 4 (NetBurst) processors.
.Pp
It programs the processors so that global_power_events events
(ESCR Event Select = 0x13) to raise NMIs and the NMI handler collect
samples.
.\" ------------------------------------------------------------
.\".Sh EXAMPLES
.\" ------------------------------------------------------------
.Sh SEE ALSO
.Xr tprof 4
.\" ------------------------------------------------------------
.\".Sh HISTORY
.\"The
.\".Nm
.\"driver first appeared in
.\".Nx 4.0 .
.\" ------------------------------------------------------------
.Sh AUTHORS
The
.Nm
driver was written by
.An YAMAMOTO Takashi .
.\" ------------------------------------------------------------
.Sh BUGS
The name of this driver is too generic.
