NetBSD/src/share/man/man8/man8.arm32/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.arm32/MAKEDEV and
.\" *** src/share/man/man8/man8.arm32/MAKEDEV.8.template
.\" *** 
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\" Copyright (c) 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"	$NetBSD: MAKEDEV.8,v 1.6 1999/09/18 00:31:02 hubertf Exp $
.\"
.Dd February 17, 1996
.Dt MAKEDEV 8 arm32
.Os
.Sh NAME
.Nm MAKEDEV ,
.Nm makedev
.Nd create system and device special files
.Sh SYNOPSIS
MAKEDEV name ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the ``/dev'' directory, is used to create the common special
files.
.\" See
.\" .IR special (8)
.\" for a more complete discussion of special files.
.Pp
.Nm
takes any number of device names as arguments, where the names are
the common abbreviation for the device.
There are several special devices:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
Makes all known devices, including local devices. Tries to make the 'standard' number of each type.
.It Ar floppy
Devices to be put on install floppies
.It Ar std
Standard devices
.It Ar local
Configuration specific devices which are created by running the
.Pa MAKEDEV.local
shell script with the argument ``all''.
.El
.Pp
The arm32 supports the following devices.
Where a device name is followed by a hash sign (``#''), the hash sign
must be replaced by a unit number.
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar st#
SCSI tapes, see
.Xr st 4 
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar wd#
``winchester'' disk drives (ST506,IDE,ESDI,RLL,...), see
.Xr wd 4 
. It Ar fd#
``floppy'' disk drives (3 1/2``, 5 1/4'')
. It Ar sd#
SCSI disks, see
.Xr sd 4 
. It Ar cd#
SCSI CD-ROM, see
.Xr cd 4 
. It Ar vnd#
``file'' pseudo-disks, see
.Xr vnd 4 
. It Ar md#
``memory'' pseudo-disks, see
.Xr md 4 
. It Ar ccd#
Contatenated disk devices, see
.Xr ccd 4 
. It Ar raid#
RAIDframe disk driver, see
.Xr raid 4 
. El
.It Console ports:
. Bl -tag -width 0123456789 -compact
. It Ar ttyv0
Pccons or virtual console 0
. It Ar ttyv#
Virtual console screen
. It Ar ttyE#
Wscons
. El
.It Pointing devices:
. Bl -tag -width 0123456789 -compact
. It Ar quadmouse#
``quadrature mouse'', see
.Xr quadmouse 4 
. It Ar pms#
``PS/2 mouse'', see
.Xr pms 4 
. It Ar wsmouse#
Wscons mouse events, see
.Xr wsmouse 4 
. El
.It Keyboard devices:
. Bl -tag -width 0123456789 -compact
. It Ar wskbd#
Wscons keyboard events, see
.Xr wskbd 4 
. El
.It Terminal ports:
. Bl -tag -width 0123456789 -compact
. It Ar tty#
Serial ports, see
.Xr tty 4 
. It Ar fcom
DC21285 COM port
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr pty 4 
. El
.It Printers:
. Bl -tag -width 0123456789 -compact
. It Ar lpt#
Stock lp, see
.Xr lpt 4 
. It Ar lpa#
Interruptless lp
. El
.It Cpus:
. Bl -tag -width 0123456789 -compact
. It Ar cpu#
Cpus
. El
.It USB devices:
. Bl -tag -width 0123456789 -compact
. It Ar usb#
Bus control devices used by usbd for attach/detach, see
.Xr usb 4 
. It Ar uhid#
Generic HID devices, see
.Xr uhid 4 
. It Ar ulpt#
Printer devices, see
.Xr ulpt 4 
. It Ar ugen#
Generic device, see
.Xr ugen 4 
. It Ar ttyU#
Modem
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar md
Memory disk, see
.Xr md 4 
. It Ar kbd
Raw keyboard, see
.Xr kbd 4 
. It Ar kbdctl
Keyboard control
. It Ar fd
File descriptors
. It Ar bpf#
Packet filter, see
.Xr bpf 4 
. It Ar beep
Riscpc speaker, see
.Xr beep 4 
. It Ar ipl
IP filter control
. It Ar random
Random number generator
. It Ar lkm
Loadable kernel modules interface, see
.Xr lkm 4 
. It Ar tun#
Network tunnel driver, see
.Xr tun 4 
. It Ar ch#
SCSI Auto changer, see
.Xr ch 4 
. It Ar uk#
SCSI Unknown device, see
.Xr uk 4 
. It Ar scsibus#
SCSI busses, see
.Xr scsi 4 ,
.Xr scsictl 8 
. It Ar ss#
SCSI scanner device, see
.Xr ss 4 
. It Ar iic#
IIC bus device
. It Ar rtc#
RTC device
. It Ar cfs#
Coda file system device
. El
.El
.Pp
.Sh FILES
/dev		The special file directory.
.Sh SEE ALSO
.Xr intro 4,
.Xr config 8,
.Xr mknod 8
.\" .Xr special 8
