NetBSD/src/games/cgram/cgram.6
.\" $NetBSD: cgram.6,v 1.3 2021/04/22 14:57:36 wiz Exp $
.\"
.\" Copyright (c) 2004, 2013 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by David A. Holland.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 22, 2021
.Dt CGRAM 6
.Os
.Sh NAME
.Nm cgram
.Nd solve Sunday-paper cryptograms
.Sh SYNOPSIS
.Nm Op Ar file
.Sh DESCRIPTION
.Nm
is a curses-based widget for solving Sunday-paper-type cryptograms
based on substitution ciphers.
If
.Ar file
is given, it is used as cleartext, otherwise a random cleartext is
chosen using
.Xr fortune 6 ;
either way, a random substitution key is generated.
.Pp
The ciphertext is displayed.
Typing a letter changes the key so that the letter under the cursor
maps to the newly typed letter, and updates the display accordingly.
Use Emacs-type cursor commands to move around.
Enter a tilde
.Pq ~
to quit.
Press asterisk
.Pq *
to enter an easier mode where correct letters are displayed in
boldface.
.Sh SEE ALSO
.Xr caesar 6
.Sh HISTORY
.Nm
was written circa 2004.
It was imported into
.Nx
in 2013 and first appeared in
.Nx 7.0 .
