NetBSD/src/share/man/man4/man4.atari/et.4
.\"     $NetBSD: et.4,v 1.8 1999/12/23 12:28:06 jdc Exp $
.\"
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\" 
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Julian Coleman.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\" 	This product includes software developed by the NetBSD
.\" 	Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd Jul 30, 1998
.Dt ET 4 atari
.Sh NAME
.Nm et
.Nd driver for ET4000 VME graphics cards
.Sh SYNOPSIS
.Cd "et0 at vme0"
.Sh DESCRIPTION
The
.Nm ""
device driver supports VME graphics cards based on the Tseng ET4000 chipset.
It supports the minimal ioctl's needed to run X11.  The 8Kb control registers
are mapped from offset 0x0 to offset 0x1fff and the 1MB frame buffer is mapped
from offset 0x400000 to offset 0x4fffff.  VGA compatible memory is mapped from
offset 0xa0000 to offset 0xc0000.
.Sh HARDWARE
Cards supported by the
.Nm
driver include:
.Pp
.Bl -item -compact
.It
Crazy Dots II VME graphics card
.El
.Sh NOTES
The clock generator on the Crazy Dots card is an ICS 1394M.  Setting the
clock is done by writing to a register at offset 0x0.  This address cannot
be read.  The values that can be written to the register and the associated
clock are:
.Bd -unfilled -offset indent
.Bl -column "Value " "Clock"
.Em "Value	Clock"
.It 0x00	14318
.It 0x10	16257
.It 0x17	20000
.It 0x0c	24000
.It 0x04	25175
.It 0x14	28332
.It 0x18	32514
.It 0x1a	36000
.It 0x1c	40000
.It 0x03	44900
.It 0x0f	50000
.It 0x13	50344
.It 0x07	56644
.It 0x11	65028
.It 0x1f	80000
.El
.Sh FILES
.Bl -tag -width "xxxxxxxxxx" -compact
.It Pa /dev/etvme
.El
.Sh AUTHOR
.An Julian Coleman
.Sh BUGS
The driver does not support a text mode, so cannot be used as a console.

