NetBSD/src/lib/libc/sys/_lwp_gettid.2
.\"	$NetBSD: _lwp_gettid.2,v 1.1 2020/04/04 20:31:11 thorpej Exp $
.\"
.\" Copyright (c) 2020 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 31, 2020
.Dt _LWP_GETTID 2
.Os
.Sh NAME
.Nm _lwp_gettid
.Nd get light-weight process global thread ID
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.In lwp.h
.Ft lwpid_t
.Fn _lwp_gettid void
.Sh DESCRIPTION
.Fn _lwp_gettid
returns the global thread ID of the calling LWP.
The relationship between this value and the value returned by
.Fn _lwp_self
is undefined;
the only guarantee is that the value returned by
.Fn _lwp_gettid
is unique in the system.
.Sh ERRORS
The
.Fn _lwp_gettid
function is always successful, and no return value is reserved to indicate
an error.
.Sh SEE ALSO
.Xr _lwp_self 2
.Sh HISTORY
The
.Fn _lwp_gettid
system call first appeared in
.Nx 10.0 .
