NetBSD/src/lib/libc/sys/_lwp_wait.2
.\"	$NetBSD: _lwp_wait.2,v 1.2 2003/01/18 11:33:00 thorpej Exp $
.\"
.\" Copyright (c) 2003 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe of Wasabi Systems, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 13, 2003
.Dt _LWP_WAIT 2
.Os
.Sh NAME
.Nm _lwp_wait
.Nd wait for light-weight process termination
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.Fd #include \*[Lt]lwp.h\*[Gt]
.Ft int
.Fn _lwp_wait "lwpid_t wlwp" "lwpid_t *rlwp"
.Sh DESCRIPTION
.Fn _lwp_wait
suspends execution of the calling LWP until the LWP specified by
.Fa wlwp
terminates.
The specified LWP must not be detached.
If
.Fa wlwp
is 0, then
.Fn _lwp_wait
waits for any undetached LWP in the current process.
.Pp
If
.Fa rlwp
is not
.Dv NULL ,
then it points to the location where the LWP ID of
the exited LWP is stored.
.Sh RETURN VALUES
Upon successful completion,
.Fn _lwp_wait
returns a value of 0.
Otherwise, an error code is returned to indicate the error.
.Sh ERRORS
.Fn _lwp_wait
will fail if:
.Bl -tag -width [EDEADLK]
.It Bq Er ESRCH
No undetached LWP can be found in the current process corresponding to that
specified by
.Fa wlwp .
.It Bq Er EDEADLK
The calling LWP is the only LWP in the process.
.It Bq Er EDEADLK
The LWP ID specified by
.Fa wlwp
is the LWP ID of the calling LWP.
.It Bq Er EINTR
.Fn _lwp_wait
was interrupted by a caught signal, or the signal did not
have the
.Dv SA_RESTART
flag set.
.El
.Sh SEE ALSO
.Xr _lwp_create 2 ,
.Xr _lwp_exit 2
.Sh HISTORY
The
.Fn _lwp_wait
system call first appeared in
.Nx 2.0 .
