NetBSD/src/lib/libc/sys/getvfsstat.2
.\"	$NetBSD: getvfsstat.2,v 1.1 2004/04/21 01:05:32 christos Exp $
.\"
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)getvfsstat.2	8.3 (Berkeley) 5/25/95
.\"
.Dd April 14, 2004
.Dt GETVFSSTAT 2
.Os
.Sh NAME
.Nm getvfsstat
.Nd get list of all mounted file systems
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.In sys/types.h
.In sys/statvfs.h
.Ft int
.Fn getvfsstat "struct statvfs *buf" "size_t bufsize" "int flags"
.Sh DESCRIPTION
.Fn getvfsstat
returns information about all mounted file systems.
.Fa buf
is a pointer to an array of
.Nm statvfs
structures defined in
.Xr statvfs 5 .
.Pp
The buffer is filled with an array of
.Fa statvfs
structures, one for each mounted file system
up to the size specified by
.Fa bufsize .
.Pp
If
.Fa buf
is given as NULL,
.Fn getvfsstat
returns just the number of mounted file systems.
.Pp
Normally
.Fa flags
should be specified as
.Dv ST_WAIT .
If
.Fa flags
is set to
.Dv ST_NOWAIT ,
.Fn getvfsstat
will return the information it has available without requesting
an update from each file system.
Thus, some of the information will be out of date, but
.Fn getvfsstat
will not block waiting for information from a file system that is
unable to respond.
.Sh RETURN VALUES
Upon successful completion, the number of
.Fa statvfs
structures is returned.
Otherwise, -1 is returned and the global variable
.Va errno
is set to indicate the error.
.Sh ERRORS
.Fn getvfsstat
fails if one or more of the following are true:
.Bl -tag -width Er
.It Bq Er EFAULT
.Fa buf
points to an invalid address.
.It Bq Er EIO
An
.Tn I/O
error occurred while reading from or writing to the file system.
.El
.Sh SEE ALSO
.Xr statvfs 2 ,
.Xr getmntinfo 3 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh HISTORY
The
.Fn getvfsstat
function first appeared in
.Nx 2.1
to replace
.Fn getffstat
which appeared in
.Bx 4.4 .
