NetBSD/src/lib/libc/sys/socketpair.2
.\"	$NetBSD: socketpair.2,v 1.24 2022/11/29 20:26:39 jschauma Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)socketpair.2	8.1 (Berkeley) 6/4/93
.\"
.Dd November 29, 2022
.Dt SOCKETPAIR 2
.Os
.Sh NAME
.Nm socketpair
.Nd create a pair of connected sockets
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.In sys/socket.h
.Ft int
.Fn socketpair "int d" "int type" "int protocol" "int *sv"
.Sh DESCRIPTION
The
.Fn socketpair
call creates an unnamed pair of connected sockets in
the specified domain
.Fa d ,
of the specified
.Fa type ,
and using the optionally specified
.Fa protocol .
The descriptors used in referencing the new sockets
are returned in
.Fa sv[0]
and
.Fa sv[1] .
The two sockets are indistinguishable.
.Pp
Possible values for the
.Fa type
argument are
.Dv SOCK_STREAM ,
.Dv SOCK_DGRAM ,
and
.Dv SOCK_SEQPACKET ;
the only supported value for the
.Fa protocol
is
.Ar 0 ,
which will let the system select an appropriate
protocol for the requested socket
.Fa type.
.Pp
Any combination of the following flags may
additionally be used in the
.Fa type
argument:
.Pp
.Bl -tag -width "SOCK_NONBLOCKX" -offset indent -compact
.It SOCK_CLOEXEC
Set close-on-exec flag on both the new descriptors.
.It SOCK_NONBLOCK
Set non-blocking I/O mode on both the new sockets.
.El
.Sh RETURN VALUES
A 0 is returned if the call succeeds, \-1 if it fails.
.Sh ERRORS
The call succeeds unless:
.Bl -tag -width Er
.It Bq Er EAFNOSUPPORT
The specified address family is not supported on this machine.
.It Bq Er EFAULT
The address
.Fa sv
does not specify a valid part of the
process address space.
.It Bq Er EMFILE
Too many descriptors are in use by this process.
.It Bq Er ENFILE
The system file table is full.
.It Bq Er EOPNOTSUPP
The specified protocol does not support creation of socket pairs.
.It Bq Er EPROTONOSUPPORT
The specified protocol is not supported on this machine.
.El
.Sh SEE ALSO
.Xr pipe 2 ,
.Xr read 2 ,
.Xr socket 2 ,
.Xr write 2
.Sh HISTORY
The
.Fn socketpair
function call appeared in
.Bx 4.2 .
.Pp
Support for the
.Dv SOCK_CLOEXEC
and
.Dv SOCK_NONBLOCK
flags appeared in
.Nx 6.0 .
.Sh BUGS
This call is currently implemented only for the
.Dv PF_LOCAL
domain.
