NetBSD/src/lib/libc/sys/sysarch.2
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)syscall.2	6.3 (Berkeley) 3/10/91
.\"	$Id: sysarch.2,v 1.1 1993/10/12 02:16:37 cgd Exp $
.\"
.Dd October 11, 1993
.Dt SYSARCH 2
.Os NetBSD 0.9a
.Sh NAME
.Nm sysarch
.Nd architecture-depenent system call
.Sh SYNOPSIS
.Fd #include <machine/sysarch.h>
.Ft int
.Fn sysarch "int number" "char *args"
.Sh DESCRIPTION
.Fn Sysarch
performs the architecture-dependent function
specified by
.Fa number
with the arguments specified by the
.Fa args
pointer.
.Fa Args
is a pointer to a structure defining the actual
arguments of the function.
Symbolic constants and argument structures
for the architecture-dependent
functions can be found in the header file
.Ao Pa machine/sysarch.h Ac .
.Pp
The
.Nm
system call should never be called directly by
user programs.  Instead, they should access
its functions using the architecture-dependent
library.
.Pp
.Sh RETURN VALUES
See the manual pages for specific architecture-dependent function calls
for information about their return values.
.Sh HISTORY
The
.Nm
function call appeared in
NetBSD 0.9a.
