NetBSD/src/usr.sbin/pf/pfs/pfs.8
.Dd July 21, 2009
.Dt PFS 8
.Os
.Sh NAME
.Nm pfs 
.Nd save and restore information for NAT and state tables.
.Sh SYNOPSIS
.Nm
.Op Fl v
.Fl l
.Nm
.Op Fl bv
.Fl R
.Ar filename
.Nm
.Op Fl bv
.Fl r
.Ar filename
.Nm
.Op Fl v
.Fl u
.Nm
.Op Fl bv
.Fl W
.Ar filename
.Nm
.Op Fl bv
.Fl w
.Ar filename
.Sh DESCRIPTION
The
.Nm
command allows state information created for NAT entries and rules using
.Dq keep state
to be locked (modification prevented) and then saved to disk,
allowing for the system to experience a reboot, followed by the restoration
of that information, resulting in connections not being interrupted.
.Sh OPTIONS
.Bl -tag -width XrXfilenameXX
.It Fl b
The information are read or stored using binary format.
The default format is a readable ASCII format, similar to 
.Pa pfctl.conf 
syntax.
.It Fl l
Lock state tables in the kernel.
.It Fl R Ar filename
Restore information from
.Ar filename
and load it into the kernel.
The state tables are locked at the beginning of this operation and
unlocked once complete.
.It Fl r Ar filename
Read information in from
.Ar filename
and load it into the kernel.
This requires the state tables to have already been locked
and does not change the lock once complete.
.It Fl u
Unlock state tables in the kernel.
.It Fl v
Provide a verbose description of what's being done.
.It Fl W Ar filename
Write information from the kernel out to
.Ar filename .
The state tables are locked at the beginning of this operation and
unlocked once complete.
.It Fl w Ar filename
Write information from the kernel out to
.Ar filename .
This requires the state tables to have already been locked
and does not change the lock once complete.
.El
.Sh FILES
.Pa /dev/pf
.Sh SEE ALSO
.Xr pf 4
