NetBSD/src/usr.sbin/pf/pfs/pfs.8
.\"	$NetBSD: pfs.8,v 1.4 2010/05/09 14:02:10 wiz Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 21, 2009
.Dt PFS 8
.Os
.Sh NAME
.Nm pfs
.Nd save and restore information for NAT and state tables
.Sh SYNOPSIS
.Nm
.Op Fl v
.Fl l
.Nm
.Op Fl bv
.Fl R
.Ar filename
.Nm
.Op Fl bv
.Fl r
.Ar filename
.Nm
.Op Fl v
.Fl u
.Nm
.Op Fl bv
.Fl W
.Ar filename
.Nm
.Op Fl bv
.Fl w
.Ar filename
.Sh DESCRIPTION
The
.Nm
command allows state information created for NAT entries and rules using
.Dq keep state
to be locked (modification prevented) and then saved to disk,
allowing for the system to experience a reboot, followed by the restoration
of that information, resulting in connections not being interrupted.
.Sh OPTIONS
.Bl -tag -width XrXfilenameXX
.It Fl b
The information are read or stored using binary format.
The default format is a readable ASCII format, similar to
.Pa pfctl.conf
syntax.
.It Fl l
Lock state tables in the kernel.
.It Fl R Ar filename
Restore information from
.Ar filename
and load it into the kernel.
The state tables are locked at the beginning of this operation and
unlocked once complete.
.It Fl r Ar filename
Read information in from
.Ar filename
and load it into the kernel.
This requires the state tables to have already been locked
and does not change the lock once complete.
.It Fl u
Unlock state tables in the kernel.
.It Fl v
Provide a verbose description of what's being done.
.It Fl W Ar filename
Write information from the kernel out to
.Ar filename .
The state tables are locked at the beginning of this operation and
unlocked once complete.
.It Fl w Ar filename
Write information from the kernel out to
.Ar filename .
This requires the state tables to have already been locked
and does not change the lock once complete.
.El
.Sh FILES
.Pa /dev/pf
.Sh SEE ALSO
.Xr pf 4
