NetBSD/src/usr.bin/rump_dhcpclient/rump.dhcpclient.1
.\"	$NetBSD: rump.dhcpclient.1,v 1.4 2021/09/16 21:29:42 andvar Exp $
.\"
.\" Copyright (c) 2011 Antti Kantee.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS "AS IS" AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 20, 2011
.Dt RUMP.DHCPCLIENT 1
.Os
.Sh NAME
.Nm rump.dhcpclient
.Nd simple dhcp client for rump kernels
.Sh SYNOPSIS
.Nm
.Ar ifname
.Sh DESCRIPTION
The
.Nm
utility is a very simple DHCP client which can be used to apply
networking configuration on one interface in a rump kernel.
Unlike full DHCP clients,
.Nm
does not store leases or renew expired leases.
The reason for this is the typical transient nature of a rump kernel.
Additionally,
.Nm
does not save DNS resolver information.
.Pp
After having successfully configured networking,
.Nm
prints out the networking configuration and lease time and exits.
.Pp
Since
.Nm
uses
.Xr bpf 4
to send and receive raw network packets, the server must include
support for bpf and vfs (for opening
.Pa /dev/bpf ) .
Otherwise, the following diagnostic message is printed:
.Bd -literal -offset indent
rump.dhcpclient: bpf: Function not implemented
.Ed
.Sh SEE ALSO
.Xr rump_server 1 ,
.Xr bpf 4
.Sh CAVEATS
There is no easy way to release a lease.
