NetBSD/src/share/man/man4/man4.i386/ed.4
.\"
.\" Copyright (c) 1994 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$Id: ed.4,v 1.1 1994/02/20 09:41:43 cgd Exp $
.\"
.Dd
.Dt ED 4 i386
.Os
.Sh NAME
.Nm ed
.Nd Ethernet driver for DP8390- and WD83C690-based ethernet boards
.Sh SYNOPSIS
.Cd "device ed0 at isa? port 0x280 net irq 9 iomem 0xd0000 vector edintr"
.Cd "device ed1 at isa? port 0x250 net irq 9 iomem 0xd8000 vector edintr"
.Cd "device ed2 at isa? port 0x300 net irq 10 iomem 0xcc000 vector edint"
.Sh DESCRIPTION
The
.Nm
interface provides access to a 10 Mb/s Ethernet network via the
DP8390 and WD83C690 Ethernet chips.  The ethernet cards supported
by the
.Nm
interface are:
.Pp
.Bl -tag -width -offset indet -compact
.It Western Digital 8003 Series
.It Western Digital 8013 Series
.It SMC Elite (80x3) Series
.It SMC Ultra (8216) Series
.It 3Com 3c503
.It NE1000
.It NE2000
.El
.Sh SEE ALSO
.Xr ifconfig 8
