NetBSD/src/share/man/man4/man4.i386/io.4
.\"
.\" Copyright (c) 1996 Joerg Wunsch
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/man4.i386/io.4,v 1.6.2.2 2000/12/12 10:00:55 ru Exp $
.\"
.Dd January 1, 1996
.Dt IO 4 i386
.Os
.Sh NAME
.Nm io
.Nd I/O privilege file
.Sh DESCRIPTION
.Bf -symbolic
This device is obsolete and is provided for compatibility purposes
only; use
.Xr i386_iopl 2
instead.
.Ef
.Pp
After opening
.Pa /dev/io
for writing
the process is granted full I/O privileges; closing the returned file
descriptor does
.Em not
result in revocation of these privileges.
The new I/O privileges can be useful in order to write userland
programs that handle some hardware directly.
.Pp
The entire access control is handled by the file access permissions
of
.Pa /dev/io ,
so care should be taken in granting rights for this device.
.Pp
I/O privilege on access to 
.Pa /dev/io
is only granted if the kernel was built with the
.Dv COMPAT_10
option. 
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/io
.El
.Sh SEE ALSO
.Xr mem 4
.Sh HISTORY
The
.Nm
file appeared in
.Nx 1.0 
after it was in the kernel for some time.
