NetBSD/src/share/man/man4/man4.i386/opms.4
.\" $NetBSD: opms.4,v 1.6 2001/04/02 21:03:51 wiz Exp $
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"          This product includes software developed for the
.\"          NetBSD Project.  See http://www.netbsd.org/ for
.\"          information about NetBSD.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" <<Id: LICENSE,v 1.2 2000/06/14 15:57:33 cgd Exp>>
.\"
.Dd March 12, 1997
.Dt OPMS 4 i386
.Os
.Sh NAME
.Nm opms
.Nd PS/2 auxiliary port mouse driver
.Sh SYNOPSIS
.Cd pckbc* at isa?
.Cd opms* at pckbc?
.Cd opms0 at pc? irq 12
.Cd opms0 at vt? irq 12
.Sh DESCRIPTION
This driver provides a interface to a PS/2 auxiliary port mouse which
is backwards-compatible to previous
.Nx / i386
versions without
.Xr wscons 4
support.
The
.Dq opms
driver internally converts the PS/2 mouse output into
.Xr busmouse 4
protocol.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/pms0
first PS/2 mouse device.
.El
.Sh SEE ALSO
.Xr pms 4 ,
.Xr pckbc 4 ,
.Xr wsmouse 4 ,
.Xr busmouse 4 ,
.Xr lms 4 ,
.Xr mms 4
.Sh BUGS
The
.Nm
device probe routine has been known to confuse some keyboard controllers.
