NetBSD/src/share/man/man4/man4.i386/pms.4
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$Id: pms.4,v 1.1 1993/08/06 10:10:57 cgd Exp $
.\"
.Dd August 6, 1993
.Dt PMS 4 i386
.Os NetBSD 0.8a
.Sh NAME
.Nm pms
.Nd
PS/2-style bus mouse driver
.Sh SYNOPSIS
.\" XXX this is awful hackery to get it to work right... -- cgd
.Cd "device pms0 at isa? port" \&"IO_BMS0\&" tty irq 5 vector pmsintr
.Sh DESCRIPTION
This driver provides an interface to a PS/2-style bus mouse.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/pms0
first PS/2-style bus mouse
.El
.Sh SEE ALSO
.Xr lms 4 ,
.Xr mms 4
.Sh BUGS
The
.Nm lms ,
.Nm mms ,
and
.Nm pms
bus mouse drivers could probably be combined into one.
.Pp
The probe routine currently doesn't probe for the device.
