NetBSD/src/share/man/man4/man4.i386/pms.4
.\"	$NetBSD: pms.4,v 1.11 1997/11/15 20:18:54 carrel Exp $
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 12, 1997
.Dt PMS 4 i386
.Os NetBSD 0.8a
.Sh NAME
.Nm pms
.Nd PS/2 auxiliary port mouse driver
.Sh SYNOPSIS
.Cd pms0 at pckbd? irq 12
.Cd options PMS_RESET_AND_DISABLE
.Sh DESCRIPTION
This driver provides an interface to a PS/2 auxiliary port mouse.  The
driver internally converts the PS/2 mouse output into
.Xr busmouse 4
protocol.
.Sh CONFIGURATION
The option PMS_RESET_AND_DISABLE causes the pms device to be reset when it
is probed and disabled when it is closed.  This should not be needed since
the pms driver is attached to the
.Xr pc 4
or
.Xr pcvt 4
devices.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/pms0
first PS/2 mouse device.
.El
.Sh SEE ALSO
.Xr busmouse 4 ,
.Xr lms 4 ,
.Xr mms 4 .
.Sh BUGS
The
.Nm
device probe routine has been known to confuse some keyboard controllers.
