NetBSD/src/share/man/man4/man4.i386/pnpbios.4
.\" $NetBSD: pnpbios.4,v 1.1 1999/11/14 17:02:21 augustss Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 14, 1999
.Dt PNPBIOS 4
.Os
.Sh NAME
.Nm pnpbios
.Nd introduction to PnP BIOS support
.Sh SYNOPSIS
.Cd "pnpbios0 at mainbus?"
.Cd "XX*      at pnpbios0 index ?"
.Pp
.Sh INTRODUCTION
.Nx
provides support for finding and attaching devices by
extracting information from the PnP BIOS of a machine.
.Sh SUPPORTED DEVICES
.Nx
includes the following drivers, sorted driver name:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It com
serial communications interface
.It lpt
parallel port driver
.It pciide
PCI IDE controllers driver
.It sb
SoundBlaster family audio device driver
.It wss
Windows Sound System hardware driver
.It ym
Yamaha OPL3-SA3 sound driver
.El
.\"
.Pp
.Sh SEE ALSO
.Xr intro 4 ,
.Xr com 4 ,
.Xr isa 4 ,
.Xr lpt 4 ,
.Xr pci 4 ,
.Xr pciide 4 ,
.Xr sb 4 ,
.Xr wss 4 ,
.Xr ym 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.5 .
