NetBSD/src/share/man/man4/man4.i386/rdcpcib.4
.\"	$NetBSD: rdcpcib.4,v 1.1 2011/04/04 17:26:24 bouyer Exp $
.\"
.\" Copyright (c) 2011 Manuel Bouyer.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 4, 2011
.Dt RDCPCIB 4
.Os
.Sh NAME
.Nm rdcpcib
.Nd RDC PCI/ISA bridge and watchdog timer driver
.Sh SYNOPSIS
.Cd "rdcpcib* at pci? dev ? function ?"
.Cd "isa0 at rdcide?"
.Sh DESCRIPTION
The
.Nm
driver supports the PCI/ISA bridge and watchdog timer as found in RDC's
vortex86 and PMX-1000 system on chip.
The watchdog timer may be configured for expiration periods between one and
512 seconds.
.Sh DIAGNOSTIC
.Bl -diag
.It "rdcpcib0: watchdog fired bit set, clearing"
A bit was set in the watchdog's timer registers indicating that it has reached
the configured timeout at last once.
This probably means this boot has been triggered by a watchdog timeout.
.El
.Sh SEE ALSO
.Xr wdogctl 8
