NetBSD/src/share/man/man4/man4.i386/vesafb.4
.\" $NetBSD: vesafb.4,v 1.2 2006/04/24 21:53:48 wiz Exp $
.\"
.\" Copyright (c) 2006 Jared D. McNeill <jmcneill@invisible.ca>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 24, 2006
.Dt VESAFB 4 i386
.Os
.Sh NAME
.Nm vesafb
.Nd VESA BIOS extensions 2.0 and above framebuffer device driver
.Sh SYNOPSIS
.Cd "vesafb* at vesabios?"
.Cd "wsdisplay* at vesafb? console ?"
.Pp
.Cd options VESAFB_WIDTH=640
.Cd options VESAFB_HEIGHT=480
.Cd options VESAFB_DEPTH=8
.Sh DESCRIPTION
.Nm
provides support for framebuffer consoles on i386 display adapters which
implement VESA BIOS extensions (VBE) 2.0 or above.
Since this interface is accessed via x86 BIOS calls, this driver
only works on the i386 port.
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 4.0 .
.Sh BUGS
The
.Nm
driver attaches to the console very early in the i386 boot process; since
.Fn consinit
is called before KVM86 is initialized, the
.Fn vesafb_cnattach
function assumes that hardware is present.
This causes the console to be blank until the
.Nm
driver attaches.
.Pp
.Nm
does not support VBE 1.2 and below, as they do not provide support for
linear framebuffers.
