NetBSD/src/share/man/man4/man4.i386/vesafb.4
.\" $NetBSD: vesafb.4,v 1.3 2006/08/17 01:58:26 reed Exp $
.\"
.\" Copyright (c) 2006 Jared D. McNeill <jmcneill@invisible.ca>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 16, 2006
.Dt VESAFB 4 i386
.Os
.Sh NAME
.Nm vesafb
.Nd VESA framebuffer device driver for wscons
.Sh SYNOPSIS
.Cd "vesabios* at vesabiosbus?"
.Cd "vesafb* at vesabios?"
.Cd "wsdisplay* at vesafb? console ?"
.Pp
.Cd options KVM86
.Cd options VESAFB_WIDTH=640
.Cd options VESAFB_HEIGHT=480
.Cd options VESAFB_DEPTH=8
.Cd options VESAFB_PM
.Sh DESCRIPTION
.Nm
provides support for framebuffer consoles on i386 display adapters which
implement VESA BIOS extensions (VBE) 2.0 or above.
It is used within the
.Xr wscons 4
console framework.
And its functions are available via the internal
.Xr wsdisplay 4
interface.
.Pp
Since this interface is accessed via x86 BIOS calls, this driver
only works on the i386 port.
.Pp
Supported kernel options:
.Bl -tag -width xxxx
.It Cd options KVM86
Required for vesabios.
This enables the framework for running BIOS code in
a virtual 8086 machine.
.It Cd options VESAFB_WIDTH=XXX
Sets the width, such as 640 or 1024.
Default is 640.
.It Cd options VESAFB_HEIGHT=XXX
Sets the height, such as 480 or 768.
Default is 480.
.It Cd options VESAFB_DEPTH=XX
Sets the bits per pixel, such as 8 or 16.
Default is 8.
.It Cd options VESAFB_PM
Enables the power management support by enabling the
WSDISPLAYIO_SVIDEO and WSDISPLAYIO_GVIDEO ioctl implementations.
.\" which
.\" .Xr wsfb 4
.\" should use when it decides to blank the display.
This is not enabled by default,
as in some cases it might cause the system to hang.
Tested on:
ATI Radeon M9 (failed),
NeoMagic 256AV (passed),
VIA VT8623 (failed).
.\" It currently defaults to 'standby' mode.
.El
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 4.0 .
.Sh BUGS
The
.Nm
driver attaches to the console very early in the i386 boot process; since
.Fn consinit
is called before KVM86 is initialized, the
.Fn vesafb_cnattach
function assumes that hardware is present.
This causes the console to be blank until the
.Nm
driver attaches.
.Pp
.Nm
does not support VBE 1.2 and below, as they do not provide support for
linear framebuffers.
.Pp
.Cd options VESAFB_PM
may cause some systems to hang.
