NetBSD/src/usr.bin/env/env.1
.\"	$NetBSD: env.1,v 1.17 2025/02/09 14:25:26 kre Exp $
.\"
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Institute of Electrical and Electronics Engineers, Inc.
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)printenv.1	6.7 (Berkeley) 7/28/91
.\"	$NetBSD: env.1,v 1.17 2025/02/09 14:25:26 kre Exp $
.\"
.Dd February 9, 2025
.Dt ENV 1
.Os
.Sh NAME
.Nm env
.Nd set and print environment
.Sh SYNOPSIS
.Nm
.Op Fl 0i
.Op Fl C Ar dir
.Op Fl u Ar name
.Op Fl Fl
.Op Ar name=value ...
.Op Fl Fl
.Oo
.Ar utility
.Op Ar argument ...
.Oc
.Sh DESCRIPTION
.Nm
executes
.Ar utility ,
with the given
.Ar argument Ns s ,
after modifying the environment as
specified on the command line.
Each
.Ar name=value
option specifies
an environment variable,
.Ar name  ,
with a value of
.Ar value
which may be empty,
that is to replace an existing environment variable
with the same
.Ar name ,
or otherwise is to be added to the environment.
.Pp
The
.Sq Fl i
option causes
.Nm
to completely ignore the environment
it inherits.
.Pp
The
.Sq Fl C Ar dir
option causes the working directory to be changed to
.Ar dir ,
and the environment variable
.Ev PWD
to be removed from the environment.
.Pp
The
.Sq Fl u Ar name
option causes removal of the
.Ar name
environment variable if it is in the environment.
This is similar to the
.Ic unset
command in
.Xr sh 1 .
The value for
.Ar name
must not include the
.Ql =
character.
.Pp
To allow for either a
.Ar name
to be added to the environment, or the
.Ar utility Ns 's
name (if no environment additions are present),
to begin with a minus sign
.Pq Sq \&\-
the first
.Dq Fl Fl
argument is required.
To allow for
.Ar utility Ns 's
name to contain an equals character
.Pq Sq \&=
(anywhere in its word)
the second
.Dq Fl Fl
is required.
If there are no
.Ar name=value
arguments given, then to allow for
.Ar utility
to contain an equals character, both
.Dq Fl Fl
arguments are required.
The first ends the options, the second ends
the (in this case empty) environment variable additions.
.Pp
If no
.Ar utility
is specified,
.Nm
prints out the names and values of the variables in the environment.
Each
.Ar name=value
pair is separated by a new line unless
.Fl 0
is specified, in which case name/value pairs are separated by a nul
character
.Pq Sq \&\e0 .
The
.Fl 0
option is ignored if a
.Ar utility
is given.
.Sh EXIT STATUS
If a
.Ar utility
is specified, can be located, and successfully
invoked, the exit status of
.Nm
is the exit status of the
.Ar utility .
See its documentation for the possible values and interpretations.
.Pp
Otherwise
.Nm
exits with one of the following values:
.Bl -tag -width Ds
.It 0
No
.Ar utility
was specified, and
.Nm
has successfully written the contents of the
.Pq possibly modified
environment to standard output.
.It 125
.Nm
was given an invalid option,
a requested operation failed,
or some other error occurred.
.It 126
.Ar utility
was found, but could not be invoked.
.It 127
.Ar utility
could not be found.
.El
.Pp
Whenever
.Nm
exits with a non-zero status, without having invoked a
.Ar utility ,
it writes a message to the standard error stream
identifying itself, and the reason for the non-zero exit.
This can help distinguish cases where
.Nm
exits because of a problem, from when
.Ar utility
does so.
The case of a zero exit status is simpler;
if a
.Ar utility
was given on the command line, the zero status
is from that utility, otherwise it is from
.Nm .
.Sh COMPATIBILITY
The historic
.Fl
option has been deprecated but is still supported in this implementation.
.Pp
The
.Fl C , u
and
.Fl 0
options are non-standard extensions.
.Sh SEE ALSO
.Xr chdir 2 ,
.Xr execvp 3 ,
.Xr environ 7
.Sh STANDARDS
The
.Nm
utility conforms to
.St -p1003.2-92 .
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.4 .
.Pp
The
.Fl u
and
.Fl 0
options first appeared in
.Nx 10 ,
after earlier appearing in other systems.
.Pp
The
.Fl C
option first appeared in
.Nx 10.1 .
