NetBSD/src/usr.sbin/cnwctl/cnwctl.8
.\"	$NetBSD: cnwctl.8,v 1.2 1999/11/29 12:55:07 itojun Exp $
.\"
.\" Copyright (c) 1997 Berkeley Software Design, Inc. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that this notice is retained,
.\" the conditions in the following notices are met, and terms applying
.\" to contributors in the following notices also apply to Berkeley
.\" Software Design, Inc.
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by
.\"	Berkeley Software Design, Inc.
.\" 4. Neither the name of the Berkeley Software Design, Inc. nor the names
.\"    of its contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY BERKELEY SOFTWARE DESIGN, INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL BERKELEY SOFTWARE DESIGN, INC. BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	PAO2 Id: cnwctl.8,v 1.1.1.1 1997/12/11 14:46:06 itojun Exp
.\"
.Dd January 5, 1997
.Dt CNWCTL 8
.Os
.Sh NAME
.Nm cnwctl
.Nd display statistics and control Netwave AirSurfer PC Cards
.Sh SYNOPSIS
.Nm cnwctl
.Op Fl d Ar domain
.Op Fl i Ar interface
.Op Fl k Ar scramble-key
.Op Fl sS Op Ar rate
.Sh DESCRIPTION
The
.Nm cnwctl
utility is used to control Netwave AirSurfer PC Cards as well as
display statistics.
The following options are available:
.
.Bl -tag -width indent
.It Fl d
Set the domain of the card to
.Ar domain .
The domain must be between 0x000 and 0x1ff.
The domains 0x000 through 0x0ff are for access to an add-hoc network.
The domains 0x100 through 0x1ff are for access to a Netwave Access Point.
The default domain is 0x000.
A card may only talk to the access point in its domain, or other cards
in its add-hoc domain.
.It Fl i
Use
.Ar interface
as the interface rather than
.Li cnw0 .
.It Fl k
Set the scramble key to
.Ar scramble-key .
The scramble key must be between 0x0000 and 0xffff.
Both the source and the destination must use the same scramble key
in order to communicate.
.It Fl s
Display statistics.
When the optional argument
.Ar rate
(which must be the last argument to the end of the command line)
is specified as a non-zero value, statistics will be displayed
every
.Ar rate
seconds.
At the top of each
.Dq page
of statistics, column labels will be displayed.  The first row of
statistics will be totals since boot, subsequent lines are deltas
from the previous row.
If
.Ar rate
is not specified, or is 0 (zero), a single page of statistics will be
displayed.  These statistics are more detailed and include:
.Bl -tag -width indent
.It domain
The domain this card is part of.
.It rx
Number of packets received.
.It rxoverflow
Number of overflows detected.
.It rxoverrun
Number of overruns detected.
.It rxcrcerror
Number of CRC errors detected.
Random noise can cause these errors.
.It rxframe
Number of framing errors detected.
.It rxerrors
Number of generic errors detected.
.It rxavail
Number of times a packet was available.
.It tx
Number of packets requested to be sent.
.It txokay
Number of packets sent.
.It txabort
Number of packets aborted (not sent within 9 tries).
.It txlostcd
Number of times carrier detect was lost.
.It txerrors
Number of generic transmit errors detected.
.It txretries
Total number of retries.
.It Ar N Ns No x retries
Number of packets which were retried
.Ar N
times.
.El
.It Fl S
Display status read from the hardware.  This option is only available
to the super user.
The
.Ar rate
argument is used as with the
.Fl s
option.
The following fields are displayed
.Bl -tag -width indent
.It link integrity field (lif)
A 0 value implies no links.
.It connection quality (cq)
Probably indicates the quality of the connection to the access point.
.It spu
Unknown meaning.
.It link quality (lq)
Probably indicated the quality of the link to the access point.
.It hhc
Unknown meaning.
.It mhs
Unknown meaning.
.It revision
The revision numbers of the card.
.It id
The ID of the card.
.El
.El
.Sh SEE ALSO
.Xr cnw 4
