NetBSD/src/share/man/man8/man8.alpha/boot.8
.\" $NetBSD: boot.8,v 1.2 2000/06/14 06:49:19 cgd Exp $
.\"
.\" Copyright (c) 1999 Christopher G. Demetriou.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christopher G. Demetriou
.\"      for the NetBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.\" Copyright (c) 1990, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
.\" Science Department.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"     This product includes software developed by the University of
.\"     California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)boot_hp300.8        8.2 (Berkeley) 4/19/94
.\"
.Dd April 5, 1999
.Dt BOOT 8 alpha
.Os
.Sh NAME
.Nm boot
.Nd Alpha system bootstrapping procedures
.Sh DESCRIPTION
When the
.Nx Ns Tn /alpha
kernel is booted normally
it initializes itself and proceeds to start the system.  An automatic
consistency check of the file systems takes place, and unless this
fails, the system comes up to multi-user operation.  The proper way
to shut the system down is with the
.Xr shutdown 8
command.
.Pp
If the system crashes, it will enter the kernel debugger,
.Xr ddb 8 ,
if it is configured in the kernel.
If the crash occurred during
initialization and the debugger is not present or is exited, the
kernel will halt the system.
If the crash occurred during normal operation and the debugger
is not present or is exited, the system will attempt a dump to the
configured dump device (which will be automatically recovered with
.Xr savecore 8
during the next boot cycle), and after the dump is complete (successful
or not) the kernel will attempt a reboot.
.\" XXX .Pp
.\" XXX .Ss Use of SRM Console
.\" XXX .Pp
.\" XXX console is used to bootstrap system
.\" XXX .Pp
.\" XXX boot flags, boot file
.\" XXX .Pp
.\" XXX console device names
.\" XXX .Pp
.\" XXX .Ss Console Behavior at Power-on, Halt, and Reboot
.\" XXX .Pp
.\" XXX auto_action variable
.\" XXX .Pp
.\" XXX .Ss System Bootstrapping Procedure
.\" XXX .Pp
.\" XXX boot environment
.\" XXX .Pp
.\" XXX primary/secondary vs. unified bootstrap
.Sh FILES
.Bl -tag -width /usr/mdec/bootxx_cd9660 -compact
.It Pa /netbsd
default system kernel
.It Pa /usr/mdec/bootxx_cd9660
primary bootstrap for
.Dq cd9660
(ISO 9660) file system
.It Pa /usr/mdec/bootxx_ffs
primary bootstrap for
.Dq ffs
file system
(Berkeley Fast File System)
.It Pa /usr/mdec/boot
secondary bootstrap
.It Pa /usr/mdec/netboot
network bootstrap
.It Pa /usr/mdec/ustarboot
.Dq ustar
disk and tape bootstrap
.It Pa /boot
secondary bootstrap (installed)
.El
.Sh SEE ALSO
.Xr ddb 4 ,
.Xr savecore 8 ,
.Xr shutdown 8 ,
.Xr installboot 8 ,
.Xr mkbootimage 8 ,
.Xr setnetbootinfo 8
.Rs
.%T "Alpha Architecture Reference Manual Third Edition"
.%Q "Alpha Architecture Committee"
.%I "Digital Press"
.%D 1998
.Re
.Sh BUGS
The device names used by
.Nx Ns Tn /alpha
and the
.Tn SRM Console
often have no relation to each other.
