NetBSD/src/share/man/man8/man8.alpha/installboot.old.8
.\" $NetBSD: installboot.old.8,v 1.14 2001/09/18 18:46:39 jdolecek Exp $
.\"
.\" Copyright (c) 1996, 1997, 1999
.\"      Christopher G. Demetriou.  All rights reserved.
.\" Copyright (c) 1995 Paul Kranenburg
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Paul Kranenburg.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 4, 1999
.Dt INSTALLBOOT.OLD 8 alpha
.Os
.Sh NAME
.Nm installboot.old
.Nd install bootstrap software
.Sh SYNOPSIS
.Nm installboot.old
.Op Fl nv
.Fl b Ar bn
.Ar boot
.Ar bootxx
.Ar rawdiskdevice
.Sh DESCRIPTION
.Bf -symbolic
This program has been obsoleted by
.Xr installboot 8
and should only be used to configure boot blocks for
.Dq ustarfs
booting.  Use it at your own risk.
.Ef
.Pp
The options recognized by
.Nm
are as follows:
.Bl -tag -width -b\ bn
.It Fl n
Do not actually write anything on the disk.
.It Fl v
Verbose mode.
.It Fl b Ar bn
This flag and argument are required.  Assume that
.Pa boot
is contiguously present with initial block number
.Ar bn .
.El
.Pp
The arguments are:
.Bl -tag -width rawdiskdevice
.It Ar boot
The name of the second-stage boot program in the file system
where the first-stage boot program is to be installed.
.It Ar bootxx
The name of the prototype file for the first-stage boot program.
.It Ar rawdiskdevice
The name of the device corresponding to the raw whole-disk partition (the
.Dq raw partition )
of the disk on which the first-stage boot program is to be installed.
.El
.Sh SEE ALSO
.Xr boot 8 ,
.Xr installboot 8
.Sh HISTORY
This version of the
.Nx Ns Tn /alpha
.Nm installboot
command first appeared in
.Nx 1.2 .
In
.Nx 1.4
it was replaced with a new version, and this
version was renamed to
.Nm installboot.old .
