NetBSD/src/usr.bin/audio/record/audiorecord.1
.\"	$NetBSD: audiorecord.1,v 1.2 1999/03/26 15:46:22 mrg Exp $
.\"
.\" Copyright (c) 1998 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 20, 1998
.Dt AUDIORECORD 1
.Os NetBSD
.Sh NAME
.Nm audiorecord
.Nd record audio files
.Sh SYNOPSIS
.Nm
.Op Fl afhV
.Op Fl b Ar balance
.Op Fl C Ar ctl
.Op Fl d Ar device
.Op Fl e Ar encoding
.Op Fl i Ar info
.Op Fl m Ar monvol
.Op Fl P Ar precision
.Op Fl p Ar input
.Op Fl s Ar rate
.Op Fl t Ar time
.Op Fl v Ar volume
.Op files
.Sh DESCRIPTION
The
.Nm
program copies the name audiofiles, or the standard input if no files are
named, to the audio device.  The input files must contain a valid audio
header, and the encoding must be understood by the underlying driver.
.Sh OPTIONS
The following options are available:
.Bl -tag -width 123456
.It Fl a
Append to the specified file, rather than overwriting.
.It Fl b
Set the balance to
.Ar balance .
This value must be between 0 and 63.
.It Fl C
Set the audio control device to be
.Ar ctl .
The default is
.Pa /dev/audioctl0 .
.It Fl d
Set the audio device to be
.Ar device .
The default is
.Pa /dev/audio0 .
.It Fl e
Set encoding to either
.Dq alaw ,
.Dq ulaw
or
.Dq linear .
.It Fl f
Force.  Normally when appending to audiofiles using the
.Fl a
option, the sample rates must match.  The
.Fl f
option will allow a discrepancy to be ignored.
.It Fl h
Print a help message.
.It Fl i
If the audio device cannot be opened, exit now rather than wait for it.
.It Fl m
Set the monitor volume.
.It Fl P
Set the precision.  This value is the number of bits per sample, and is
normally either
.Dq 8
or
.Dq 16 ,
though the values
.Dq 24
and
.Dq 32
are also valid.
.It Fl p
Set the output port to
.Ar port .
The valid values of
.Ar port
are
.Dq speaker ,
.Dq headphone
and
.Dq line .
.It Fl s
Set the sampling rate.  This value is per-second.  Typical values are
8000, 44100 and 48000, which are the telephone, CD Audio and DAT Audio
default sampling rates.
.It Fl q
Be quiet.
.It Fl V
Be verbose.
.It Fl v
Set the volume (gain) to
.Ar volume .
This value must be between 0 and 255.
.Sh BUGS
Many audio device hardware is limited in capabilities.  Any attempt
to use an audio device beyond it's capabilities will result in an
error.  This program is not finished and will become much more
versatile in it's understanding of the audio device and the desired
output.
.Sh HISTORY
The
.Nm
program was first seen in SunOS 5.  The
.Nx
.Nm
was first made available in
.Nx 1.4 .
.Sh AUTHOR
The
.Nm
program was written by Matthew R. Green <mrg@eterna.com.au>.
.Sh SEE ALSO
.Xr audioctl 1 ,
.Xr audioplay 1 ,
.Xr audio 4 .
