NetBSD/src/share/man/man4/man4.pmax/dc.4
.\"
.\" Copyright (c) 1996 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$Id: dc.4,v 1.1 1996/08/11 02:28:58 jonathan Exp $
.\"
.Dd August 6, 1996
.Dt DC 4 pmax
.Os NetBSD 1.2a
.Sh NAME
.Nm dc
.Nd
dc659,dc7085 DZ11-on-a-chip serial communications interface 
.Sh SYNOPSIS
.Cd "dc0 at ioasic?"
.Cd "dc0 at mainbus"
.Cd "dc1 at mainbus"
.Cd "dc2 at mainbus"
.Cd "dc0 at vsbus"
.Sh DESCRIPTION
THe
.Nm
driver provides support for Digital's dc7085 four-port serial
communcations chip.
The
.Nm dc
driver supports dc7085 hardware on attached to the following
parent devices:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It mainbus
baseboard device on Decstation 2100, 3100, and 5100,
and optional expansion devices on the 5100.
.It ioasic
baseboard device on Decstation 5000/200.
.It vsbus
baseboard devices on the Vaxstation 2000 and 3100.
.El
.Pp
The
.Nm
device is essentially a single-chip clone of the DZ-11.
It has a small input silo shared across all input ports.
Model control lines are present on two of the four ports.
The device does not interrupt on modem transitions; instead,
they are detected via polling.
Only two lines on  a baseboard dc7085 have modem control signals; the
other two are wired for a keyboard and mouse.
On some implementations, only partial modem control (sufficent for
Unix dialup) is provided, while others provide full modem control.
Speeds greater than 19200 are not supported. The 19200 speed is rumoured
to actually be 19600, presumably for bug-compatibility with the DZ-11.
.Pp
.Sh HISTORY
The
.Nm
driver
first appeared in
.Bx 4.4 /pmax. Support for Vax implementations is
.Ud .
.Sh BUGS
The Decstation 5000 can set a bit in the system register
to allow the
.Nm 
to run at 38400, but this applies to all four lines and disables
the 19200 speed.  This feature is not currently supported.
.Pp
The driver should probably support the original DZ-11, DZ-32,
 and Qbus DZV-11 and DZQ-11 clones.



