NetBSD/src/share/man/man4/man4.pmax/dc.4
.\"
.\" Copyright (c) 1996 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$NetBSD: dc.4,v 1.7 1999/04/06 20:24:49 pk Exp $
.\"
.Dd February 20, 1998
.Dt DC 4 pmax
.Os
.Sh NAME
.Nm dc
.Nd
dc659, dc7085 DZ11-on-a-chip serial communications interface 
.Sh SYNOPSIS
.Cd "dc0 at ioasic?"
.Cd "dc0 at mainbus"
.Cd "dc1 at mainbus"
.Cd "dc2 at mainbus"
.Sh DESCRIPTION
The
.Nm
driver provides support for Digital's dc7085 four-port serial
communcations chip.
The
.Nm dc
driver supports dc7085 hardware on attached to the following
parent devices:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It mainbus
baseboard device on DECstation 2100, 3100, and 5100,
and optional expansion devices on the 5100.
.It ioasic
baseboard device on DECstation 5000/200.
.It vsbus
baseboard devices on the VAXstation 2000 and 3100.
.El
.Pp
The
.Nm
device is in essence a single-chip clone of the DZ-11.
The DZ-11 hardware design severely constrains performance because
it has one small input silo that is shared across all ports.
The 
.Nm dc
hardware does not interrupt on modem transitions; instead,
they must be detected by polling the device.
Only two ports on a baseboard 
.Nm dc
device have any modem control signals;
the other two ports are wired for a keyboard and mouse.
.Sh BUGS
On some implementations (e.g. DECstation 3100), the hardware does not
bring out modem flow-control signals (RTS/CTS) to the bulkhead;
only modem carrier transition are provided.
This is adequate for
.Ux
dialin and dialout detection, but without hardware flow control, the
.Nm
device is prone to input silo overruns when used for serial-line
protocols at high speed.
The DECstation 5000/200 
.Nm
hardware provides full modem control on both bulkhead RS-232 ports
and is thus less prone to input silo overrun.
.Pp
The 19200 speed on all
.Nm
devices is actually implemented as 19800,
presumably for bug-compatibility with the original DZ-11.
This is a hardware "feature" and cannot be corrected in software.
Many serial devices at 19200 fail to interoperate with the
.Nm
at its 19800 speed setting.
.Pp
The DECstation 5000/200 can set a bit in the system register to allow the
.Nm 
to run at 38400, but this applies to all four ports and disables
the 19200 speed on all four ports.
This feature is not currently supported.
.Pp
The 
.Nm
driver should be merged into a single driver supporting the original
DZ-11, DZ-32, and Qbus DZV-11 and DZQ-11 clones.
.Sh HISTORY
The
.Nm
driver
first appeared in
.Bx 4.4 /pmax .
This manual page first appeared in 
.Nx 1.2 .
