NetBSD/src/share/man/man4/man4.pmax/dtop.4
.\"     $NetBSD: dtop.4,v 1.1 2001/09/21 09:11:46 gmcgarry Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 18, 2001
.Dt DTOP 4 pmax
.Os
.Sh NAME
.Nm dtop
.Nd DECstation 5000/xx keyboard and mouse driver
.Sh SYNOPSIS
.Cd "dtop* at ioasic? offset ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the keyboard and mouse found on the
DECstation 50000/xx.
.Pp
The keyboard and mouse are actually connected to an external
peripheral bus.  This bus is sometimes referred to as the ``serial
bus'' or as it later become known, the ``ACCESS bus''.  The bus
supports multiple devices and dynamic attaching and detaching of
devices.  The
.Nm
driver does not currently support these facilities.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr ioasic 4
.Sh BUGS
The
.Nm
driver should be replaced with a machine-independent implementation,
supporting all additional facilities.  It should make use of the
.Xr wscons 4
machine-independent console interface.
