NetBSD/src/share/man/man4/man4.pmax/ioasic.4
.\"
.\" Copyright (c) 1996 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$NetBSD: ioasic.4,v 1.3 1997/10/13 11:23:50 lukem Exp $
.\"
.Dd August 6, 1996
.Dt IOASIC 4 pmax
.Os NetBSD 1.2
.Sh NAME
.Nm ioasic
.Nd
turbochannel SCSI adaptor
.Sh SYNOPSIS
.Cd "ioasic? at mainbus"
.Sh DESCRIPTION
The
.Nm
driver provides support for the DEC proprietary IOCTL asic found on
Decstation 5000  series machines (excluding the 5000/200), and on
Turbochannel-based Alphas.   On these machines (including the
5000/200), all baseboard  devices should be configured as children
of the
.Nm ioasic .
The
.nm
provides hardware DMA channels and interrupt support for
several baseboard devices, including one
.Nm asc
scsi device with a scatter/gather DMA channel, up to two
.Nm scc
devices, a
.Nm tc
turbochannel expansion bus with  two, three, or six slots.
.Pp
The
.Nm
is also used for theose 
floppy-disc drive and audio/ISDN hardware
on the Personal Decstation and Alpha.
.Nm
hardware is used to interface to
a
scatter-gather DMA channel.
.Pp
Support for scatter-gather DMA eliminates the need for copying.
A baseboard
.Nm asc
SCSI adaptor attached to an
.Nm ioasic 
will give slightly better performance than its
.Nm tc
counterpart.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr clock 4 ,
.Xr asc 4 ,
.Xr le 4 ,
.Xr scc 4 ,
.Xr tc 4 .
.Sh HISTORY
The
.Nm
driver
first appeared in
.Nx 1.1 ,
derived from the
.Sh BUGS
The Decstation 5000/200 does not actually have an
.Nm ioasic
chip, but for consistency it must be configured as if it
did.

