NetBSD/src/share/man/man4/man4.pmax/px.4
.\"
.\" Copyright (c) 1997 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$NetBSD: px.4,v 1.6 1999/08/25 09:25:42 ad Exp $
.\"
.Dd April 26, 1999
.Dt PX 4 pmax
.Os
.Sh NAME
.Nm px
.Nd
TURBOchannel ``PixelStamp'' accelerated graphics boards
.Sh SYNOPSIS
.Cd "px* at tc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn DEC
.Tn PixelStamp 
video display option cards:
.Pp
.Bl -tag -width 10n -offset indent -compact
.It Sy PX
(PMAG-C) 8 plane, 2D
.It Sy PXG
(PMAG-D) 8 plane, 3D, 128kB SRAM
.It Sy PXG+
(PMAG-E) 24 plane, 3D, 128kB SRAM
.It Sy PXG+ Turbo
(PMAG-F) 24 plane, 3D, 256kB SRAM, Z-Buffer
.El
.Pp
.Tn PixelStamp
based cards do not provide direct framebuffer access but instead use
a packet-based protocol to communicate with the stamp, which in turn
manipulates the framebuffer. 
.Pp
.Sh SEE ALSO
.Xr rcons 4 ,
.Xr tc 4 .
.Sh BUGS
Interrupt handling, packet queuing and hardware clipping for the
.Nm PXG
are totally broken. Support for the
.Nm i860
co-processor must first be added.
.Pp
The X server is a work in progress.
.Pp
3D geometry acceleration is not supported, and probably never will be.
.Sh AUTHOR
Andy Doran
.Aq ad@netbsd.org ,
Jonathan Stone
.Aq jonathan@netbsd.org .
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.3 .
