NetBSD/src/share/man/man4/man4.pmax/px.4
.\"
.\" Copyright (c) 1997 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$NetBSD: px.4,v 1.4 1999/03/16 01:19:22 garbled Exp $
.\"
.Dd November 11, 1997
.Dt PX 4 pmax
.Os
.Sh NAME
.Nm px
.Nd
TurboChannel PMAG-C 2-D accelerated graphics board
.Sh SYNOPSIS
.Cd "px* at tc?"
.Sh DESCRIPTION
The
.Nm
driver provides minimal support for a
.Tn DEC
.Tn PMAG-C
video display option card.
The
.Nm
driver does nothing except remove the requirement to remove
.Tn PMAG-C 
cards in order to boot
.Nx . 
It offers no support for either raster consoles or X11 servers
because doing either requires using the undocumented packet protocol
used to talk to the on-board blitter chip.
.Pp
.Sh SEE ALSO
.Xr rcons 4 ,
.Xr tc 4 ,
.Xr ws 4 .
.Sh BUGS
Console output support and X11 server support should be implemented.
This implementation waits on documentation of the blitter chip protocol.
.Pp
The
.Nm rcons
glass-tty raster framebuffer console driver assumes direct bit
read/write access to a framebuffer.
The
.Nm
hardware does not provide this.
.Nm rcons 
should be replaced with a driver that allows a character-painting
interface as well as direct blitting.
.Pp
The only known X server is an Ultrix binary which requires emulation
of the
.Tn Ultrix
Xws ABI.
Work on this is in progress.
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.3 .
