NetBSD/src/share/man/man4/man4.pmax/rz.4
.\"
.\" Copyright (c) 1996 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$NetBSD: rz.4,v 1.4 2000/07/05 16:13:52 msaitoh Exp $
.\"
.Dd March 24, 1998
.Dt RZ 4 pmax
.Os
.Sh NAME
.Nm rz
.Nd
SCSI Common Command Set (CCS) Disk driver
.Sh SYNOPSIS
.Cd "rz0 at oldscsibus? target? drive ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for SCSI Common Command Set (CCS) disk drives.
The driver name was changed from "sd" to "rz" for
.Tn DEC
naming compatibility.
.Pp
Bits fields in the minor device number are interpreted as follows:
.Bl -tag -width xxxx
.It 0xF8
These bits are the
.Nm
disk unit number.
.It 0x03
These bits are the
.Nm
disk partition number.
.El
.Pp
The following
.Xr ioctl 2
calls are supported:
.Bl -tag -width SDIOCSCSICOMMAND
.It Dv DIOCGDEFLABEL
.It Dv DIOCGDINFO
.It Dv DIOCGPART
.It Dv DIOCSDINFO
.It Dv DIOCWDINFO
.It Dv DIOCWLABEL
.It Dv SDIOCGFORMAT
.It Dv SDIOCSCSICOMMAND
.It Dv SDIOCSENSE
.It Dv SDIOCSFORMAT
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr tz 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr cd 4 ,
.Xr ch 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Bx 4.4 .
