NetBSD/src/share/man/man4/man4.pmax/tc.4
.\"
.\" Copyright (c) 1996, 1997 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$NetBSD: tc.4,v 1.6 1999/03/16 01:19:22 garbled Exp $
.\"
.Dd August 6, 1996
.Dt TC 4 pmax
.Os
.Sh NAME
.Nm tc
.Nd
TurboChannel expansion bus adaptor
.Sh SYNOPSIS
.Cd "tc? at mainbus"
.Sh DESCRIPTION
The
.Nm
driver provides support for the DEC TurboChannel expansion bus on
DECstation 5000 series machines.
TurboChannel is a 32-bit wide synchronous DMA-capable bus, running
at 25 MHz on higher-end machines and at 12.5 MHz on lower-end machines.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr asc 4 ,
.Xr ioasic 4 ,
.Xr le 4 ,
.Xr cfb 4 ,
.Xr sfb 4 ,
.Xr mfb 4 ,
.Xr px 4 .
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.1 .
.Sh BUGS
The
.Nm
driver makes poor use of interrupt priority on the 5000/1xx series.
