NetBSD/src/share/man/man4/man4.pmax/tz.4
.\"
.\" Copyright (c) 1996 Jonathan Stone.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Jonathan Stone.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	$NetBSD: tz.4,v 1.4 2000/07/05 16:13:52 msaitoh Exp $
.\"
.Dd March 24, 1998
.Dt TZ 4 pmax
.Os
.Sh NAME
.Nm tz
.Nd
SCSI Common Command Set (CCS) Tape driver
.Sh SYNOPSIS
.Cd "tz0 at oldscsibus? target? drive ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for SCSI Common Command Set (CCS) tape drives,
including the
.Tn DEC
.Tn TK50 ,
.Tn Exabyte
.Tn EXB-8200 ,
.Tn Archive
.Tn "Viper 150" , 
.Tn Archive
.Tn Python ,
and the
.Tn HP35450A
DAT drive.
Additional generic SCSI tape drives may work as well.
.Pp
Bits fields in the minor device number are interpreted as follows:
.Bl -tag -width xxxx
.It 0xF0
These four bits are the
.Nm
unit number.
.It 0x01
Do not rewind tape on device
.Xr close 2 .
.It 0x02
Use "high density" if the drive supports it.
.It 0x04
.Dv TZ_EXSFMK
Reserved For Future Use.
.It 0x08
Access the drive in fixed block mode - allows random access.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr rz 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr cd 4 ,
.Xr ch 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Bx 4.4 .
