NetBSD/src/usr.sbin/fstyp/fstyp.8
.\" $NetBSD: fstyp.8,v 1.2 2018/01/09 09:41:29 wiz Exp $
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" Copyright (c) 2016 The DragonFly Project
.\" Copyright (c) 2014 The FreeBSD Foundation
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Tomohiro Kusumi.
.\"
.\" This software was developed by Edward Tomasz Napierala under sponsorship
.\" from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd November 25, 2017
.Dt FSTYP 8
.Os
.Sh NAME
.Nm fstyp
.Nd determine file system type
.Sh SYNOPSIS
.Nm
.Op Fl lsu
.Ar special
.Sh DESCRIPTION
The
.Nm
utility is used to determine the file system type on a given device.
It can recognize ISO-9660, Ext2, FAT, NTFS, and UFS file systems.
When the
.Fl u
flag is specified,
.Nm
also recognizes certain additional metadata formats that cannot be
handled using
.Xr mount 8 ,
such as ZFS pools.
.Pp
The file system name is printed to the standard output
as, respectively:
.Bl -item -offset indent -compact
.It
cd9660
.It
ext2fs
.It
msdosfs
.It
ntfs
.It
ufs
.It
zfs
.El
.Pp
Because
.Nm
is built specifically to detect file system types, it differs from
.Xr file 1
in several ways.
The output is machine-parsable, file system labels are supported,
and it does not try to recognize any file format other than file systems.
.Pp
These options are available:
.Bl -tag -width ".Fl l"
.It Fl l
In addition to file system type, print file system label if available.
.It Fl s
Ignore file type.
By default,
.Nm
only works on regular files and disk-like device nodes.
Trying to read other file types might have unexpected consequences or hang
indefinitely.
.It Fl u
Include file systems and devices that cannot be mounted directly by
.Xr mount 8 .
.El
.Sh EXIT STATUS
The
.Nm
utility exits 0 on success, and >0 if an error occurs or the file system
type is not recognized.
.Sh SEE ALSO
.Xr file 1 ,
.Xr autofs 5 ,
.Xr mount 8 ,
.Xr zpool 8
.Sh HISTORY
The
.Nm
command appeared in
.Fx 10.2 .
The
.Nm
command appeared in
.Dx 4.5 .
The
.Nm
command appeared in
.Nx 9.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
utility was developed by
.An Edward Tomasz Napierala Aq Mt trasz@FreeBSD.org
under sponsorship from the
.Fx
Foundation.
ZFS and GELI support was added by
.An Allan Jude Aq Mt allanjude@FreeBSD.org .
.Pp
The
.Nm
utility was ported to
.Dx
and
.Nx
by
.An Tomohiro Kusumi Aq Mt kusumi.tomohiro@gmail.com .
.Sh BUGS
geli and hammer are currently unsupported on
.Nx .
