NetBSD/src/sbin/devfsd/devfsd.8
.\" 	$NetBSD: devfsd.8,v 1.1.2.1 2008/02/18 22:07:02 mjf Exp $
.\"
.\" Copyright (c) 2007 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Matt Fleming.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 8, 2007
.Dt DEVFSD 8
.Sh NAME
.Nm devfsd
.Nd Create device special files in a device file system
.Sh SYNOPSIS
.Nm
.Op Fl iv
.Sh DESCRIPTION
.Nm
is a daemon that controls the device special
nodes in a
.Tn devfs
file system.
.Nm
is started at boot time and monitors device insertion
and removal via the
.Xr dctl 4
device driver. When a device is attached 
to the system is it run against rules specifed in the
config file. If no config file is specified 
.Pa /etc/devfsd.conf
is used. See 
.Xr devfsd.conf 5 . 
.Nm
interacts with the kernel via
.Xr dctl 4
in order to create device special files.
The options are as follows:
.Bl -tag
Read rules from the specified configuration file.
.It Fl i
Set the default visibility of device special nodes to invisible.
.It Fl v
Set the default visibility of device special nodes to visible.
.El
.Sh FILES
.Pa /etc/devfsd.conf
.Sh SEE ALSO
.Xr dctl 4 ,
.Xr devfsd.conf 5
.Sh HISTORY
The
.Nm
daemon first appeared in
.Nx 5.0 .
.Sh AUTHORS
The
.Nm
daemon was implemented by
.An Matt Fleming.

