NetBSD/src/share/man/man8/man8.pmax/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.pmax/MAKEDEV and
.\" *** src/share/man/man8/man8.pmax/MAKEDEV.8.template
.\" *** 
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\"	$NetBSD: MAKEDEV.8,v 1.2.2.1 2000/06/22 16:17:43 minoura Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: @(#)makedev.8	8.1 (Berkeley) 6/5/93
.\"
.Dd December 28, 1995
.Dt MAKEDEV 8 pc532
.Os
.Sh NAME
.Nm makedev
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create
the common special
files.
.\" See
.\" .Xr special 8
.\" for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments,
where the names are the common abbreviation for
the device.  There are several special device names:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
All known devices, including local devices.
.It Ar minimal
A minimal set of devices for install disks, etc.
.It Ar std
Standard devices
.It Ar local
Configuration specific devices
.El
.Pp
The pmax port supports the following devices.
Where a device name is followed by a hash
sign ("#"), the hash sign must be replaced
by a unit number.
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar tz#
SCSI tapes, DEC TK50 cartridge tape, see
.Xr tz 4 
. It Ar st#
MI SCSI tape drives, see
.Xr st 4 
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar rz#
SCSI disks, see
.Xr rz 4 
. It Ar ccd#
Concatenated disk driver, see
.Xr ccd 4 
. It Ar cd#
MI SCSI cdroms, see
.Xr cd 4 
. It Ar md#
Memory pseudo-disk devices, see
.Xr md 4 
. It Ar raid#
RAIDframe disk driver, see
.Xr raid 4 
. It Ar sd#
MI SCSI disks, see
.Xr sd 4 
. It Ar vnd#
``file'' pseudo-disks, see
.Xr vnd 4 
. El
.It Terminal multiplexors:
. Bl -tag -width 0123456789 -compact
. It Ar dc#
4 channel serial interface (keyboard, mouse, modem, printer), see
.Xr dc 4 
. It Ar scc#
82530 serial interface, see
.Xr scc 4 
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr pty 4 
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar audio#
Phone-quality audio on Personal DECstations, see
.Xr audio 4 
. It Ar bpf#
Packet filter, see
.Xr bpf 4 
. It Ar ch#
SCSI media changer, see
.Xr ch 4 
. It Ar fd
File descriptors (/dev/fd/*)
. It Ar ipl
IP packet filter
. It Ar lkm
Loadable kernel modules interface (unsupported in 1.3_ALPHA), see
.Xr lkm 4 
. It Ar random
Random number generator
. It Ar scsibus#
SCSI busses, see
.Xr scsictl 8 ,
.Xr scsi 4 
. It Ar ss#
MI scsi scanners, see
.Xr ss 4 
. It Ar tun#
Network tunnel driver, see
.Xr tun 4 
. It Ar uk#
MI unknown scsi devices, see
.Xr uk 4 
. El
.It Platform-specific devices:
. Bl -tag -width 0123456789 -compact
. It Ar NOTE:
/dev/mouse should be a link to one of these for X windows.
. It Ar fb#
Generic framebuffer pseudo-device
. It Ar px#
PixelStamp Xserver access, see
.Xr px 4 
. El
.It The following names are reserved for future use:
. Bl -tag -width 0123456789 -compact
. It Ar fdc#
Baseboard 2.88 floppy disk on Personal DECstations
. It Ar ttyE?
Workstation console (``wscons'') glass-tty emulators
. El
.El
.Pp
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.\" .Xr special 8
