NetBSD/src/usr.sbin/greconfig/greconfig.8
.\" $NetBSD: greconfig.8,v 1.8 2001/04/11 19:36:59 wiz Exp $
.\"
.\" Copyright 1998 (c) The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Heiko W.Rupp <hwr@pilhuhn.de>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"     This product includes software developed by the NetBSD
.\"	Foundation, Inc. and its contributors.
.\" 4. Neither the name of the The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT  LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY  OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 14, 1998
.Dt GRECONFIG 8
.Os
.Sh NAME
.Nm greconfig
.Nd set characteristics of the
.Xr gre 4
pseudo device.
.Sh SYNOPSIS
.Nm
.Fl i Ar unit
.Op Fl v
.Nm ""
.Fl i Ar unit
.Op Fl d Ar dst
.Op Fl s Ar src
.Op Fl p Ar proto
.Op Fl v
.Sh DESCRIPTION
.Nm
is used to manipulate or display the characteristics of the
.Xr gre 4
tunnel device. The first form shown above displays the current
parameters, while the second one sets parameters to new values.
.Pp
The options have the following meanings:
.Bl -tag -width flag
.It Fl i Ar unit
Denotes the interface that is to be set/displayed. Unit is in the form
.Dq greN
where N is an integer from zero to the maximum numbers of
units. This option is always required.
.It Fl d Ar dst
Sets the IP address of the remote tunnel end. This may be the same as the
tunnel destination set with
.Xr ifconfig 8
when IP packets are to be encapsulated.
.It Fl s Ar src
Sets the IP address of the local tunnel end. This may be the same as
the tunnel gateway set with
.Xr ifconfig 8
when IP packets are to be encapsulated.
.It Fl p Ar proto
Sets the way how packets are encapsulated. Currently supported values are:
.Bl -tag -width aaa
.It 47 GRE encapsulation as described in RFC 1701,1702
.It 55 MOBILE encapsulation as described in RFC 2004
.El
.It Fl v
Give a little more verbose output when running
.Nm Ns .
.El
.Pp
Note that the values for
.Ar src ,
.Ar dst ,
.Ar proto
must be coordinated with the remote end of the tunnel.
.Pp
For tunnels that run IP as encapsulated protocol, the tunnel endpoints
can be set with the normal
.Xr ifconfig 8 .
In this case, the encapsulation protocol can be chosen by giving
.Dq link0
for IPIP encapsulation and
.Dq -link0
GRE encapsulation
as arguments to
.Xr ifconfig 8 .
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr gre 4 ,
.Xr protocols 5 ,
.Xr netintro 4
.Pp
A description of GRE encapsulation can be found in RFC 1701, RFC 1702.
.Pp
A description of MOBILE encapsulation can be found in RFC 2004.

.Sh AUTHOR
Heiko W.Rupp <hwr@pilhuhn.de>
