NetBSD/src/usr.sbin/wg-userspace/wg-userspace.8
.\"	$NetBSD: wg-userspace.8,v 1.3 2020/08/26 16:03:42 riastradh Exp $
.\"
.\" Copyright (C) Ryota Ozaki <ozaki.ryota@gmail.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 20, 2020
.Dt WG-USERSPACE 8
.Os
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh NAME
.Nm wg-userspace
.Nd manipulate wg userspace instances (EXPERIMENTAL)
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh SYNOPSIS
.Ar id
.Ar command
.Op Ar arguments
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh DESCRIPTION
.Nm
is used to create, destroy and configure
.Xr wg 4
userspace instances.
.Pp
.Sy WARNING:
.Nm
is experimental.
.Pp
The following commands are supported:
.Bl -tag -width "destroy"
.It Cm create
Create an interface.
The interface will appear as
.Li tun Ns Ar id
to the rest of the system, and will be served by a rump server in whose
context the interface appears as
.Li wg Ns Ar id .
.It Cm destroy
Destroy an interface and stop the rump server behind it.
.It Cm ifconfig Ar wgN Ar args...
Run
.Xr ifconfig 8
in the context of the interface's rump server.
For example,
.Bd -literal -compact
	# wg-userspace 0 ifconfig wg0 10.0.1.0/24
.Ed
will set the interface's IP address.
.It Cm wgconfig Ar wgN Ar args...
Run
.Xr wgconfig 8
in the context of the interface's rump server.
For example,
.Bd -literal -compact
	# wg-userspace 0 wgconfig wg0 set listen-port 1234
.Ed
will set the interface's listening port.
.It Cm debug Ar command Op Ar args...
Run an arbitrary command in the context of the interface's
rump server, using
.Xr rumphijack 3 .
.El
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh SEE ALSO
.Xr wg 4 ,
.Xr wg-keygen 8 ,
.Xr wgconfig 8
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 10.0 .
.\"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
.Sh AUTHORS
The
.Nm
command is written by
.An Ryota Ozaki
.Aq ozaki.ryota@gmail.com .
