NetBSD/src/usr.bin/newsyslog/newsyslog.8
.\"	$NetBSD: newsyslog.8,v 1.13 2000/07/07 10:52:41 ad Exp $
.\"
.\" Copyright (c) 1999, 2000 Andrew Doran <ad@NetBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" This file contains changes from the Open Software Foundation.
.\"
.\" Copyright 1988, 1989 by the Massachusetts Institute of Technology
.\" 
.\" Permission to use, copy, modify, and distribute this software
.\" and its documentation for any purpose and without fee is
.\" hereby granted, provided that the above copyright notice
.\" appear in all copies and that both that copyright notice and
.\" this permission notice appear in supporting documentation,
.\" and that the names of M.I.T. and the M.I.T. S.I.P.B. not be
.\" used in advertising or publicity pertaining to distribution
.\" of the software without specific, written prior permission.
.\" M.I.T. and the M.I.T. S.I.P.B. make no representations about
.\" the suitability of this software for any purpose.  It is
.\" provided "as is" without express or implied warranty.
.\"
.\" from FreeBSD: newsyslog.8,v 1.14.2.1 1999/02/25 18:38:33 wollman Exp
.\"
.Dd November 20, 1999
.Dt NEWSYSLOG 8
.Os
.Sh NAME
.Nm newsyslog
.Nd maintain system log files to manageable sizes
.Sh SYNOPSIS
.Nm newsyslog
.Op Fl Frv
.Op Fl f Ar config_file
.Sh DESCRIPTION
.Nm Newsyslog
is a program that should be scheduled to run periodically by
.Xr cron 8 .
When it is executed it archives log files if necessary.  If a log file
is determined to require archiving, 
.Nm
rearranges the files so that
.Dq Va logfile
is empty,
.Dq Va logfile Ns Li \&.0
has
the last period's logs in it,
.Dq Va logfile Ns Li \&.1
has the next to last
period's logs in it and so on, up to a user-specified number of
archived logs.  Optionally the archived logs can be compressed to save
space.  
.Pp
A log can be archived for two reasons:
.Bl -enum -offset indent
.It
It is larger than the configured size (in kilobytes).
.It
A configured number of hours have elapsed since the log was last
archived.
.El
.Pp
The granularity of
.Nm
is dependent on how often it is scheduled to run by
.Xr cron 8 .
It is recommended that
.Nm
be run once hourly.
.Pp
When starting up, 
.Nm
reads in a configuration file to determine which logs may potentially
be archived.
By default, this configuration file is 
.Pa /etc/newsyslog.conf .
Each line of the file contains information about a particular log file
that should be handled by
.Nm newsyslog .
Each line has six mandatory fields and three optional fields, with
whitespace separating each field.  Blank lines or lines beginning with
``#'' are ignored.  The fields of the configuration file are as
follows: 
.Pp
.Bl -tag -width indent
.It Ar logfile_name
Name of the system log file to be archived.
.It Ar owner:group
This optional field specifies the owner and group for the archive file.
The ":" is essential, even if the
.Ar owner
or
.Ar group
field is left blank.  The field may be numeric, or a name which is 
present in
.Pa /etc/passwd
or
.Pa /etc/group .
For backward compatibility, "." is useable in lieu of ":", however use of
this feature is discouraged.
.It Ar mode 
Specify the mode of the log file and archives.
.It Ar count
Specify the number of archive files to be kept
besides the log file itself.
.It Ar size
When the size of the log file reaches
.Ar size ,
the log file will be trimmed as described above.  If this field
is replaced by an asterisk
.Pq Ql \&* ,
then the size of the log file is not taken into account
when determining when to trim the log file.
.It Ar interval
The
.Ar interval
field specifies the time separation (in hours) between trimming of the 
log file.  If this field
is replaced by an asterisk
.Pq Ql \&* ,
then the interval is not taken into account
when determining when to trim the log file.
.It Ar flags
This field specifies any special processing that is required.  The
.Ar Z
flag means that archived log files should be compressed with
.Xr gzip 1
to save space.
The
.Ar B
flag means that the file is a binary file and so the
.Tn ASCII
message which
.Nm
inserts to indicate that the logs have been trimmed should not be included.
The
.Ar N
flag means that no signal should be sent when the log is trimmed.  The
.Ar C
flag instructs
.Nm
to create an empty log file if none currently exists.  The
.Ar -
flag means nothing - it is used as a spacer when no flags are set.
.It Ar path_to_pid_file
This optional field specifies
the file name to read to find the daemon process id.  If this
field is present, a signal of type
.Ar sigtype
is sent the process id contained in this
file.  This field must start with "/" in order to be recognized
properly.
.It Ar sigtype
This optional field specifies the type of signal to be sent to the daemon 
process.  This may be a numeric or symbolic value.  By default
a SIGHUP (hang-up) will be sent.
.El
.Sh OPTIONS
The following options can be used with newsyslog:
.Bl -tag -width indent
.It Fl f Ar config_file
Instruct newsyslog to use 
.Ar config_file
instead of
.Pa /etc/newsyslog.conf
as its configuration file.
.It Fl v
Place 
.Nm
in verbose mode.  In this mode it will print out each log and its
reasons for either trimming that log or skipping it.
.It Fl r
Remove the restriction that
.Nm
must be running as root.  When running as a regular user,
.Nm
will not be able to send a HUP signal to
.Xr syslogd 8 ,
so this option should be used only when debugging or trimming user generated
logs.
.It Fl F
Force
.Nm
to trim the logs, even if the trim conditions have not been met.  This
option is useful for diagnosing system problems by providing you with
fresh logs.
.El
.Sh FILES
.Bl -tag -width /etc/newsyslog.confxxxx -compact
.It Pa /etc/newsyslog.conf
.Nm
configuration file.
.El
.Sh AUTHORS
.An Theodore Ts'o ,
MIT Project Athena
.An Andrew Doran ,
The NetBSD Project
.Pp
Copyright 1987, Massachusetts Institute of Technology
.Pp
Copyright 1999, 2000 Andrew Doran
.Sh SEE ALSO
.Xr gzip 1 ,
.Xr syslog 3 ,
.Xr syslogd 8
