NetBSD/src/usr.bin/newsyslog/newsyslog.8
.TH NEWSYSLOG 8 "January 12, 1989" "Project Athena"
.ns
.\" This file contains changes from the Open Software Foundation.
.\" The RCS history log will appear at the end of this file.
.\" @(#)newsyslog.8	$Revision: 1.1 $ $Date: 1993/05/21 14:44:00 $ $Locker:  $
.\"
.\"
.\" Copyright 1991 by the Massachusetts Institute of Technology
.\"
.\" All rights reserved.
.\"
.\" Permission to use, copy, modify, and distribute this software and its
.\" documentation for any purpose and without fee is hereby granted,
.\" provided that the above copyright notice appear in all copies and that
.\" both that copyright notice and this permission notice appear in
.\" supporting documentation, and that the name of the Massachusetts
.\" Institute of Technology (M.I.T.) not be used in advertising or publicity
.\" pertaining to distribution of the software without specific, written
.\" prior permission.
.\"
.\" M.I.T. DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING
.\" ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL
.\" M.I.T. BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR
.\" ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,
.\" WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION,
.\" ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS
.\" SOFTWARE.
.\"
.sp
.SH NAME
newsyslog \- maintain system log files to manageable sizes
.SH SYNOPSIS
.B /usr/local/sbin/newsyslog
[
.B \-vnr
] [
.B \-f
.I configuration file
]
.SH DESCRIPTION
.I Newsyslog
is a program that should be scheduled to run periodically by
.IR crontab .
When it is executed it archives log files if necessary.  If a log file
is determined to require archiving, 
.I newsyslog
rearranges the files so that ``logfile'' is empty, ``logfile.0'' has
the last period's logs in it, ``logfile.1'' has the next to last
period's logs in it, and so on, up to a user-specified number of
archived logs.  Optionally the archived logs can be compressed to save
space. 
.PP
A log can be archived because of two reasons.  The log file can have
grown bigger than a preset size in kilobytes, or a preset number of
hours may have elapsed since the last log archive.  The granularity of
.I newsyslog
is dependent on how often it is scheduled to run in crontab.  Since
the program is quite fast, it may be scheduled to run every hour
without any ill effects.
.PP
When starting up, 
.I newsyslog
reads in a configuration file to determine which logs should be looked
at.  By default, this configuration file is 
.IR /var/adm/newsyslog.conf .
Each line of the file contains information about a particular log file
that should be handled by
.IR newsyslog .
Each line has five mandatory fields and two optional fields, with a
whitespace separating each field.  Blank lines or lines beginning with
``#'' are ignored.  The fields of the configuration file are as
follows: 
.br
	logfile name
.br
	owner.group of archives (optional)
.br
	mode of logfile & archives
.br
	number of archives
.br
	size of archives
.br
	archive interval
.br
	flags (optional)
.PP
The
.I logfile name
entry is the name of the system log file to be archived.
.PP
The optional
.I owner.group
entry specifies an ownership and group for the archive file.
The "." is essential, even if the 
.I owner
or
.I group
field is left blank. The
fields may be numeric, or a name which is looked up in 
.I /etc/passwd
or 
.IR /etc/group .
.PP
The
.I number of archives
entry specifies the number of archives to be kept besides the log file
itself.  
.PP
When the size of the logfile reaches 
.I size of 
.IR archives ,
the logfile becomes trimmed as described above.  If this field is
replaced by a ``*'', then the size of the logfile is not taken into
account when determining when to trim the log file.
.PP
The
.I number of hours
entry specifies the time separation between the trimming of the log
file.  If this field is replaced by a ``*'', the the number of hours
since the last time the log was trimmed will not be taken into
consideration.
.PP
The
.I flags
field specifies if the archives should have any special processing
done to the archived log files.  The ``Z'' flag will make the archive
files compressed to save space using /usr/ucb/compress.  The ``B'' flag
means that the file is a binary file, and so the ascii message which
.I newsyslog
inserts to indicate the fact that the logs have been turned over
should not be included.
.PP
.SH OPTIONS
The following options can be used with newsyslog:
.TP
.B \-f \fIconfig-file
instructs newsyslog to use 
.I config-file
instead of /var/adm/newsyslog.conf for its configuration file.
.TP
.B \-v
places 
.I newsyslog
in verbose mode.  In this mode it will print out each log and its
reasons for either trimming that log or skipping it.
.TP
.B \-n
causes
.I newsyslog 
not to trim the logs, but to print out what it would do if this option
were not specified.
.TP
.B \-r
removes the restriction that
.I newsyslog 
must be running as root.  Of course, 
.I newsyslog
will not be able to send a HUP signal to
.IR syslogd ,
so this option should only be used in debugging.
.SH FILES
/var/adm/newsyslog.conf
.SH BUGS
Doesn't yet automatically read the logs to find security breaches.


.SH AUTHOR
Theodore Ts'o, MIT Project Athena
.br
Copyright 1987, Massachusetts Institute of Technology
.SH "SEE ALSO"
syslogd(8), syslog(3), compress(1)
.ns
.\" HISTORY
.\" $Log: newsyslog.8,v $
.\" Revision 1.1  1993/05/21 14:44:00  cgd
.\" initial import of this log-rotation program to NetBSD
.\"
.\" Revision 3.0  1993/01/01  07:39:16  ede
.\" 	Initial revision for OSF/1 R1.3
.\"
.\" Revision 1.2  1991/08/16  09:50:23  devrcs
.\" 	From John Brezak, brezak@apollo.com, originally from Project Athena
.\" 	[91/07/24  09:33:14  meissner]
.\"
.\" $EndLog$
.sp
