NetBSD/src/share/man/man8/man8.hpcsh/boot.8
.\"	$NetBSD: boot.8,v 1.3 2006/01/13 22:16:21 uwe Exp $
.\"
.\" Copyright (c) 2004 Valeriy E. Ushakov
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 3, 2004
.Dt BOOT 8 hpcsh
.Os
.Sh NAME
.Nm boot
.Nd system bootstrapping procedures
.Sh DESCRIPTION
Windows\ CE machines with
.Tn SuperH
CPUs use the
.Xr hpcboot 8
program to boot
.Nx .
Once running,
.Nx
can reboot itself if
.Xr kloader 4
is configured in the kernel.
.Ss Power fail and crash recovery
.\"
Unfortunately,
.Nx
can't reboot itself at power-up or after crashes.
The machine will go through the cold reset and boot into Windows\ CE.
You will have to restart
.Nx
manually using
.Xr hpcboot 8 .
.Pp
Once
.Nx
starts, an automatic consistency check of the file systems will be
performed, and unless this fails, the system will resume multi-user
operations.
.\"
.Ss Cold starts
.\"
On cold reset Windows\ CE handheld machines attempt to boot the Windows\ CE
operating system from the boot ROM.
The boot ROM is usually not rewritable, so you cannot erase or damage
Windows\ CE image.
.Pp
You can't boot
.Nx
directly, skipping Windows\ CE.
The
.Nx
bootloader,
.Xr hpcboot 8 ,
is provided as a Windows\ CE application program instead.
Though the bootloader is an application program, it blows the entire
running Windows\ CE, its data, and its settings away from RAM (but not
ROM!\&) when the kernel boots successfully.
If
.Nx
is halted the machine will go throught the cold reset and will reboot
into Windows\ CE.
.\"
.Ss Normal Operation
.\"
Please, refer to the
.Xr hpcboot 8
manual page.
.Sh FILES
.\"
.Bl -tag -width hpcboot.exe -compact
.It Pa hpcboot.exe
bootloader program for Windows\ CE
.El
.\"
.Sh SEE ALSO
.\"
.Xr kloader 4 ,
.Xr hpcboot 8
.\"
.Sh BUGS
.\"
There is no general way to launch the bootloader automatically, as
only a few Windows\ CE machines provide an
.Dq auto run
mechanism.
