NetBSD/src/usr.sbin/lastlogin/lastlogin.8
.\"	$NetBSD: lastlogin.8,v 1.12 2009/04/08 14:20:38 joerg Exp $
.\"
.\" Copyright (c) 1996 John M. Vinopal
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by John M. Vinopal.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 4, 2005
.Dt LASTLOGIN 8
.Os
.Sh NAME
.Nm lastlogin
.Nd indicate last login time of users
.Sh SYNOPSIS
.Nm
.Op Fl nrt
.Op Fl f Ar filename
.Op Fl H Ar hostsize
.Op Fl L Ar linesize
.Op Fl N Ar namesize
.Op user ...
.Sh DESCRIPTION
.Nm
will list the last login session of specified
.Ar users ,
or for all users by default.  Each line of output contains
the user name, the tty from which the session was conducted, any
hostname, and the start time for the session.
.Pp
If multiple
.Ar users
are given, the session information for each user is printed in
the order given on the command line.  Otherwise, information
for all users is printed, sorted by uid.
.Pp
.Nm
differs from
.Xr last 1
in that it only prints information regarding the very last login session.
The last login database is never turned over or deleted in standard usage.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl f Ar filename
Process input from
.Ar filename .
If the file ends with an
.Dq x ,
then it is assumed that it is a
.Xr lastlogx 5
file, else it is assumed to be a
.Xr lastlog 5
file.
.It Fl H Ar hostlen
Set the field width for host output to
.Ar hostlen
characters.
.It Fl L Ar linelen
Set the field width for line output to
.Ar linelen
characters.
.It Fl N Ar namelen
Set the field width for name output to
.Ar namelen
characters.
.It Fl n
Attempt to print numeric host addresses.
This option is only supported with
.Xr lastlogx 5
format files.
.It Fl r
Reverse the order of the sort.
.It Fl t
Sort by last login time (most recent first.)
.El
.Sh FILES
.Bl -tag -width /var/log/lastlogx -compact
.It Pa /var/log/lastlogx
default last login database
.It Pa /var/log/lastlog
compatibility last login database
.El
.Sh EXAMPLES
.Nm
looks by default to the
.Pa /var/log/lastlogx
database, where some old programs that are not
.Xr utmpx 5
aware might only write to
.Pa /var/log/lastlog .
To look at the old database one can use:
.Pp
.Dl lastlogin -f /var/log/lastlog
.Sh SEE ALSO
.Xr last 1 ,
.Xr lastlog 5 ,
.Xr lastlogx 5 ,
.Xr ac 8
.Sh AUTHORS
.An John M. Vinopal
wrote this program in January 1996 and contributed it to the
.Nx
project.
