NetBSD/src/usr.sbin/catman/catman.8
.\" Copyright (c) 1993 Winning Strategies, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Winning Strategies, Inc.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $Header: /cvsroot/src/usr.sbin/catman/catman.8,v 1.1 1993/07/27 21:29:31 jtc Exp $
.\"
.Dd July 30, 1993
.Dt CATMAN 8
.Os
.Sh NAME
.Nm catman
.Nd format cat pages from man pages
.Sh SYNOPSIS
.Nm catman
.Op Fl npw
.Op Fl M Ar directory
.Op Ar sections
.Sh DESCRIPTION
.Nm Catman 
creates formatted versions of the on-line manual pages from their 
.Xr nroff 1
source.
Manual pages whose formatted versions are missing or out of date are 
regenerated.
If changes are made, 
.Nm catman
regenerates the 
.Nm whatis
database.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl n
Do not create the 
.Nm whatis
database.
.It Fl p
Display the commands that would have been executed, but do not actually
execute them.
.It Fl w
Only create the 
.Nm whatis 
database.
.It Fl M Ar directory
Update manual pages in 
.Ar directory.
.El
.Sh SEE ALSO
.Xr apropos 1 ,
.Xr man 1 ,
.Xr whatis 1
