NetBSD/src/sbin/iscsid/iscsid.8
.\" $NetBSD: iscsid.8,v 1.5 2012/05/27 20:11:58 riz Exp $
.\"
.\" Copyright (c) 2011 Alistair Crooks <agc@NetBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 27, 2012
.Dt ISCSID 8
.Os
.Sh NAME
.Nm iscsid
.Nd interface to kernel iSCSI driver
.Sh SYNOPSIS
.Nm
.Op Fl Ar dn
.Sh DESCRIPTION
The iSCSI initiator runs as a kernel driver, and provides access
to iSCSI targets running across a network using the iSCSI protocol,
RFC 3270.
The
.Nm
utility itself interfaces to the kernel iSCSI driver, and also
communicates, using
.Xr isns 3 ,
with the iSCSI name service running on other hosts
to locate services and iSCSI instances.
In normal operation,
.Nm
is a standard daemon, and will detach from the controlling
terminal using
.Xr daemon 3
and then loops, reading requests, processing them,
and sending responses.
Communication takes place over a
Unix domain socket.
.Nm
exits on receiving a terminate message,
(no response to one that is sent to the kernel),
or when an error occurs reading from or writing to the socket.
.Pp
The argument
.Ar d
increases the debug level.
The argument
.Ar n
makes the daemon single-threaded.
.Pp
It is envisaged that user-level communication take place with
.Nm
using the
.Xr iscsictl 8
utility, rather than directly over its communication socket.
An example of setting up the in-kernel iSCSI initiator
is shown in
.Xr iscsictl 8 .
.Sh SEE ALSO
.Xr daemon 3 ,
.Xr isns 3 ,
.Xr iscsictl 8
.Sh HISTORY
The
.Nm
utility appeared in
.Nx 6.0 .
.Sh AUTHORS
.An Alistair Crooks Aq agc@NetBSD.org
wrote this manual page.
The
.Nm
utility was contributed by Wasabi Systems, Inc.
