NetBSD/src/share/man/man4/man4.pc532/ncr.4
.\"	$NetBSD: ncr.4,v 1.4 2002/01/15 01:50:56 wiz Exp $
.\"
.\" Copyright (c) 1997 Matthias Pfaller.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	 This product includes software developed by Matthias Pfaller.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 21, 1997
.Dt NCR 4 pc532
.Os
.Sh NAME
.Nm ncr
.Nd NCR5380/DP8490 low level SCSI interface
.Sh SYNOPSIS
.Cd "ncr0 at mainbus0 [flags ?]"
.Sh DESCRIPTION
The
.Nm
driver provides
.Tn pc532
specific functions for the machine independent ncr5380 driver provided
in the kernel source.
An optional argument
.Ar flags
can be used to disable disconnects for all targets (bit 0), to disable the
use of interrupts (bit 1), to force a SCSI BUS RESET at boot time (bit 2),
to disable SCSI parity checking for certain targets (bits 8-15) and to disable
disconnects for certain targets (bits 16-23).
.Sh DIAGNOSTICS
.Bl -diag
.It "ncr?: BUS RESET"
A BUS RESET was detected on the SCSI bus.
.It "ncr? spurious interrupt"
The controller caused a processor interrupt for no reason.
.It "ncr? ready timeout"
.It "ncr? pdma not_req timeout"
.It "ncr? timeout waiting for final SCI_DSR_DREQ"
These three messages indicate problems during a pseudo-DMA transfer.
.El
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr se 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4
.Sh HISTORY
A driver for the
.Tn pc532 Ns 's
NCR5380/DP8490 SCSI interface appeared in
.Nx 1.0 .
