NetBSD/src/share/man/man4/man4.evbarm/awge.4
.\" $NetBSD: awge.4,v 1.1.14.1 2025/08/02 05:55:13 perseant Exp $
.\"
.\" written by Maya Rashish, 2019
.\" This file is in the Public Domain
.\"
.Dd March 22, 2025
.Dt AWGE 4
.Os
.Sh NAME
.Nm awge
.Nd DesignWare Gigabit Ethernet
.Sh SYNOPSIS
.Cd "awge* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the DesignWare GMAC Ethernet.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Rs
.%A Synopsys
.%T DesignWare Ethernet GMAC IP
.%D April, 2019
.%U https://www.synopsys.com/dw/ipdir.php?ds=dwc_ether_mac10_100_1000_unive
.Re
.Sh HISTORY
The name
.Nm
was chosen due to the hardware appearing in Allwinner boards,
but
.Nm
is in use in boards by other manufacturers, e.g., Rockchip.
.Pp
The
.Nm
device driver was written by
.An Matt Thomas
and
.An Martin Husemann .
It first appeared in
.Nx 7.0 .
