NetBSD/src/share/man/man4/man4.evbarm/awge.4
.\" $NetBSD: awge.4,v 1.5 2026/06/11 00:44:26 gutteridge Exp $
.\"
.\" written by Maya Rashish, 2019
.\" This file is in the Public Domain
.\"
.Dd June 10, 2026
.Dt AWGE 4
.Os
.Sh NAME
.Nm awge
.Nd DesignWare Gigabit Ethernet
.Sh SYNOPSIS
.Cd "awge* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the DesignWare GMAC Ethernet.
.Pp
It supports VLAN-sized frames.
It does not presently provide hardware-based checksumming.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Rs
.%Q Synopsys
.%T DesignWare Ethernet GMAC IP
.%D April, 2019
.%U https://www.synopsys.com/dw/ipdir.php?ds=dwc_ether_mac10_100_1000_unive
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 7.0 .
The name
.Nm
was chosen due to the hardware appearing in Allwinner boards,
but
.Nm
is in use in boards by other manufacturers, e.g., Rockchip.
.Sh AUTHORS
.An Matt Thomas Aq Mt gimpy@NetBSD.org
.An Martin Husemann Aq Mt martin@NetBSD.org
