NetBSD/src/share/man/man4/man4.evbarm/bcmgpio.4
.\"	$NetBSD: bcmgpio.4,v 1.1 2014/04/23 07:04:01 kardel Exp $
.\"
.\"Copyright (c) 2014 Frank Kardel
.\"All rights reserved.
.\"
.\"Redistribution and use in source and binary forms, with or without
.\"modification, are permitted provided that the following conditions
.\"are met:
.\"1. Redistributions of source code must retain the above copyright
.\"   notice, this list of conditions and the following disclaimer.
.\"2. Redistributions in binary form must reproduce the above copyright
.\"   notice, this list of conditions and the following disclaimer in the
.\"   documentation and/or other materials provided with the distribution.
.\"
.\"THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\"``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\"TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\"PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\"BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\"CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\"SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\"INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\"CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\"ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\"POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 21, 2014
.Dt BCMGPIO 4
.Os
.Sh NAME
.Nm bcmgpio
.Nd driver for BCM2835 onboard gpio
.Sh SYNOPSIS
.Cd "bcmgpio0 at obio?"
.Cd "bcmgpio1 at obio?"
.Cd "gpio* at gpiobus?"
.Sh DESCRIPTION
The
.Nm
driver supports up to two instances.
Access to the pins is provided by the
.Xr gpio 4
interface.
The
.Nm
.Ar unitnumber
argument selects the pin range.
Unit 0 covers GPIO pins 0 through 31 and unit 1 covers pins 32
through 53.
GPIO pins being used in alternate configurations are not available
for GPIO operations.
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Frank Kardel Aq Mt kardel@NetBSD.org .
