NetBSD/src/share/man/man4/man4.evbarm/cpsw.4
.\" $NetBSD: cpsw.4,v 1.2 2013/01/06 21:25:54 wiz Exp $
.\"
.\" Copyright (c) 2013 Jonathan A. Kollasch
.\" All rights reserved
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 6, 2013
.Dt CPSW 4
.Os
.Sh NAME
.Nm cpsw
.Nd Texas Instruments CPSW 3-port Ethernet Switch
.Sh SYNOPSIS
.Cd "cpsw* at obio?"
.Pp
Configuration of PHYs is necessary.
See
.Xr mii 4 .
.Sh DESCRIPTION
The
.Nm
driver supports the TI AM335x 3-port Ethernet Switch subsystem.
.Sh
.Sh SEE ALSO
.Xr mii 4
.Sh HISTORY
The
.Nm
driver appeared in
.Nx 7.0 .
.Sh AUTHORS
.An Jonathan A. Kollasch
.Aq jakllsch@NetBSD.org
