NetBSD/src/share/man/man4/man4.evbarm/gxio.4
.\" $NetBSD: gxio.4,v 1.2 2022/10/29 13:10:26 jmcneill Exp $
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Takashi Kiyohara.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 29, 2022
.Dt GXIO 4
.Os
.Sh NAME
.Nm gxio
.Nd driver for Gumstix onboard I/O interface
.Sh SYNOPSIS
.Cd "gxio* at pxaip?"
.Cd options GXIO_BLUETOOTH_ON_HWUART
.Cd options GXIO_DEFAULT_EXPANSION
.Sh DESCRIPTION
The
.Nm
driver supports several different expansion boards.
Those boards have to be configured either by kernel option or
using boot time parameter.
The supported extension boards is system specific.
.Pp
.Nm
is available for XScale based Gumstix boards.
To setup the expansion board on boot the parameter
.Dq expansion
can be used.
Additionally, some XScale systems can connect two expansion boards.
The second board can be configured by the
.Dq busheader
boot parameter.
The
.Nm
driver does not verify validity of both parameters.
.Pp
For Xscale boards the following drivers are available for the peripherals:
.Bl -tag -width -pcdisplay -offset indent
.It sm
SMC91Cxx ethernet interface.
.It smsh
SMSC LAN9118/LAN9218 ethernet interface.
.El
.Sh OPTIONS
.Bl -tag -width GXIO_BLUETOOTH_ON_HWUART -offset 3n
.It Dv GXIO_BLUETOOTH_ON_HWUART
Uses HWUART pins for Bluetooth module.
.Pp
The option only affects Xscale PXA250 based Gumstix boards.
If set, the serial port HWUART is used to control Bluetooth module.
Otherwise no Bluetooth module is configured for PXA250 boards.
.It Dv GXIO_DEFAULT_EXPANSION
Static configuration of expansion board.
.Pp
If configured, the
.Nm
of the processor is setup for the board.
If a boot parameter is used, the boot value is used instead.
.Pp
For Xscale based boards the following values are supported:
.Bl -column
.It basix
.It cfstix
.It etherstix
.It netcf
.It netcf-vx
.It netduo
.It netduo-mmc
.It netmicrosd
.It netmicrosd-vx
.It netwifimicrosd
.It netmmc
.It netpro-vx
.It wfistix
.It wfistix-cf
.El
.El
.Sh SEE ALSO
.Xr pxaip 4 ,
.Xr sm 4 ,
.Xr smsh 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Takashi Kiyohara
.Aq Mt kiyohara@NetBSD.org
and
.An Susumu Miki for WIDE Project and SOUM Corporation .
This manual page was contributed by
.An Stephan Meisinger .
