NetBSD/src/share/man/man4/man4.evbarm/intro.4
.\" $NetBSD: intro.4,v 1.3 2005/06/20 13:25:24 peter Exp $
.\"
.\" Copyright (c) 2003 ARM Ltd
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the company may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY ARM LTD ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL ARM LTD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 7, 2003
.Dt INTRO 4 evbarm
.Os
.Sh NAME
.Nm intro
.Nd introduction to evbarm special files and hardware support
.Sh DESCRIPTION
The evbarm port is really a collection of ports of
.Nx
to a range of development and evaluation boards based on the ARM Architecture.
.Pp
This section describes the supported boards, the special files,
related driver functions, and networking support available in each system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 1
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Pp
This section contains both devices
which may be configured into the system
and network related information.
The networking support is introduced in
.Xr netintro 4 .
.Sh SUPPORTED BOARDS
Each supported board requires a custom kernel for that board.
.Pp
The following boards are currently supported by the evbarm configuration:
.Pp
.Bl -tag -width Integrator -offset indent -compact
.It Integrator
The Integrator/AP development system from ARM Ltd.
Supported processor boards
include the CM10200E and CM920T.
.It IQ80310
The reference platform for the XScale-based IOP310 I/O processor from Intel.
.It IQ80321
The reference platform for the XScale-based IOP321 I/O processor from Intel.
.It Npwr
The Npwr board, from Team ASA, is based on the IOP310 processor from Intel and
targetted at the network-attached storage space.
.It IXM1200
The reference platform for the XScale-based IXP1200 Network processor from
Intel.
.It SMDK2410
The reference platform for the ARM920T-based S3C2410 processor from Samsung.
.It SMDK2800
The reference platform for the ARM920T-based S3C2800 processor from Samsung.
.It BRH
The BRH (Big Red Head) is an evaluation and development platform from ADI
Engineering, based on the XScale-based I80200 processor
.It NTNP425B
An evaluation and development platform from NOVATEC, using the XScale-based
IXP425 processor.
.It DBPXA250
An evaluation and development platfrom from Intel, using the XScale-based
PXA250 processor.
.El
.Sh DEVICE SUPPORT
This section describes some of the hardware supported on the various boards.
Software support for these devices comes in two forms.
A hardware
device may be supported with a character or block
.Em device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.
When the resultant system is booted, the
autoconfiguration facilities in the system probe for the device
and, if found, enable the software support for it.
If a device does not respond at autoconfiguration
time it is not accessible at any time afterwards.
To enable a device which did not autoconfigure,
the system must be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.
Devices are indicated by their functional interface.
Not all supported devices are listed.
.Pp
On the Integrator:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It plcom
The PrimeCell PL010 UART.
.It plrtc
The PrimeCell PL030 Real-time Clock
.It fxp
Intel i82559 Ethernet PCI card.
.It ahc
Adaptec aic7880 SCSI controller.
.El
Other PCI based cards may also work, but have not been tested.
.Pp
On the IQ80310:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It fxp
On-board Intel i82559 Ethernet
.It com
On-board NS16550-compatible serial ports
.El
Other PCI devices in the PCI expansion slots.
On the IQ80321:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It wm
On-board Intel i82544EI Gigabit Ethernet
.It com
On-board NS16550-compatible serial port
.It iopaau
On-chip Application Accelerator Unit
.It iopwdog
On-chip watchdog timer.
.El
Other devices in the PCI expansion slots.
.Pp
On Npwr:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It wm
On-board Intel i82544EI Gigabit Ethernet
.It siop
On-board LSI Logic 53c1010 Ultra160 SCSI
.It com
On-board NS16550-compatible serial port
.El
.Pp
On the IXM1200:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It fxp
On-board Intel i82559 Ethernet
.It nppb
On-board Intel i21555 Non-Transparent PCI-PCI Bridge
.It ixpcom
On-chip serial port
.El
.Pp
On the SMDK2410:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It sscom
On-chip serial ports
.It ohci
On-chip USB host controller
.El
.Pp
On the SMDK2800:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It sscom
On-chip serial ports
.It sspci
On-chip Host-PCI bridge
.El
Other devices in the PCI expansion slots.
.Pp
On the BRH:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It com
On-board NS16550-compatible serial ports
.It fxp
On-board i82559 Ethernet controller
.El
Other devices in the PCI expansion slots.
.Pp
On the NtNP425B:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It ixpcom
On-chip serial ports
.It ixpwdog
On-chip watchdog timer
.El
Other devices in the PCI/mPCI slot.
.Pp
On the DBPXA250:
.Pp
.Bl -tag -width speaker -offset indent -compact
.It com
On-board NS16550-compatible serial port
.It sm
On-board SMC91C96 Ethernet controller
.It sacc
On-board SA-1111 StrongARM companion chip
.It pckbd
PS/2 keyboard
.It lcd
640x480 LCD
.El
Other devices in the PCMCIA and CF card slots.
.Sh SEE ALSO
.Xr config 1 ,
.Xr autoconf 4
.Sh HISTORY
The
.Tn evbarm
.Nm intro
appeared in
.Nx 2.0 .
