NetBSD/src/share/man/man4/man4.evbarm/rktsadc.4
.\"	$NetBSD: rktsadc.4,v 1.6 2026/06/30 03:14:26 mrg Exp $
.\"
.\" Copyright (c) 2019 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 29, 2026
.Dt RKTSADC 4
.Os
.Sh NAME
.Nm rktsadc
.Nd RockChip Thermal Sensor ADC
.Sh SYNOPSIS
.Cd "rktsadc* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the RockChip thermal sensors.
There may be one or two sensors attached to any chipset, typically
attached to the CPU (always) and the GPU.
.Pp
The following RockChip CPUs are supported by the driver:
.Pp
.Bl -bullet -compact -offset abc
.It
RK3288
.It
RK3328
.It
RK3399
.El
.Sh SEE ALSO
.Xr envsys 4 ,
.\".Xr fdt 4 ,
.Xr intro 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 9.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Matthew R. Green Aq Mt mrg@eterna23.net .
.An Jared D. McNeill Aq Mt jmcneill@NetBSD.org
added support for the RK3288.
