NetBSD/src/share/man/man4/man4.evbarm/vchiq.4
.\" $NetBSD: vchiq.4,v 1.1 2021/02/26 10:33:46 nia Exp $
.\"
.\" Copyright (c) 2021 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 26, 2021
.Dt VCHIQ 4
.Os
.Sh NAME
.Nm vchiq
.Nd Broadcom VideoCore Host Interface device driver
.Sh SYNOPSIS
.Cd "vchiq* at simplebus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the VideoCore 4 GPU messaging interface in
Broadcom SoCs found in boards such as the Raspberry Pi.
.Pp
Libraries in pkgsrc provide OpenGL ES support and video decoding acceleration
for the VideoCore 4 using the
.Pa /dev/vchiq
interface exposed to userland.
.Pp
Audio output support is provided by the kernel through
.Xr vcaudio 4 ,
which uses this messaging interface to the GPU internally.
.Sh SEE ALSO
.Xr bcmgpio 4 ,
.Xr vcaudio 4 ,
.Pa pkgsrc/misc/raspberrypi-userland ,
.Pa pkgsrc/multimedia/omxplayer
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 7.0 .
.Sh BUGS
.Pa /dev/vchiq
does not follow the standard model for graphical acceleration on Unix-like
systems, so applications have to be specially built to take advantage of it.
The interface to userland also cannot be exposed by 64-bit or big endian
kernels due to problems in the upstream Broadcom code.
