NetBSD/src/usr.sbin/acpitools/acpidump/acpidump.8
.\" $NetBSD: acpidump.8,v 1.2 2007/01/14 12:25:42 wiz Exp $
.\" ACPI (ACPI Package)
.\"
.\" Copyright (c) 1999 Doug Rabson <dfr@FreeBSD.org>
.\" Copyright (c) 2000 Mitsuru IWASAKI <iwasaki@FreeBSD.org>
.\" Copyright (c) 2000 Yasuo YOKOYAMA <yokoyama@jp.FreeBSD.org>
.\" Copyright (c) 2000 Hiroki Sato <hrs@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/usr.sbin/acpi/acpidump/acpidump.8,v 1.13 2002/07/14 14:42:07 charnier Exp $
.\"
.Dd August 31, 2000
.Dt ACPIDUMP 8
.Os
.Sh NAME
.Nm acpidump
.Nd dump ACPI tables
.Sh SYNOPSIS
.Nm
.Op Fl r
.Nm
.Op Fl r
.Op Fl o Ar dsdt_file_for_output
.Nm
.Op Fl r
.Op Fl f Ar dsdt_file_for_input
.Sh DESCRIPTION
The
.Nm
utility analyzes ACPI tables in physical memory and dumps them to
standard output.
In addition,
.Nm
can disassemble AML
(ACPI Machine Language)
found in these tables and dump them as ASL
(ACPI Source Language).
.Pp
ACPI tables have an essential data block (the DSDT,
Differentiated System Description Table),
that includes information used on the kernel side such as
detailed information about PnP hardware, procedures for controlling
power management support and so on.
The
.Nm
utility can extract the DSDT data block from physical memory and store it into
a DSDT data file, and also can generate an output in ASL
from a given DSDT data file.
.Pp
When
.Nm
is invoked without the
.Fl f
option, it will read ACPI tables from physical
memory via a special file
.Pa /dev/mem
and dump them.
First it searches for the RSDP
(Root System Description Pointer),
which has the signature
.Qq RSD PTR\ \& ,
and then gets the RSDT
(Root System Description Table),
which includes a list of pointers to physical memory addresses
for other tables.
The RSDT itself and all other tables linked from RSDT are generically
called SDTs
(System Description Tables)
and their header has a common format which consists of items
such as Signature, Length, Revision, Checksum, OEMID, OEM Table ID,
OEM Revision, Creator ID and Creator Revision.
The
.Nm
utility dumps contents of these SDTs.
For further information about formats of each table,
see chapter 5:
.Dq ACPI Software Programming Model
from the ACPI specifications referenced below.
.Pp
There is always a pointer to a physical memory address in RSDT for FACP
(Fixed ACPI Description Table).
The FACP defines static system information about power management support
(ACPI Hardware Register Implementation)
such as interrupt mode
(INT_MODEL),
SCI interrupt number, SMI command port
(SMI_CMD)
and location of ACPI registers.
The FACP also has a pointer to a physical memory address for DSDT,
which includes information used on the kernel side such as
PnP, power management support and so on.
While the other tables are described in fixed format,
the DSDT consists of AML data which is compiled from sources
written in free formated ASL, which is the description language for ACPI.
When
.Nm
outputs DSDT, it disassembles the AML data and
formats it as ASL.
.Sh OPTIONS
The following options are supported by
.Nm :
.Bl -tag -width indent
.It Fl f Ar dsdt_file_for_input
Interprets AML data in DSDT from a file specified in
.Ar dsdt_file_for_input
and dumps them in ASL to standard output.
.It Fl h
Displays usage and exits.
.It Fl o Ar dsdt_file_for_output
Stores DSDT data block from physical memory into a file specified in
.Ar dsdt_file_for_output
in addition to behavior with no option.
.It Fl r
Additionally outputs commented
.Fn ResourceTemplate
macros for Buffer
objects that contain valid resource streams.
These macros are defined in the ACPI 2.0 specification section
16.2.4.
.El
.Sh FILES
.Bl -tag -width /dev/mem
.It Pa /dev/mem
.El
.Sh EXAMPLES
This is an example to get a dump of SDTs and a DSDT data file
simultaneously on a machine that supports ACPI BIOS.
.Bd -literal -offset indent
# acpidump -o foo.dsdt \*[Gt] foo.asl
.Ed
.Sh SEE ALSO
.Xr acpi 4 ,
.\" .Xr mem 4 ,
.\" .Xr acpiconf 8 ,
.Xr amldb 8
.Pp
.Rs
.%T Advanced Configuration and Power Interface Specification
.%Q Intel
.%Q Microsoft
.%Q Toshiba
.%O Revision 1.0b, 2.0
.Re
.Sh HISTORY
The
.Nm
utility appeared in
.Fx 5.0 .
.Sh AUTHORS
.An Doug Rabson Aq dfr@FreeBSD.org
.An Mitsuru IWASAKI Aq iwasaki@FreeBSD.org
.An Yasuo YOKOYAMA Aq yokoyama@jp.FreeBSD.org
.Pp
.An -nosplit
Some contributions made by
.An Chitoshi Ohsawa Aq ohsawa@catv1.ccn-net.ne.jp ,
.An Takayasu IWANASHI Aq takayasu@wendy.a.perfect-liberty.or.jp ,
.An Yoshihiko SARUMARU Aq mistral@imasy.or.jp ,
.An Hiroki Sato Aq hrs@FreeBSD.org ,
.An Michael Lucas Aq mwlucas@blackhelicopters.org
and
.An Michael Smith Aq msmith@FreeBSD.org .
.Sh BUGS
In the current implementation,
.Nm
doesn't dump any information of Firmware ACPI Control Structure
(FACS)
specified by a pointer in FACP.
