NetBSD/src/sbin/scan_ffs/scan_ffs.8
.\"	$NetBSD: scan_ffs.8,v 1.2 2005/06/15 19:02:54 peter Exp $
.\"     OpenBSD: scan_ffs.8,v 1.13 2004/12/14 00:04:21 jmc Exp
.\"
.\" Copyright (c) 2005 Juan Romero Pardines
.\" Copyright (c) 1997 Niklas Hallqvist, Tobias Weingartner
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 15, 2005
.Dt SCAN_FFS 8
.Os
.Sh NAME
.Nm scan_ffs
.Nd finding FFSv1/FFSv2 partitions on a disk
.Sh SYNOPSIS
.Nm
.Op Fl lv
.Op Fl s Ar start
.Op Fl e Ar end
.Ar device
.Sh DESCRIPTION
This program will take a raw disk device that covers the whole disk,
and will find all possible FFSv1/FFSv2 partitions with different block
sizes on the disk.
It will show the filesystem type (FFSv1 or FFSv2), size and offset.
Also it has an option to show the values with a disklabel-alike
output.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl l
This will make
.Nm
print out a string looking much like the input to disklabel.
With a little massaging, this output can usually be used in the disklabel edit.
.Pp
.It Fl v
Tell
.Nm
to be verbose about what it is doing, and what it has found.
.Pp
.It Fl s Ar start
Tell
.Nm
where to start searching for filesystems.
This makes it easier to skip swap
partitions, or other large non-UFS/FFS partitions.
.Pp
.It Fl e Ar end
Ditto for telling
.Nm
where to stop.
It will default to max sectors on the disk if it wasn't specified.
.Pp
.It Ar device
This specifies which device
.Nm
should use to scan for filesystems.
.El
.Sh SEE ALSO
.Xr disklabel 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 2.3
and then in
.Nx 4.0 .
.Sh AUTHORS
.Nm
was written for
.Ox
by
.An Niklas Hallqvist
and
.An Tobias Weingartner .
It was ported to
.Nx
by
.An Juan Romero Pardines .
.Sh BUGS
Currently it won't find FFSv1 partitions with fragsize/blocksize
greater than 2048/16384, and FFSv2 partitions with fragsize/blocksize
greater than 8192/65536.
