NetBSD/src/usr.sbin/mailwrapper/mailer.conf.5
.\"	$NetBSD: mailer.conf.5,v 1.10 2003/02/17 21:18:46 is Exp $
.\"
.\" Copyright (c) 1998
.\" 	Perry E. Metzger.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"	This product includes software developed for the NetBSD Project
.\"	by Perry E. Metzger.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 16, 1998
.Dt MAILER.CONF 5
.Os
.Sh NAME
.Nm mailer.conf
.Nd configuration file for
.Xr mailwrapper 8
.Sh DESCRIPTION
The file
.Pa /etc/mailer.conf
contains a series of lines of the form
.Pp
.Pa name
.Pa program
.Op Ar arguments ...
.Pp
The first word of each line is the
.P name
of a program invoking
.Xr mailwrapper 8
which is typically a symbolic link to
.Pa /usr/sbin/sendmail .
(On a typical system,
.Xr newaliases 1
and
.Xr mailq 1
would be set up this way.)
.Pp
The second word of each line is the name of the
.Pa program
to actually execute when the first name is invoked.
.Pp
The further
.Pa arguments ,
if any, are passed to the
.Pa program ,
followed by the arguments
.Xr mailwrapper 8
was called with.
.Pp
The file may also contain comment lines, denoted by a # mark in the
first column of any line.
.Sh FILES
/etc/mailer.conf
.Sh EXAMPLES
The following is an example of how to set up
.Nm
for traditional
.Xr sendmail 8
invocation behavior.
.Bd -literal
# Execute the "real" sendmail program, named /usr/libexec/sendmail/sendmail
sendmail	/usr/libexec/sendmail/sendmail
send-mail	/usr/libexec/sendmail/sendmail
mailq		/usr/libexec/sendmail/sendmail
newaliases	/usr/libexec/sendmail/sendmail
hoststat	/usr/libexec/sendmail/sendmail
purgestat	/usr/libexec/sendmail/sendmail
.Ed
.Pp
This example shows how to invoke the
.Xr postfix 1
MTA suite in place of
.Xr sendmail 8 .
.Bd -literal
# Emulate sendmail using postfix
sendmail	/usr/libexec/postfix/sendmail
send-mail	/usr/libexec/postfix/sendmail
mailq		/usr/libexec/postfix/sendmail
newaliases	/usr/libexec/postfix/sendmail
.Ed
.Bd -literal
# Send outgoing mail to a smart relay using mini-sendmail without queueing
sendmail	/usr/pkg/sbin/mini-sendmail -srelayhost
send-mail	/usr/pkg/sbin/mini-sendmail -srelayhost
.Ed
.Sh SEE ALSO
.Xr mail 1 ,
.Xr mailq 1 ,
.Xr newaliases 1 ,
.Xr postfix 1 ,
.Xr mailwrapper 8 ,
.Xr sendmail 8
.Sh HISTORY
.Nm
appeared in
.Nx 1.4 .
.Sh AUTHORS
.An Perry E. Metzger Aq perry@piermont.com
.Sh BUGS
The entire reason this program exists is a crock. Instead, a command
for how to submit mail should be standardized, and all the "behave
differently if invoked with a different name" behavior of things like
.Xr mailq 1
should go away.
