NetBSD/src/share/man/man4/man4.sparc/audioamd.4
.\" $NetBSD: audioamd.4,v 1.5.64.1 2020/04/08 14:07:22 martin Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 31, 2020
.Dt AUDIOAMD 4 sparc
.Os
.Sh NAME
.Nm audioamd
.Nd baseboard audio device driver
.Sh SYNOPSIS
.Cd "audioamd0	at mainbus0"
.Cd "audioamd0	at obio0"
.Cd "audioamd0	at sbus0 slot ? offset ?"
.Cd "audio*	at audioamd0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the baseboard audio found on sun4c and sun4m
systems.
The baseboard audio driver is based on the AMD 79c30 ISDN and audio interface.
The interface is only capable of playing and recording 8kHz mu-law audio.
.Sh SEE ALSO
.Xr audio 4 ,
.Xr sbus 4
