NetBSD/src/share/man/man4/man4.sparc/auxreg.4
.\" $NetBSD: auxreg.4,v 1.4 2006/02/25 22:57:09 wiz Exp $
.\"
.\" Copyright (c) 2006 Stephan Meisinger
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 24, 2006
.Dt AUXREG 4 sparc
.Os
.Sh NAME
.Nm auxreg
.Nd Sun SPARC auxiliary register
.Sh SYNOPSIS
.Cd "auxreg0 at mainbus0 # sun4c"
.Cd "auxreg0 at obio0    # sun4m"
.Cd "options BLINK"
.Sh DESCRIPTION
The
.Nm
device contains controls for the front panel LED and various status bits for
the
.Tn SPARC
.Xr sparc/fdc 4
floppy controller.
.Pp
.Cd "options BLINK"
Force the front panel LED to blink.
.Sh SEE ALSO
.Xr sparc/fdc 4
.Sh HISTORY
The
.Nm
appeared in
.Nx 1.0 .
