NetBSD/src/share/man/man4/man4.sparc/le.4
.\"	$NetBSD: le.4,v 1.8 1999/12/15 23:44:54 abs Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: Header: le.4,v 1.2 92/10/13 05:31:33 leres Exp
.\"	from: @(#)le.4	8.1 (Berkeley) 6/9/93
.\"
.Dd June 9, 1993
.Dt LE 4 sparc
.Os
.Sh NAME
.Nm le
.Nd SPARC AMD 7990 LANCE Ethernet interface
.Sh SYNOPSIS
.Cd "le* at sbus? slot ? offset ?"
.Cd "le* at ledma0 slot ? offset ?"
.Cd "le* at lebuffer? slot ? offset ?"
.Sh DESCRIPTION
The
.Nm
interface provides access to the 10 Mb/s
.Tn Ethernet
network via the
.Tn AMD
Am7990
Local Area Network Controller for Ethernet
.Pq Tn LANCE
chip set.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl .
The
.Nm
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and
.Tn Ethernet
addresses on the local
network.
.Pp
Interfaces attached to an
.Sy ledma0
typically have have two types of connectors:
.Pp
.Bl -tag -offset indent -width xxxxxxxxxxxxxxxxxx
.It AUI/DIX
Standard 15 pin connector
.It 10BaseT
UTP, also known as twisted pair
.El
.Pp
The appropriate connector can be selected by supplying a
.Cm media
parameter to
.Xr ifconfig 8 .
The supported arguments for
.Cm media
are:
.Bl -tag -offset indent -width xxxxxxxxxxxxxxxxxx
.It Sy 10base5/AUI
to select the AUI connector, or
.It Sy 10baseT/UTP
to select the UTP connector.
.El
.Pp
If a
.Cm media
parameter is not specified, a default connector is selected for
use by examining all media types for carrier.
The first connector on which a carrier is detected will be selected.
Additionally, if carrier is dropped on a port, the driver will switch between
the possible ports until one with carrier is found.
.Pp
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4 ,
.Xr arp 4
