NetBSD/src/usr.sbin/makefs/makefs.8
.\"	$NetBSD: makefs.8,v 1.76 2026/05/06 03:56:38 lukem Exp $
.\"
.\" Copyright (c) 2001-2003 Wasabi Systems, Inc.
.\" All rights reserved.
.\"
.\" Written by Luke Mewburn for Wasabi Systems, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed for the NetBSD Project by
.\"      Wasabi Systems, Inc.
.\" 4. The name of Wasabi Systems, Inc. may not be used to endorse
.\"    or promote products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY WASABI SYSTEMS, INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL WASABI SYSTEMS, INC
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 6, 2026
.Dt MAKEFS 8
.Os
.Sh NAME
.Nm makefs
.Nd create a file system image from a directory tree
.Sh SYNOPSIS
.Nm
.Op Fl LrxZ
.Op Fl B Ar endian
.Op Fl b Ar free-blocks
.Op Fl d Ar debug-mask
.Op Fl F Ar mtree-specfile
.Op Fl f Ar free-files
.Op Fl M Ar minimum-size
.Op Fl m Ar maximum-size
.Op Fl N Ar userdb-dir
.Op Fl O Ar offset
.Op Fl o Ar fs-options
.Op Fl S Ar sector-size
.Op Fl s Ar image-size
.Op Fl T Ar timestamp
.Op Fl t Ar fs-type
.Ar image-file
.Ar directory
.Op Ar extra-directory ...
.Sh DESCRIPTION
The utility
.Nm
creates a file system image into
.Ar image-file
from the directory tree
.Ar directory .
If any optional directory trees are passed in the
.Ar extra-directory
arguments, then the directory tree of each argument will be merged
into the
.Ar directory
first before creating
.Ar image-file .
No special devices or privileges are required to perform this task.
.Pp
The options are as follows:
.Bl -tag -width flag
.It Fl B Ar endian
Set the byte order of the image to
.Ar endian .
Valid byte orders are
.Ql 4321 ,
.Ql big ,
or
.Ql be
for big endian, and
.Ql 1234 ,
.Ql little ,
or
.Ql le
for little endian.
Some file systems may have a fixed byte order; in those cases this
argument will be ignored.
.It Fl b Ar free-blocks
Ensure that a minimum of
.Ar free-blocks
free blocks exist in the image.
An optional
.Ql %
suffix may be provided to indicate that
.Ar free-blocks
indicates a percentage of the calculated image size.
.It Fl d Ar debug-mask | comma-separated-debug-option
Enable various levels of debugging, depending upon which bits are
set in
.Ar debug-mask .
The mask can also be set by specifying a comma separated list of debugging
options.
These are:
.Bl -tag -width X -offset indent -compact
.It Sy debug_time
Print the time it takes to perform each step.
.It Sy debug_walk_dir
Print each directory as it gets processed.
.It Sy debug_walk_dir_node
Print each file as it gets processed.
.It Sy debug_walk_dir_linkcheck
Print file information for files that have a link count > 1.
.It Sy debug_dump_fsnodes
Dump information about the filesystem nodes.
.It Sy debug_dump_fsnodes_verbose
Enable more detail if
.Dv debug_dump_fsnodes
is enabled.
.It Sy debug_fs_parse_opts
Print debugging information about specific filesystem option parsing.
.It Sy debug_fs_makefs
Print nodes as they are created and enable buffer consistency checks.
.It Sy debug_fs_validate
Enable file-system specific validation (ffs only).
.It Sy debug_fs_create_image
Print image file creation stats (ffs only).
.It Sy debug_fs_size_dir
Print directory size information (ffs only).
.It Sy debug_fs_size_dir_node
Print directory size information per node (ffs only).
.It Sy debug_fs_size_dir_add_dirent
Print directory size information as entries are added (ffs only).
.It Sy debug_fs_populate
Print information at each directory population pass (ffs only).
.It Sy debug_fs_populate_dirbuf
Dump the directory buffer (ffs only).
.It Sy debug_fs_populate_node
Print information about each file during directory population (ffs only).
.It Sy debug_fs_write_file
Print buffer information when writing files (ffs only).
.It Sy debug_fs_write_file_block
Print block information when writing files (ffs only).
.It Sy debug_fs_make_dirbuf
Print directory buffer information (ffs only).
.It Sy debug_fs_write_inode
Print inode information (ffs only).
.It Sy debug_buf_bread
Print block buffer information (ffs only).
.It Sy debug_buf_bwrite
Print block write information (ffs only).
.It Sy debug_buf_getblk
Print block allocation information (ffs only).
.It Sy debug_apply_specfile
Print information about each directory in the specfile.
.It Sy debug_apply_specentry
Print information about each entry in the specfile.
.It Sy debug_apply_speconly
Debug the
.Fl x
special file exclusion.
.El
.It Fl F Ar mtree-specfile
Use
.Ar mtree-specfile
as an
.Xr mtree 8
.Sq specfile
specification.
.Pp
If a specfile entry exists in the underlying file system, its
permissions and modification time will be used unless specifically
overridden by the specfile.
An error will be raised if the type of entry in the specfile
conflicts with that of an existing entry.
.Pp
In the opposite case (where a specfile entry does not have an entry
in the underlying file system) the following occurs:
If the specfile entry is marked
.Sy optional ,
the specfile entry is ignored.
Otherwise, the entry will be created in the image, and it is
necessary to specify at least the following parameters in the
specfile:
.Sy type ,
.Sy mode ,
.Sy gname ,
or
.Sy gid ,
and
.Sy uname
or
.Sy uid ,
.Sy device
(in the case of block or character devices), and
.Sy link
(in the case of symbolic links).
If
.Sy time
isn't provided, the current time will be used.
If
.Sy flags
isn't provided, the current file flags will be used.
Missing regular file entries will be created as zero-length files.
.It Fl f Ar free-files
Ensure that a minimum of
.Ar free-files
free files (inodes) exist in the image.
An optional
.Ql %
suffix may be provided to indicate that
.Ar free-files
indicates a percentage of the calculated image size.
.It Fl L
All symbolic links are followed.
.It Fl M Ar minimum-size
Set the minimum size of the file system image to
.Ar minimum-size .
.It Fl m Ar maximum-size
Set the maximum size of the file system image to
.Ar maximum-size .
An error will be raised if the target file system needs to be larger
than this to accommodate the provided directory tree.
.It Fl N Ar userdb-dir
Use the user database text file
.Pa master.passwd
and group database text file
.Pa group
from
.Ar userdb-dir ,
rather than using the results from the system's
.Xr getpwnam 3
and
.Xr getgrnam 3
(and related) library calls.
.It Fl O Ar offset
Instead of creating the file system at the beginning of the file, start
at offset.
Valid only for
.Sy ffs
and
.Sy msdos .
.It Fl o Ar fs-options
Set file system specific options.
.Ar fs-options
is a comma separated list of options.
Valid file system specific options are detailed below.
.It Fl r
When merging multiple directories replace duplicate files with the last found.
.It Fl S Ar sector-size
Set the file system sector size to
.Ar sector-size .
Defaults to 512 for most file systems, but is 2048 for
.Sy cd9660
and
.Sy udf
for CD/DVD/BD optical media types.
.It Fl s Ar image-size
Set the size of the file system image to
.Ar image-size .
This is equivalent of setting both the minimum
.Fl ( M )
and the maximum
.Fl ( m )
sizes to
.Ar image-size .
For
.Sy ffs
and
.Sy msdos
the
.Ar offset
is not included on that size.
.It Fl T Ar timestamp
Specify a timestamp to be set for all file system files and directories
created so that repeatable builds are possible.
The
.Ar timestamp
can be a
.Pa pathname ,
where the timestamps are derived from that file, a parseable date
for
.Xr parsedate 3
(this option is not yet available in the tools build), or an integer
value interpreted as the number of seconds from the Epoch.
Note that timestamps specified in an
.Xr mtree 5
spec file, override the default timestamp.
When this option is enabled, file systems that regularly use
.Xr localtime 3
to convert times to the native format (such as udf and cd9660), use
.Xr gmtime 3
instead with the specified timestamps so that they are immune to
timezone changes and get consistent timestamps.
.It Fl t Ar fs-type
Create an
.Ar fs-type
file system image.
The following file system types are supported:
.Bl -tag -width cd9660 -offset indent
.It Sy cd9660
ISO 9660 file system.
.It Sy chfs
Chip flash file system.
.It Sy ffs
BSD fast file system (default).
.It Sy msdos
FAT12, FAT16, or FAT32 file system.
.It Sy udf
ISO/Ecma UDF file system.
.It Sy v7fs
7th Edition(V7) file system.
.El
.It Fl x
Exclude file system nodes not explicitly listed in the specfile.
Repeating this flag causes
.Nm
to print a warning for each missing system nodes and exit with an error code
if there are any missing.
.It Fl Z
Create a sparse file for
.Sy ffs .
This is useful for virtual machine images.
.El
.Pp
Where sizes are specified, a decimal number of bytes is expected.
Two or more numbers may be separated by an
.Sq x
to indicate a product.
Each number may have one of the following optional suffixes:
.Bl -tag -width 3n -offset indent -compact
.It Sy b
Block; multiply by 512
.It Sy k
Kibi; multiply by 1024 (1 KiB)
.It Sy m
Mebi; multiply by 1048576 (1 MiB)
.It Sy g
Gibi; multiply by 1073741824 (1 GiB)
.It Sy t
Tebi; multiply by 1099511627776 (1 TiB)
.It Sy w
Word; multiply by the number of bytes in an integer
.El
.\"
.Ss FFS-specific fs-options
.Sy ffs
images have ffs-specific optional parameters that may be provided.
Each of the options consists of a keyword, an equal sign
.Pq Ql = ,
and a value.
The following keywords are supported:
.Pp
.Bl -tag -width X -offset indent -compact
.It Cm avgfilesize= Ns Ar num , Cm a= Ns Ar num
Expected average file size.
Range: 1..2147483647.
.It Cm avgfpdir= Ns Ar num , Cm n= Ns Ar num
Expected number of files per directory.
Range: 1..2147483647.
.It Cm bsize= Ns Ar num , Cm b= Ns Ar num
Block size.
Range: 1..2147483647.
.It Cm density= Ns Ar num , Cm d= Ns Ar num
Bytes per inode.
Range: 1..2147483647.
.It Cm extattr= Ns Ar num , Cm e= Ns Ar num
UFS2 with extended attributes.
One of:
0 to disable, or
1 to enable.
.It Cm extent= Ns Ar num , Cm x= Ns Ar num
Maximum extent size.
Range: 1..2147483647.
.It Cm fsize= Ns Ar num , Cm f= Ns Ar num
Fragment size.
Range: 1..2147483647.
.It Cm label= Ns Ar str , Cm l= Ns Ar str
Label name of the image.
Range: 1..32 characters.
.It Cm maxbpcg= Ns Ar num , Cm g= Ns Ar num
Maximum total number of blocks in a cylinder group.
Range: 1..2147483647.
.It Cm maxbpg= Ns Ar num , Cm M= Ns Ar num
Maximum blocks per file in a cylinder group.
Range: 1..2147483647.
.It Cm minfree= Ns Ar num , Cm m= Ns Ar num
Minimum % free.
Range: 0..99.
.It Cm optimization= Ns Ar str , Cm o= Ns Ar str
Optimization preference; one of
.Ql space
or
.Ql time .
.It Cm version= Ns Ar num , Cm v= Ns Ar num
File system format version, compatible with the
.Fl O
option of
.Xr newfs 8 .
One of:
0 for FFSv1 with the old level 1 format,
1 for FFSv1 (default, level 4), or
2 for FFSv2 (UFS2).
.El
.\"
.Ss CD9660-specific fs-options
.Sy cd9660
images have ISO9660-specific optional parameters that may be
provided.
The arguments consist of a keyword and, optionally, an equal sign
.Pq Ql = ,
and a value.
The following keywords are supported:
.Pp
.Bl -tag -width X -offset indent -compact
.It Cm allow-deep-trees , Cm D
Allow the directory structure to exceed the maximum specified in
the spec.
.It Cm allow-illegal-chars , Cm i
Allow illegal characters in filenames.
.It Cm allow-lowercase
Allow lowercase characters in filenames.
.It Cm allow-max-name , Cm a
Allow 37 instead of 33 characters for filenames by omitting the
version ID.
.It Cm allow-multidot , Cm m
Allow multiple dots in a filename.
.It Cm applicationid= Ns Ar str , Cm A= Ns Ar str
Application ID of the image.
.It Cm archimedes
Use the
.Ql ARCHIMEDES
extension to encode
.Tn RISC OS
metadata.
.It Cm boot-load-segment= Ns str
Set load segment for the boot image.
.It Cm bootimage= Ns str , Cm B= Ns str
Filename of a boot image in the format
.Dq sysid;filename ,
where
.Dq sysid
is one of
.Ql efi ,
.Ql i386 ,
.Ql mac68k ,
.Ql macppc ,
or
.Ql powerpc .
.It Cm bootimagedir= Ns str
Boot image directory.
.It Cm chrp-boot , Cm C
Write an MBR partition table to the image to allow older CHRP hardware to
boot.
.It Cm follow-symlinks , Cm S
Resolve symlinks in pathnames.
.It Cm generic-bootimage= Ns Ar str , Cm G= Ns Ar str
Load a generic boot image into the first 32K of the cd9660 image.
.It Cm hard-disk-boot
Boot image is a hard disk image.
.It Cm help , Cm h
Show help message.
.It Cm isolevel= Ns Ar num , Cm l= Ns Ar num
ISO9660 level.
Range: 1..3.
.It Cm keep-bad-images , Cm K
Don't throw away images whose write was aborted due to an error.
For debugging purposes.
.It Cm label= Ns Ar str , Cm L= Ns Ar str
Label name of the image.
.It Cm no-boot
Boot image is not bootable.
.It Cm no-emul-boot
Boot image is a
.Dq no emulation
ElTorito image.
.It Cm no-trailing-padding
Do not pad the image (apparently Linux needs the padding).
.It Cm omit-trailing-period
Omit trailing periods in filenames.
.It Cm platformid= Ns Ar str
Set platform ID of section header entry of the boot image.
.It Cm preparer= Ns Ar str , Cm p= Ns Ar str
Preparer ID of the image.
.It Cm publisher= Ns Ar str , Cm P= Ns Ar str
Publisher ID of the image.
.It Cm rockridge , Cm R
Use RockRidge extensions (for longer filenames, etc.).
.It Cm verbose= Ns Ar num , Cm v= Ns Ar num
Verbose level.
Range: 0..2.
.It Cm volumeid= Ns Ar str , Cm V= Ns Ar str
Volume set identifier of the image.
.El
.\"
.Ss CHFS-specific fs-options
.Sy chfs
images have chfs-specific optional parameters that may be provided.
Each of the options consists of a keyword, an equal sign
.Pq Ql = ,
and a value.
The following keywords are supported:
.Pp
.Bl -tag -width X -offset indent -compact
.It Cm erasesize= Ns Ar num , Cm e= Ns Ar num
Erase block size of the media.
Range: 1..2147483647.
.It Cm mediatype= Ns Ar num , Cm m= Ns Ar num
Type of the media.
One of:
0 for NOR, or
1 for NAND.
.It Cm pagesize= Ns Ar num , Cm p= Ns Ar num
Pagesize.
Range: 1..2147483647.
.El
.\"
.Ss msdos-specific fs-options
.Sy msdos
images have MS-DOS-specific optional parameters that may be
provided.
The arguments consist of a keyword, an equal sign
.Pq Ql = ,
and a value.
The following keywords are supported (see
.Xr newfs_msdos 8
for more details):
.Pp
.Bl -tag -width X -offset indent -compact
.It Cm backup_sector= Ns Ar num , Cm k= Ns Ar num
Location of the backup boot sector.
Range: 1..65535.
.It Cm block_size= Ns Ar num , Cm b= Ns Ar num
Block size.
Range: 1..4294967295.
.It Cm bootstrap= Ns Ar str , Cm B= Ns Ar str
Bootstrap file.
.It Cm bytes_per_sector= Ns Ar num , Cm S= Ns Ar num
Bytes per sector.
Range: 1..65535.
.It Cm create_size= Ns Ar num , Cm C= Ns Ar num
Create file size.
Range: 0..18446744073709551615.
.It Cm directory_entries= Ns Ar num , Cm e= Ns Ar num
Directory entries.
Range: 1..65535.
.It Cm drive_heads= Ns Ar num , Cm h= Ns Ar num
Drive heads.
Range: 1..65535.
.It Cm fat_type= Ns Ar num , Cm F= Ns Ar num
FAT type.
One of: 12, 16, or 32.
.It Cm floppy= Ns Ar str , Cm f= Ns Ar str
Preset drive parameters for standard format floppy disks.
One of:
160, 180, 320, 360, 640, 720, 1200, 1232, 1440, or 2880.
.It Cm hidden_sectors= Ns Ar num , Cm o= Ns Ar num
Hidden sectors.
Range: 0..4294967295.
.It Cm info_sector= Ns Ar num , Cm i= Ns Ar num
Location of the info sector.
Range: 1..65535.
.It Cm media_descriptor= Ns Ar num , Cm m= Ns Ar num
Media descriptor.
Range: 0..255.
.It Cm no_create , Cm N
Don't create file system, print params only.
.It Cm num_FAT= Ns Ar num , Cm n= Ns Ar num
Number of FATs.
Range: 1..255.
.It Cm OEM_string= Ns Ar str , Cm O= Ns Ar str
OEM string.
.It Cm offset= Ns Ar num , Cm @= Ns Ar num
Offset in device.
Range: 0..18446744073709551615.
.It Cm reserved_sectors= Ns Ar num , Cm r= Ns Ar num
Reserved sectors.
Range: 1..65535.
.It Cm sectors_per_cluster= Ns Ar num , Cm c= Ns Ar num
Sectors per cluster.
Range: 1..255.
.It Cm sectors_per_fat= Ns Ar num , Cm a= Ns Ar num
Sectors per FAT.
Range: 1..4294967295.
.It Cm sectors_per_track= Ns Ar num , Cm u= Ns Ar num
Sectors per track.
Range: 1..65535.
.It Cm size= Ns Ar num , Cm s= Ns Ar num
File System size.
Range: 1..4294967295.
.It Cm utf8
Use UTF8 names.
.It Cm volume_id= Ns Ar num , Cm I= Ns Ar num
Volume ID.
Range: 1..4294967295.
.It Cm volume_label= Ns Ar str , Cm L= Ns Ar str
Volume Label.
.El
.\"
.Ss V7FS-specific fs-options
The following keywords are supported:
.Pp
.Bl -tag -width X -offset indent -compact
.It Cm pdp , Cm p
PDP endian.
.It Cm progress , Cm P
Display a progress meter for the file system construction and file
population.
.El
.\"
.Ss UDF-specific fs-options
.Nm
supports besides writing to image files also direct formatting of disc
partitions and optical media.
Optical media will auto configure settings.
The following udf-specific optional parameters may be provided.
Each of the options consists of a keyword, an equal sign
.Pq Ql = ,
and a value.
The following keywords are supported:
.Pp
.Bl -tag -width X -offset indent -compact
.It Cm checksurface , Cm c
Check the surface of non error-free rewritable media for remapping.
Note this is a destructive test and can take quite a while!
.It Cm discid= Ns Ar str , Cm P= Ns Ar str
Set the physical volume label of the disc to the specified argument.
Prepend the physical volume label with a volumeset label separated
with a ':' if wanted.
For strict conformance and interchange, don't set the volumeset label
manually unless it has an unique hex number in the first 8 character
positions.
.It Cm disctype= Ns Ar str , Cm T= Ns Ar str
This can have the following values:
.Bl -tag -width cdromXdvdromXbdromXXX -compact
.It Sy cdrom , Sy dvdrom , Sy bdrom
create a read-only fs
.It Sy dvdram , Sy bdre , Sy disk
create a rewritable fs without sparing for defective sectors
.It Sy cdr , Sy dvdr , Sy bdr
create a rewritable fs on once recordable media using a VAT
.It Sy cdrw , Sy dvdrw
create a rewritable fs with sparing for defective sectors
.El
The sectorsize is set for the selected media and the default maximum disc size
is assumed unless overridden.
For CD-ROM, DVD-ROM and BD-ROM images, the disc
size is the minimum size needed.
Note that the size estimator can
under-estimate in some cases; specify extra free blocks if encountering this.
.It Cm forceformat , Cm F
Force formatting on non-empty recordable media.
.It Cm loglabel= Ns Ar str , Cm L= Ns Ar str
Set the logical volume label of the disc to the specified argument.
.It Cm maxver= Ns Ar str , Cm V= Ns Ar str
Set the maximum UDF version to be used.
Choose UDF version numbers from 0x102, 0x150, 0x200, 0x201, and 0x250.
Version 0x260 is currently not supported
in
.Nm .
.It Cm metaperc= Ns Ar num , Cm p= Ns Ar num
Set the minimum amount of free metadata space.
This is only applicable on UDF 0x250 on rewritable media.
Range: 1..99.
.It Cm minver= Ns Ar str , Cm v= Ns Ar str
Set the minimum UDF version to be used.
Choose UDF version numbers from 0x102, 0x150, 0x200, 0x201, and 0x250.
Version 0x260 is currently not supported
in
.Nm .
.It Cm tz= Ns Ar num , Cm t= Ns Ar num
Timezone, in hours.
Range: -24..24.
.El
.Sh SEE ALSO
.Xr strsuftoll 3 ,
.Xr installboot 8 ,
.Xr mtree 8 ,
.Xr newfs 8
.Sh HISTORY
The
.Nm
utility appeared in
.Nx 1.6 .
.Sh AUTHORS
.An Luke Mewburn
(original program),
.An Daniel Watt ,
.An Walter Deignan ,
.An Ryan Gabrys ,
.An Alan Perez-Rathke ,
.An Ram Vedam
(cd9660 support),
.An UCHIYAMA Yasushi
(v7fs support),
.An Tamas Toth
(chfs support),
.An Christos Zoulas
(msdos support),
.An Reinoud Zandijk
(udf support).
