NetBSD/src/usr.sbin/wsfontload/wsfontload.8
.\"	$NetBSD: wsfontload.8,v 1.1 1999/01/13 19:02:34 drochner Exp $
.\"
.Dd January 13, 1999
.Os
.Dt WSFONTLOAD 8
.Sh NAME
.Nm wsfontload
.Nd load a font bitmap into a wscons display device
.Sh SYNOPSIS
.Nm
.Op Fl f Ar <ctldev>
.Op Fl w Ar <width>
.Op Fl h Ar <height>
.Op Fl e Ar <encoding>
.Op Fl N Ar <name>
.Op Ar fontfile
.Sh DESCRIPTION
The
.Nm
utility loads a font bitmap to a wscons device if the device driver
supports this.
The font gets assigned a name in this process which it can be referred to
by later for use on a display screen.
The font is loaded from the specified
.Ar fontfile ,
or from
.Pa stdin
if
.Ar fontfile
is not provided.
.Pp
The options are:
.Bl -tag -width xxxxxxxxxxx
.It Fl f Ar ctldev
Specify the control device of the wscons display to operate on.
Default is
.Pa /dev/ttyEcfg .
.It Fl w Ar width
Sets the width of a font character in pixels. Default is 8.
.It Fl h Ar height
Sets the width of a font character in pixels. Default is 16.
.It Fl e Ar encoding
Sets the encoding of the font. This can be either a symbolic abbreviation
or a numeric value. Currently recognized abbreviations are
.Dq iso
for ISO-8859-1 encoding,
.Dq ibm
for IBM encoded fonts and
.Dq pcvt
for the custom encoding of the supplemental fonts which came with
the BSD
.Dq pcvt
console driver. Per default,
.Dq iso
is assumed.
.It Fl N Ar name
Specifies a name which can be used later to refer to the font.
In none is given, the
.Ar fontfile
name is used to create one.
.El
.Sh BUGS
Many features are missing.
.Sh "SEE ALSO"
.Xr wsconscfg 8
.Xr wscons 4
