NetBSD/src/sbin/devpubd/devpubd.8
.\"	$NetBSD: devpubd.8,v 1.1.2.1 2013/01/16 05:32:32 yamt Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 22, 2012
.Dt DEVPUBD 8
.Os
.Sh NAME
.Nm devpubd
.Nd device publish daemon for automatic device node creation
.Sh SYNOPSIS
.Nm
.Op Fl f
.Sh DESCRIPTION
.Nm
listens on
.Xr drvctl 4
for new devices and creates their device nodes using
.Xr MAKEDEV 8
if they are missing.
.Pp
When
.Fl f
is specified,
.Nm
does not go into the background.
.Pp
.Nm
runs
.Pa /libexec/devpubd-run-hooks .
This script runs each script found in
.Pa /libexec/devpubd-hooks
in a lexical order with two arguments:
.Ar device-attach
or
.Ar device-detach
and the device file name.
The default installation supplies the
.Pa 01-makedev
script for creating a device node.
Additional scripts may be added for other dynamic device actions.
.Sh SEE ALSO
.Xr drvctl 8 ,
.Xr MAKEDEV 8
