NetBSD/src/share/man/man4/acpismbus.4
.\" $NetBSD: acpismbus.4,v 1.1 2010/02/06 20:11:33 pgoyette Exp $
.\"
.\" Copyright (c) 2009 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Goyette
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October XXX, 2009
.Dt ACPISMBUS 4
.Os
.Sh NAME
.Nm acpismbus
.Nd ACPI SMBus Control Method Interface
.Sh SYNOPSIS
.Cd "acpismbus* at acpi?"
.Cd "iic* at acpismbus?"
.Sh DESCRIPTION
The
.Nm
driver supports instances of the ACPI SMBus Control Method Interface.
This enables i2c access to bus segments which might not otherwise be
accessible due to missing "native" driver support.
The SMBus Process Call protocol is not supported.
All other SMBus protocols are supported to the extent that the underlying
controller supports them.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr iic 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 6.0 .
.Sh BUGS
Although
.Nm
SMBus Alerts can be associated with individual devices, this
capability is ignored.
When an
.Nm
SMBus Alert is generated, all devices on the i2c bus segment which have
registered an interrupt routine are notified.
.Pp
The SMBus CMI protocol defines a method to provide a list of devices on an
i2c bus segment and their addresses.
The
.Nm
driver makes no attempt to retrieve or process this device list.
.Pp
There is currently no way to determine if the i2c controller managed by
an instance of the ACPI SMBus CMI can also be accessed using a native
device driver.
Therefore, the
.Nm
driver should not be enabled by default.
If both a native driver and the
.Nm
driver attempt to access the same i2c bus segment, the results are
undefined.
