NetBSD/src/share/man/man4/acpiwdrt.4
.\"	$NetBSD: acpiwdrt.4,v 1.1 2011/01/17 16:08:20 jmcneill Exp $
.\"
.\" Copyright (c) 2011 Jared D. McNeill <jmcneill@invisible.ca>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 17, 2011
.Dt ACPIWDRT 4
.Os
.Sh NAME
.Nm acpiwdrt
.Nd ACPI Watchdog Resource Table device driver
.Sh SYNOPSIS
.Cd "acpiwdrt* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for watchdog timers specified in
.Tn ACPI
"WDRT" tables.
The
.Nm
watchdog timer is configurable via the
.Xr wdogctl 8
utility.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr wdogctl 8 ,
.Pa http://www.microsoft.com/whdc/system/sysinternals/watchdog.mspx
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 6.0 .
