NetBSD/src/share/man/man4/acpiwmi.4
.\" $NetBSD: acpiwmi.4,v 1.5 2010/10/24 08:54:15 jruoho Exp $
.\"
.\" Copyright (c) 2010 Jukka Ruohonen <jruohonen@iki.fi>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 23, 2010
.Dt ACPIWMI 4
.Os
.Sh NAME
.Nm acpiwmi
.Nd Windows Management Instrumentation support for
.Tn ACPI
.Sh SYNOPSIS
.Cd "acpiwmi* at acpi?"
.Cd "acpiwmibus* at acpiwmi?"
.Cd "wmidell* at acpiwmibus?"
.Cd "wmihp* at acpiwmibus?"
.Cd "wmimsi* at acpiwmibus?"
.Sh DESCRIPTION
The
.Nm
device driver provides an
.Tn ACPI
interface for Windows Management Instrumentation
.Pq Tn WMI .
The
.Tn ACPI
.Tn WMI
interface is typically used to support vendor
specific features found in various laptops.
.Pp
The following
.Tn WMI
mappings are supported:
.Bl -tag -width "wmidell " -offset indent
.It Sy wmidell
Dell laptops
.It Sy wmihp
Hewlett-Packard laptops
.It Sy wmimsi
MSI laptops
.El
.Pp
The functionality varies from vendor to vendor.
Typically the interface is used for function and hotkey handling,
but additional features may be present.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr acpidalb 4
.Rs
.%A Microsoft Corporation
.%D December 4, 2001
.%T Windows Instrumentation: WMI and ACPI
.%U http://www.microsoft.com/whdc/system/pnppwr/wmi/wmi-acpi.mspx
.Re
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 6.0 .
.Sh AUTHORS
.An Jukka Ruohonen
.Aq jruohonen@iki.fi
wrote
.Nm
and most of the mappings.
.Sh CAVEATS
While
.Tn WMI
should provide a certain degree of portability across laptop
models from a particular vendor, there is no guarantee that the mappings
are functional in all models.
.Pp
The
.Sy wmihp
driver may conflict with
.Xr hpqlb 4 .
