NetBSD/src/share/man/man4/acpi.4
.\" $NetBSD: acpi.4,v 1.7 2003/01/06 19:43:58 christos Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 24, 2002
.Dt ACPI 4
.Os
.Sh NAME
.Nm acpi
.Nd Advanced Control and Power Interface
.Sh SYNOPSIS
.Cd "acpi0     at mainbus0"
.Cd "acpiacad* at acpi?"
.Cd "acpibat*  at acpi?"
.Cd "acpibut*  at acpi?"
.Cd "acpiec*   at acpi?"
.Cd "acpilid*  at acpi?"
.Cd "acpitz*   at acpi?"
.Cd "com*      at acpi?"
.Cd "fdc*      at acpi?"
.Cd "lpt*      at acpi?"
.Cd "npx*      at acpi?"
.Cd "pckbc*    at acpi?"
.Cd "spic*     at acpi?"
.Cd "wss*      at acpi?"
.Pp
.Cd "options   ACPIVERBOSE"
.Cd "options   ACPI_PCI_FIXUP=1"
.Cd "options   ACPI_ACTIVATE_DEV=0"
.Sh DESCRIPTION
.Nx
provides machine-independent bus support for
.Tn ACPI
devices.
.Pp
The
.Dv "ACPI_PCI_FIXUP"
option determines if the ACPI driver should attempt to set
up PCI interrupt routing.  The default is to do the fixup.
.Pp
The
.Dv "ACPI_ACTIVATE_DEV"
option determines if the ACPI driver should attempt to activate
inactive devices.  The default is off.
.Sh SEE ALSO
.Xr acpiacad 4 ,
.Xr acpibat 4 ,
.Xr acpibut 4 ,
.Xr acpiec 4 ,
.Xr acpilid 4 ,
.Xr acpitz 4 ,
.Xr apm 4 ,
.Xr com 4 ,
.Xr fdc 4 ,
.Xr lpt 4 ,
.Xr npx 4 ,
.Xr pci 4 ,
.Xr pckbc 4 ,
.Xr spic 4 ,
.Xr wss 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.6 .
.Sh BUGS
The
.Tn ACPI
implementation is very incomplete and so are the man pages.
