NetBSD/src/share/man/man4/adbms.4
.\" $NetBSD: adbms.4,v 1.4 2007/12/08 11:06:53 wiz Exp $
.\"
.\" Copyright (c) 2007
.\" 	Michael Lorenz.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 14, 2007
.Os
.Dt ADBMS 4
.Sh NAME
.Nm adbms
.Nd support for ADB mice, trackballs, and touchpads
.Sh SYNOPSIS
.Cd "adbms* at nadb?"
.Cd "wsmouse* at adbms?"
.Sh DESCRIPTION
The
.Nm
driver handles most relative ADB pointing devices within the
.Xr wscons 4
framework.
For touchpads it also provides support for translating tapping the
pad to mouse button events.
.Pp
Tapping support can be turned on or off on a per-device basis using
.Xr sysctl 8 :
.Bl -tag
.It Dv machdep.adbms0.tapping
0 disables tapping, 1 enables it.
.El
.Sh SEE ALSO
.Xr nadb 4 ,
.Xr wsmouse 4 ,
.Xr wsconsctl 8
