NetBSD/src/share/man/man4/adm1026hm.4
.\"	$NetBSD: adm1026hm.4,v 1.5 2026/06/05 08:54:22 jdc Exp $
.\"
.\" Copyright (c) 2015 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Julian Coleman.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 16, 2026
.Dt ADM1026HM 4
.Os
.Sh NAME
.Nm adm1026hm
.Nd Analog Devices ADM1026 complete thermal system management controller
.Sh SYNOPSIS
.Cd "adm1026hm* at iic? addr?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Analog Devices ADM1026 hardware monitor.
The chip possesses 8 fan speed sensors, 3 temperature sensors,
and 17 voltage sensors.
The number of each sensor type configured by the driver depends on the
chip configuration.
.Pp
The values of the sensors are made available through the
.Xr envstat 8
interface.
.Bl -column ".Li V3.3 standby" "V DC" -offset indent
.It Sy Sensor     Ta Sy Units  Ta Sy Description
.It Li fan Ar N      Ta RPM    Ta Fan 0\^\(en7
.It Li internal      Ta C      Ta Internal temperature
.It Li external Ar N Ta C      Ta External temperature 1\(en2
.It Li Vbatt         Ta V DC   Ta Battery voltage
.It Li V3.3 standby  Ta V DC   Ta 3.3V standby voltage
.It Li V3.3 main     Ta V DC   Ta 3.3V main voltage
.It Li V5.0          Ta V DC   Ta 5.0V supply voltage
.It Li V+12          Ta V DC   Ta +12V supply voltage
.It Li V-12          Ta V DC   Ta \-12V supply voltage
.It Li V3.3 Ar N     Ta V DC   Ta Analog in (3.3V reference) 0\^\(en5
.It Li V2.5 Ar N     Ta V DC   Ta Analog in (2.5V reference) 0\^\(en3
.El
.Pp
Configurable limits for the sensors are also available via
.Xr envstat 8 .
Initial limit values are read from the chip.
Each temperature sensor has a high, therm and low limit, which are
mapped to
.Fa critmax ,
.Fa warnmax
and
.Fa warnmin ,
respectively.
Voltage sensors have high
.Pq Fa warnmax
and low
.Pq Fa warnmin
limits.
Fan sensors have a high limit mapped to
.Fa warnmin ,
because the fan measurements are revolution intervals, so higher
numbers correlate to lower fan speeds.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 8.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Julian Coleman Aq Mt jcoleman@NetBSD.org .
.Sh BUGS
It's not possible to determine if either a sensor is not connected,
or the monitored device is producing no output.
Therefore, unconnected sensors will show outputs of 0.
.Pp
The
.Nm
driver does not support interrupt output nor the built-in EEPROM.
