NetBSD/src/share/man/man4/admtemp.4
.\"	$NetBSD: admtemp.4,v 1.6 2016/01/03 21:58:17 jdc Exp $
.\"
.\"	$OpenBSD: admtemp.4,v 1.8 2007/05/31 19:19:48 jmc Exp $
.\"
.\" Copyright (c) 2005 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd December 31, 2015
.Dt ADMTEMP 4
.Os
.Sh NAME
.Nm admtemp
.Nd Analog Devices ADM1021 temperature sensor
.Sh SYNOPSIS
.Cd "admtemp* at iic? addr 0x18"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Analog Devices ADM1021,
Analog Devices ADM1023, Analog Devices ADM1032, Genesys Logic GL523SM,
Global Mixed-mode Technology G781, Texas Instruments LM84, Maxim 1617,
Maxim 1617A, Philips Semiconductors NE1617A, and Xeon embedded temperature
sensors.
The device possesses internal and external temperature sensors, and
programmable low and high temperature limits, with a temperature range of
-65 to +127 degC and a resolution of 1 degC.
.Pp
On i386 machines, this driver also supports the Xeon embedded
I2C temperature probes.
In this case, however, only one temperature value is provided.
.Pp
Exceeding the temperature limits causes the device to assert an Alarm signal,
which can be used by other hardware to detect critical conditions.
.Pp
Some sensors differ from the ADM1021, MAX1617 and NE1617A:
.Bl -item -offset indent
.It
The ADM1021A, ADM1023, ADM1032, and G781 have a temperature range of 0 to
+127 degC and a resolution of 1 degC.
.It
The LM84 has no low temperature limits.
.It
The ADM1023, ADM1032, and G781 have extended precision remote temperature
sensors, with a range of 0 to +127.875 degC and a resolution of 0.125 degC.
.It
The ADM1032 and G781 have additional high temperature limits with a range of
0 to +127 degC and a resolution of 1 degC.
If these are exceeded, a separate Therm signal is asserted.
.El
.Pp
The sensor and limit values are made available through the
.Xr envstat 8
interface.
For devices without additional high temperature limits, the limits that are
displayed and set are the critical limits.
For devices with additional high temperature limits, high and low temperature
warning limits and high temperature critical limits are displayed and can be
set.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr envstat 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Theo de Raadt Aq Mt deraadt@openbsd.org .
Extended precision temperatures, and limit display and setting were added by
.An Julian Coleman Aq Mt jdc@NetBSD.org .
.Sh BUGS
Limit sensors occasionally read as 0xff.
If this occurs, the
.Nm
driver will ignore that limit.
