NetBSD/src/share/man/man4/adt7467c.4
.\"	$NetBSD: adt7467c.4,v 1.1 2005/09/12 03:19:51 macallan Exp $
.\"
.\" Copyright (c) 2005 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Michael Lorenz.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 11, 2005
.Dt ADT7467C 4
.Os
.Sh NAME
.Nm adt7467c
.Nd Analog Devices ADT7467 and ADM1030 hardware monitors and fan controllers
.Sh SYNOPSIS
.Cd "adt7467c0 at ki2c?"
.\" .Cd "adm1030c at ki2c?"
.\" .Cd "adt7467c at iic? addr 0x5c"
.\" .Cd "adm1030c at iic? addr 0x58"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Analog Devices
ADT7467 and ADM1030 hardware monitor chips to be used with the
.Xr envsys 4
API.
.Pp
The ADT7467 supports five sensors:
.Bl -column "Sensor" "Units" "Typical" -offset indent
.It Sy "Sensor" Ta Sy "Units" Ta Sy "Typical Use"
.It Li "temp0" Ta "uK" Ta "chip temperature"
.It Li "temp1" Ta "uK" Ta "CPU temperature"
.It Li "temp2" Ta "uK" Ta "GPU temperature"
.It Li "voltage0" Ta "uV DC" Ta "CPU Vcore"
.It Li "fan0" Ta "RPM" Ta "Chassis Fan"
.El
.Pp
The ADM1030 supports three sensors:
.Bl -column "Sensor" "Units" "Typical" -offset indent
.It Sy "Sensor" Ta Sy "Units" Ta Sy "Typical Use"
.It Li "temp0" Ta "uK" Ta "chip temperature"
.It Li "temp1" Ta "uK" Ta "CPU temperature"
.It Li "fan0" Ta "RPM" Ta "Chassis Fan"
.El
.Pp
Due to hardware limitations, fresh sensor data is only available
every 2 seconds.
.Pp
Both controllers support fan speed control based on temperature
thresholds - the fan will spin up when any thermal sensor reaches
its configured threshold, it will go faster with higher temperature
and slow down when temperature sinks.
The fan will be turned off when the sensor(s) that triggered it
report a temperature about 5C below threshold.
All thresholds are configurable via sysctl:
.Bd -literal -offset indent
machdep.adt7467c0.temp0 = 56
machdep.adt7467c0.temp1 = 85
machdep.adt7467c0.temp2 = 76
.Ed
.Pp
Every threshold corresponds to a temperature sensor, so with the
ADM1030 there will be only two of them.
Both chips use degree Celsius to specify temperature thresholds so
that's what the sysctl interface uses too.
Configuring a threshold below room temperature will essentially
turn on the fan permanently, values above 85C will be rejected.
.Sh HISTORY
The
.Nm
device appeared in
.Nx 4.0 .
.Sh BUGS
The drivers have been tested with iBooks only so far.
The ADT7467 supports more fan speed sensors but these are unused
in iBooks.
