NetBSD/src/share/man/man4/aht20temp.4
.\" $NetBSD: aht20temp.4,v 1.1 2022/11/17 19:20:05 brad Exp $
.\"
.\" Copyright (c) 2022 Brad Spencer <brad@anduin.eldar.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd November 15, 2022
.Dt AHT20TEMP 4
.Os
.Sh NAME
.Nm aht20temp
.Nd Driver for Guangzhou Aosong AHT20 sensor chip via I2C bus
.Sh SYNOPSIS
.Cd "aht20temp* at iic? addr 0x38"
.Sh DESCRIPTION
The
.Nm
driver provides measurements from the AHT20 humidity/temperature
sensors via the
.Xr envsys 4
framework.
The
.Nm
.Ar addr
argument selects the address at the
.Xr iic 4
bus.
The crc validity can be changed through
.Xr sysctl 8
nodes.
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 3
variables are provided:
.Bl -tag -width indent
.It Li hw.aht20temp0.ignorecrc
If set, the crc calculation for %RH and temperature will be ignored.
.It Li hw.aht20temp0.debug
If the driver is compiled with
.Dv AHT20_DEBUG ,
this node will appear and can be used to set the debugging level.
.It Li hw.aht20temp0.readattempts
To read %RH or temperature the chip requires that the command be sent,
then a delay must be observed before a read can be done to get the values
back.
The delays are documented in the datasheet for the chip.
The driver will attempt to read back the values readattempts number of
times.
The default is 10 which should be more than enough for most purposes.
.El
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr iic 4 ,
.Xr envstat 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 10.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Brad Spencer Aq Mt brad@anduin.eldar.org .
