NetBSD/src/share/man/man4/akbd.4
.\"	$NetBSD: akbd.4,v 1.5 2026/04/06 22:12:14 andvar Exp $
.\"
.\" Copyright (c) 2003 Alex Zepeda <zipzippy@sonic.net>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Alex Zepeda.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 20, 2025
.Dt AKBD 4
.Os
.
.Sh NAME
.
.Nm akbd
.Nd Apple Desktop Bus keyboard driver for wscons
.Sh SYNOPSIS
.Cd "akbd* at obio?"
.Cd "wskbd* at akbd? console ?"
.Pp
.Cd "options ALTXBUTTONS"
.Cd "options CAPS_IS_CONTROL"
.Cd "options FORCE_FUNCTION_KEYS"
.
.Sh DESCRIPTION
.
This driver provides the
.Xr wscons 4
driver with support for Apple Desktop Bus keyboards.
.Bl -tag -width Cd
.
.It Cd "options ALTXBUTTONS"
.
To map
.Sm off
.Ao Option Ac \&+ Aq 1 ,
.Sm on
.Sm off
.Ao Option Ac \&+ Aq 2 ,
.Sm on
.Sm off
.Ao Option Ac \&+ Aq 3 ,
.Sm on
to mouse buttons 1, 2, and 3
respectively.
.
.It Cd options CAPS_IS_CONTROL
.
On macppc systems it is possible to tweak the keyboard driver to treat
the caps lock key on an
.Tn ADB
keyboard as a control key.
This requires special remapping because of
.Tn ADB Ap s
strange emulation of a mechanically-locked key.
.
.It Cd options FORCE_FUNCTION_KEYS
.
On macppc PowerBooks, several function keys double as
.Dq hot keys
.Pq brightness, volume, eject
when the
.Aq \&Fn
modifier is held down.
Mac OS\~X likes to reprogram the keyboard controller to send hot key
events when
.Aq \&Fn
is
.Em not
held down and send function key events when it is.
With this option you can transform the non-keyboard
.Dq button
events back into function key events.
.El
.
.Ss Special Keys
.
To work around the limited number of buttons found on most
.Tn ADB
mice, the following key sequences trigger mouse button events:
.Pp
.Bl -dash -compact
.It
.Sm off
.Ao Option Ac \&+ Aq LeftArrow
.Sm on
will work as the middle mouse button.
.It
.Sm off
.Ao Option Ac \&+ Aq RightArrow
.Sm on
will work as the right mouse button.
.El
.Pp
On PowerBook (mac68k) models the following key sequences are also
significant:
.Pp
.Bl -dash -compact
.It
.Sm off
.Ao Option Ac \&+ Aq UpArrow
.Sm on
increase screen brightness.
.It
.Sm off
.Ao Option Ac \&+ Aq DownArrow
.Sm on
decrease screen brightness.
.El
.
.Ss Supported Hardware
.
.Nx
is known to support the following
.Tn ADB
keyboards:
.Pp
.Bl -bullet -offset indent -compact
.It
On-board keyboards on PowerBook models
.It
Apple Standard Keyboard
.It
Apple Keyboard II
.It
Apple Extended Keyboard
.It
Apple Extended Keyboard II
.It
Apple Adjustable Keyboard
.It
Most third-party
.Tn ADB
keyboards are supported
.El
.
.Sh SEE ALSO
.
.Xr xmodmap 1 ,
.Xr adb 4 ,
.Xr wscons 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8
.
.Sh BUGS
.
The number pad on extended keyboards does not send out the proper
key codes for many applications.
.Pp
The LEDs on extended keyboards are not functional under
.Nx .
.Pp
In X11 with the default key mapping, middle and right mouse button events will
hold
.Ql Meta_L
and this will clobber the intended mouse button.
.Aq Option
should be remapped with
.Xr xmodmap 1
to the
.Aq Command
key:
.Bd -literal -offset indent
remove Mod4 = Super_L
remove Mod1 = Alt_L
add Mod1 = Super_L
.Ed
