NetBSD/src/share/man/man4/akbd.4
.\"	$NetBSD: akbd.4,v 1.1 2003/09/26 19:15:15 mbw Exp $
.\"
.\" Copyright (c) 2003 Alex Zepeda <zipzippy@sonic.net>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Alex Zepeda.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 21, 2003
.Dt AKBD 4
.Os
.Sh NAME
.Nm akbd
.Nd Apple Desktop Bus keyboard driver for wscons
.Sh SYNOPSIS
.Cd "akbd* at obio?"
.Cd "wskbd* at akbd? console ?"
.Pp
.Cd "options ALTXBUTTONS"
.Cd "options CAPS_IS_CONTROL"
.Cd "options FORCE_FUNCTION_KEYS"
.Sh DESCRIPTION
This driver provides the
.Xr wscons 4
driver with support for Apple Desktop Bus keyboards.
.Pp
To work around the limited number of buttons found on most ADB mice,
one can map key sequences to trigger mouse button events.
To map Option+1, Option+2, Option+3 to mouse buttons 1, 2, and 3
respectively, add the following line to your kernel configuration
file:
.Pp
.Cd "options ALTXBUTTONS"
.Pp
On macppc systems it is possible to tweak the keyboard driver
to treat the caps lock key on an ADB keyboard as a control key.
This requires special remapping because of ADB's strange emulation of
a mechanically-locked key.  To enable this code add the following
line to your kernel configuration file:
.Pp
.Cd options CAPS_IS_CONTROL
.Pp
On macppc PowerBooks, several function keys double as "hot keys"
(brightness, volume, eject) when the Fn modifier is held down.
Mac OS X likes to reprogram the keyboard controller to send hot key
events when Fn is not held down and send function key events when it
is.
To transform the non-keyboard "button" events back into function key
events, place the following line in your kernel configuration file:
.Pp
.Cd options FORCE_FUNCTION_KEYS
.Sh SUPPORTED HARDWARE
.Nx
is known to support the following
.Tn ADB
keyboards:
.Bl -bullet -offset indent
.It
On-board keyboards on PowerBook models
.It
Apple Standard Keyboard
.It
Apple Keyboard II
.It
Apple Extended Keyboard
.It
Apple Extended Keyboard II
.It
Apple Adjustable Keyboard
.It
Most third-party ADB keyboards are supported
.El
.Sh SEE ALSO
.Xr adb 4 ,
.Xr wscons 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8
.Sh BUGS
The number pad on extended keyboards does not send out the proper
key codes for many applications.
.Pp
The LEDs on extended keyboards are not functional under
.Nx .
