NetBSD/src/share/man/man4/amdgpio.4
.\" $NetBSD: amdgpio.4,v 1.2 2025/02/26 17:23:49 uwe Exp $
.\"
.\" Copyright (c) 2022 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Emmanuel Dreyfus.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 3, 2025
.Dt AMDGPIO 4
.Os
.Sh NAME
.Nm amdgpio
.Nd AMD GPIO Controller
.Sh SYNOPSIS
.Cd "amdgpio* at acpi?"
.Cd "gpio* at gpiobus?"
.Sh DESCRIPTION
.Nm
provides a
.Xr gpio 4
interface for the following AMD chipsets:
.Pp
.Bl -item -offset indent -compact
.It
AMD Ryzen 7 5800U with Radeon Graphics
.It
AMD Ryzen 7 8840HS with Radeon 780M Graphics
.El
.Pp
The driver supports pin configuration flags
.Pp
.Bl -item -offset indent -compact
.It
.Dv GPIO_PIN_INPUT
.It
.Dv GPIO_PIN_OUTPUT
.It
.Dv GPIO_PIN_INOUT
.It
.Dv GPIO_PIN_ININ
.It
.Dv GPIO_PIN_PULLUP
.It
.Dv GPIO_PIN_PULLDOWN
.El
.Pp
and interrupt capabilies
.Pp
.Bl -item -offset indent -compact
.It
.Dv GPIO_INTR_POS_EDGE
.It
.Dv GPIO_INTR_NEG_EDGE
.It
.Dv GPIO_INTR_DOUBLE_EDGE
.It
.Dv GPIO_INTR_HIGH_LEVEL
.It
.Dv GPIO_INTR_LOW_LEVEL
.El
.Sh SEE ALSO
.Xr gpio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 11.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver is derived from
.Xr qcomgpio 4
and
.Ox Ap s
.Xr amdgpio 4 .
Man page was written by
.An Ryo ONODERA
.Aq Mt ryoon@NetBSD.org .
