NetBSD/src/share/man/man4/ams.4
.\"	$NetBSD: ams.4,v 1.1 2003/09/26 19:15:16 mbw Exp $
.\"
.\" Copyright (c) 2003 Alex Zepeda <zipzippy@sonic.net>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Alex Zepeda.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 21, 2003
.Dt AMS 4
.Os
.Sh NAME
.Nm ams
.Nd Apple Desktop Bus mouse driver for wscons
.Sh SYNOPSIS
.Cd "ams* at obio?"
.Cd "wsmouse* at ams?"
.Sh DESCRIPTION
This driver provides the
.Xr wscons 4
driver with support for Apple Desktop Bus mice.
.Sh SUPPORTED HARDWARE
.Nx
is known to support the following
.Tn ADB
mice:
.Bl -bullet -offset indent
.It
On-board trackpads and trackballs in PowerBook models
.It
Apple Desktop Bus Mouse
.It
Apple Desktop Bus Mouse II
.It
Interex ADB Mouse
.It
Logitech TrackMan
.It
Logitech MouseMan
.It
Microspeed Mouse Deluxe
.It
Mouse Systems A3 Mouse
.It
Most third-party ADB mice, trackballs, and trackpads are supported
.El
.Sh DIAGNOSTICS
.Bl -diag -compact
.It ams0 at adb0 addr 3: 1-button, 100 dpi mouse
This is a typical autoconfiguration message noting the presence of the
.Nm
mouse.
.El
.Sh SEE ALSO
.Xr adb 4 ,
.Xr wscons 4 ,
.Xr wsmouse 4 ,
.Xr wsconsctl 8
