NetBSD/src/share/man/man4/aps.4
.\"	$NetBSD: aps.4,v 1.6.6.1 2014/08/20 00:02:35 tls Exp $
.\"	$OpenBSD: aps.4,v 1.7 2007/05/31 19:19:49 jmc Exp $
.\"
.\" Copyright (c) 2005 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd July 13, 2011
.Dt APS 4
.Os
.Sh NAME
.Nm aps
.Nd ThinkPad Active Protection System accelerometer
.Sh SYNOPSIS
.Cd "aps0 at isa? port 0x1600"
.Sh DESCRIPTION
The
.Nm
driver provides support for several sensors found in some ThinkPad laptops.
.Pp
The sensors currently exposed via the
.Xr envsys 4
interface are:
.Bl -column "Sensor        " "Units    " "Typical" -offset indent
.It Sy "Sensor        " Ta Sy "Units    " Ta Sy "Typical Use"
.It Li "x-acceleration" Ta "integer" Ta "X-axis acceleration"
.It Li "y-acceleration" Ta "integer" Ta "Y-axis acceleration"
.It Li "x-variable" Ta "integer" Ta "Weighted X acceleration?"
.It Li "y-variable" Ta "integer" Ta "Weighted Y acceleration?"
.It Li "temperature 1" Ta "degC" Ta "Unknown temperature"
.It Li "temperature 2" Ta "degC" Ta "Unknown temperature"
.It Li "keyboard active" Ta "boolean" Ta "Keyboard activity"
.It Li "mouse active" Ta "boolean" Ta "Mouse activity"
.It Li "lid open" Ta "boolean" Ta "Lid state"
.El
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr hpacel 4 ,
.Xr thinkpad 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.8
and was then ported to
.Nx
5.0.
.Sh AUTHORS
The
.Nm
driver was written by
.An Jonathan Gray Aq Mt jsg@openbsd.org .
.Sh CAVEATS
Few issues can be mentioned.
.Bl -bullet
.It
The
.Nm
driver does not maintain state and subsequently does not take
evasive action when it thinks the hard drive is in danger.
Possible actions would include spinning down the hard drive
in case excessive tremor is detected by the sensors.
.It
The Y axis on X40 and possibly other models seems to be inverted.
It is unknown how to distinguish between different versions of the
accelerometer to compensate for this in the driver at this time.
.It
The sensor values are refreshed every 0.5 seconds.
Because no protection measures are taken,
this is unnecessary and may have a negative effect on battery life.
.It
As IBM provides no documentation, it is not known what all the available
sensors are used for.
.El
