NetBSD/src/share/man/man4/aq.4
.\"	$NetBSD: aq.4,v 1.5 2023/01/14 13:20:40 ryo Exp $
.\"
.\" Copyright (c) 2020 Ryo Shimizu <ryo@nerv.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 14, 2023
.Dt AQ 4
.Os
.Sh NAME
.Nm aq
.Nd Aquantia AQC multigigabit Network driver
.Sh SYNOPSIS
.Cd "aq* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports Aquantia AQC series controllers.
Supported controllers include:
.Pp
.Bl -bullet -compact
.It
AQC100 10 Gigabit Network Adapter
.It
AQC107 10 Gigabit Network Adapter
.It
AQC108 5 Gigabit Network Adapter
.It
AQC109 2.5 Gigabit Network Adapter
.It
AQC111 5 Gigabit Network Adapter
.It
AQC112 2.5 Gigabit Network Adapter
.It
AQC100S 10 Gigabit Network Adapter
.It
AQC107S 10 Gigabit Network Adapter
.It
AQC108S 5 Gigabit Network Adapter
.It
AQC109S 2.5 Gigabit Network Adapter
.It
AQC111S 5 Gigabit Network Adapter
.It
AQC112S 2.5 Gigabit Network Adapter
.It
AQC113DEV 10 Gigabit Network Adapter
.It
AQC113 10 Gigabit Network Adapter
.It
AQC113C 10 Gigabit Network Adapter
.It
AQC113CA 10 Gigabit Network Adapter
.It
AQC113CS 10 Gigabit Network Adapter
.It
AQC114CS 5 Gigabit Network Adapter
.It
AQC115C 2.5 Gigabit Network Adapter
.It
AQC116C Gigabit Network Adapter
.It
D100 10 Gigabit Network Adapter
.It
D107 10 Gigabit Network Adapter
.It
D108 5 Gigabit Network Adapter
.It
D109 2.5 Gigabit Network Adapter
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr vlan 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 9.1 ,
and is based on the
.Fx
driver of the same name, but has been drastically rewritten by Ryo Shimizu.
