NetBSD/src/share/man/man4/arcmsr.4
.\"	$NetBSD: arcmsr.4,v 1.7.8.2 2008/06/03 20:47:13 skrll Exp $
.\"	$OpenBSD: arc.4,v 1.10 2007/11/04 08:18:17 dlg Exp $
.\"
.\" Copyright (c) 2007 Juan Romero Pardines <xtraeme@netbsd.org>
.\" Copyright (c) 2006 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" TORTIOUS ACTION, ARISING OUT OF
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 3, 2008
.Dt ARCMSR 4
.Os
.Sh NAME
.Nm arcmsr
.Nd Areca Technology Corporation SATA/SAS RAID controller
.Sh SYNOPSIS
.Cd "arcmsr* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI-X and PCI Express RAID controllers from
Areca Technology Corporation:
.Pp
.Bl -dash -offset indent -compact
.It
ARC-1110 PCI-X 4 Port SATA RAID Controller
.It
ARC-1110ML PCI-X 4 Port SATA RAID Controller
.It
ARC-1120 PCI-X 8 Port SATA RAID Controller
.It
ARC-1120ML PCI-X 8 Port SATA RAID Controller
.It
ARC-1130 PCI-X 12 Port SATA RAID Controller
.It
ARC-1130ML PCI-X 12 Port SATA RAID Controller
.It
ARC-1160 PCI-X 16 Port SATA RAID Controller
.It
ARC-1160ML PCI-X 16 Port SATA RAID Controller
.It
ARC-1170 PCI-X 24 Port SATA RAID Controller
.\" Not yet
.\".It
.\"ARC-1200 Rev A PCI Express 2 Port SATA RAID Controller
.It
ARC-1202 PCI Express 2 Port SATA RAID Controller
.It
ARC-1210 PCI Express 4 Port SATA RAID Controller
.It
ARC-1220 PCI Express 8 Port SATA RAID Controller
.It
ARC-1230 PCI Express 12 Port SATA RAID Controller
.It
ARC-1230ML PCI Express 12 Port SATA RAID Controller
.It
ARC-1231ML PCI Express 12 Port SATA RAID Controller
.It
ARC-1260 PCI Express 16 Port SATA RAID Controller
.It
ARC-1260ML PCI Express 16 Port SATA RAID Controller
.It
ARC-1261ML PCI Express 16 Port SATA RAID Controller
.It
ARC-1280 PCI Express 24 Port SATA RAID Controller
.It
ARC-1280ML PCI Express 24 Port SATA RAID Controller
.It
ARC-1680 PCI Express 8 Port SAS RAID Controller
.It
ARC-1680LP PCI Express 8 Port SAS RAID Controller
.It
ARC-1680i PCI Express 8 Port SAS RAID Controller
.It
ARC-1680x PCI Express 8 Port SAS RAID Controller
.It
ARC-1681 PCI-X 8 Port SAS RAID Controller
.El
.Pp
These controllers can support RAID levels 0, 1, 1E, 3, 5, 6, and JBOD.
.Pp
.Nm
supports management of the controllers via the
.Xr bio 4
interface and the
.Xr bioctl 8
utility.
.Pp
.Sh SEE ALSO
.Xr bio 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr bioctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
It was ported to
.Nx 4.0
then.
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An David Gwynne Aq dlg@openbsd.org 
and was extended by
.An Juan Romero Pardines Aq xtraeme@netbsd.org .
