NetBSD/src/share/man/man4/asus.4
.\" $NetBSD: asus.4,v 1.3 2014/07/18 11:14:18 njoly Exp $
.\"
.\" Copyright (c) 2008 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 13, 2014
.Dt ASUS 4
.Os
.Sh NAME
.Nm asus
.Nd ASUS hotkeys
.Sh SYNOPSIS
.Cd "asus*  at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for hotkeys available in various ASUS laptops and
netbooks (Eee PC series included).
.Pp
The following hotkeys are directly handled by
.Nm :
.Bl -tag -width pcdisplay -offset indent
.It \&Fn + F3
Decrease LCD brightness
.It \&Fn + F4
Increase LCD brightness
.It \&Fn + F5
Switch between LCD and external video output
.It \&Fn + F7
Toggle audio
.It \&Fn + F8
Volume down
.It \&Fn + F9
Volume up
.El
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr powerd 8
.Sh HISTORY
The
.Nm
driver appeared in
.Nx 5.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
device driver was written by
.An Jared D. McNeill .
This man page was written by
.An Leonardo Taccari .
.Sh BUGS
At the moment
.Nm
does not handle
Fn + F6 (Task manager).
