NetBSD/src/share/man/man4/ate.4
.\"	$NetBSD: ate.4,v 1.8 2008/04/30 13:10:53 martin Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 5, 2002
.Dt ATE 4
.Os
.Sh NAME
.Nm ate
.Nd
.Tn Fujitsu
MB86965A based
.Tn Allied-Telesis
Ethernet cards driver
.Sh SYNOPSIS
.Cd "ate0 at isa? port 0x2a0 irq ?"
.Cd "ate* at mca? slot ?"
.Sh DESCRIPTION
The
.Nm
driver supports
.Tn Allied-Telesis
.Tn ISA
and
.Tn MCA
bus
.Tn Ethernet
adapters based on the
.Tn Fujitsu
MB86965A
.Tn Ethernet
controller.
Supported boards include:
.Pp
.Bl -tag -width xxxx -offset indent
.It Tn Allied-Telesis AT1700T/AT1700BT/AT1700FT/AT1700AT
.It Tn Allied-Telesis AT1720T/AT1720BT/AT1720FT/AT1720AT
.It Tn Allied-Telesis RE2001/RE2003/RE2005/RE2009
.El
.Sh SEE ALSO
.Xr fmv 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr isa 4 ,
.Xr mbe 4 ,
.Xr mca 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.4 .
