NetBSD/src/share/man/man4/attimer.4
.\" $NetBSD: attimer.4,v 1.4 2009/03/09 19:24:28 joerg Exp $
.\"
.\"  Copyright (c) 2005 The NetBSD Foundation.
.\"  All rights reserved.
.\"
.\"  Redistribution and use in source and binary forms, with or without
.\"  modification, are permitted provided that the following conditions
.\"  are met:
.\"  1. Redistributions of source code must retain the above copyright
.\"     notice, this list of conditions and the following disclaimer.
.\"  2. Redistributions in binary form must reproduce the above copyright
.\"     notice, this list of conditions and the following disclaimer in the
.\"     documentation and/or other materials provided with the distribution.
.\"
.\"  THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\"  ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\"  TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\"  PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\"  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\"  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\"  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\"  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\"  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\"  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\"  POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 22, 2005
.Dt ATTIMER 4
.Os
.Sh NAME
.Nm attimer
.Nd AT Timer (8253) driver
.Sh SYNOPSIS
.Cd "attimer*	at acpi?"
.Cd "attimer0	at isa?"
.Sh DESCRIPTION
The
.Nm
driver handles the so-called AT Timer device, initially found as chip
model 8253.
It is used as the main counter for the clock on the i386 port,
but also offers control over the pitch of the PC speaker.
.Pp
The
.Nm
driver currently only implements the access to the ISA register
.Dq TIMER1
which controls the pitch of the PC speaker,
and should be configured along with
.Xr pcppi 4
to be of any actual use.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr isa 4 ,
.Xr pcppi 4
