NetBSD/src/share/man/man4/aubtfwl.4
.\" $NetBSD: aubtfwl.4,v 1.5 2024/09/07 20:33:53 rillig Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 9, 2013
.Dt AUBTFWL 4
.Os
.Sh NAME
.Nm aubtfwl
.Nd Atheros AR3011/AR3012 Firmware Loader
.Sh SYNOPSIS
.Cd "aubtfwl* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver manages automatic loading of firmware on the Atheros AR3011
and AR3012 Bluetooth chipsets.
The firmware files should be obtained and placed in a
.Pa ubt/
directory in the search path of the
.Xr firmload 9
kernel subsystem.
Upon attachment, the
.Nm
driver will load the necessary firmware files and the device will detach
and reattach as a generic Bluetooth device using the
.Xr ubt 4
driver.
.Pp
For AR3011 chipsets, you will need the
.Pa ath3k-1.fw
firmware file in
.Pa ubt/ ,
and for AR3012 chipsets, the files
.Pa ar3k/AthrBT_*.dfu
and
.Pa ar3k/ramps_*.dfu
in
.Pa ubt/ar3k/ .
.Pp
The firmware files can be obtained from the Linux firmware
git repository at
.Lk https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git .
.Sh FILES
.Bl -bullet
.It
.Pa ath3k-1.fw
.It
.Pa ar3k/AthrBT_*.dfu
.It
.Pa ar3k/ramps_*.dfu
.El
.Sh SEE ALSO
.Xr bluetooth 4 ,
.Xr ubt 4 ,
.Xr uhub 4 ,
.Xr firmload 9
