NetBSD/src/share/man/man4/aubtfwl.4
.\" $NetBSD: aubtfwl.4,v 1.1 2012/02/14 17:34:21 plunky Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 14, 2012
.Dt AUBTFWL 4
.Os
.Sh NAME
.Nm aubtfwl
.Nd Atheros AR3011 Firmware Loader
.Sh SYNOPSIS
.Cd "aubtfwl* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver manages automatic loading of firmware on the Atheros AR3011
Bluetooth chipset.
The firmware file
.Pa ath3k-1.fw
should be obtained and placed in a
.Pa ubt/
directory in the search path of the
.Xr firmload 9
kernel subsystem.
Upon attachment, the
.Nm
driver will load this firmware file and the device will detach
and reattach as a generic Bluetooth device using the
.Xr ubt 4
driver.
.Pp
The firmware file can be obtained from the Linux firmware
git repository at
.Pa http://git.kernel.org/?p=linux/kernel/git/firmware/linux-firmware.git .
.Sh FILES
.Pa ath3k-1.fw
.Sh SEE ALSO
.Xr bluetooth 4 ,
.Xr ubt 4 ,
.Xr uhub 4 ,
.Xr firmload 9
