NetBSD/src/share/man/man4/auvitek.4
.\"	$NetBSD: auvitek.4,v 1.1 2010/12/27 17:26:58 jmcneill Exp $
.\"
.\" Copyright (c) 2010 Jared D. McNeill <jmcneill@invisible.ca>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 27, 2010
.Dt AUVITEK 4
.Os
.Sh NAME
.Nm auvitek 
.Nd Auvitek AU0828 video capture device driver
.Sh SYNOPSIS
.Cd "auvitek* at uhub?"
.Cd "video* at videobus?"
.Cd "uaudio* at auvitek?"
.Cd "audio* at uaudio?"
.Sh DESCRIPTION
The
.Nm
driver provides support for
.Tn USB
video capture devices based on the Auvitek AU0828 bridge.
This hybrid analog/digital device requires a hi-speed USB host controller
(such as
.Xr ehci 4 )
to function properly.
.Pp
For
.Nm
devices with analog audio capture interfaces, the
.Xr uaudio 4
device driver provides access to the audio stream.
Application software can find a
.Xr video 4
device's
.Xr audio 4
device by comparing the
.Dv VIDIOC_QUERYCAP
.Va bus_info
field with the audio device's
.Dv AUDIO_GETDEV
.Va config
field.
.Pp
The following cards are supported by the
.Nm
driver:
.Pp
.Bl -column
.It Em "Vendor        Chip           Decoder    Tuner"
.It    "Hauppauge     WinTV-HVR-950Q AU8522     XC5000"
.El
.Pp
Cards with an XC5000 tuner require the firmware provided by the
.Pa pkgsrc/sysutils/xc5k-firmware
package to function properly.
.Sh SEE ALSO
.Xr audio 4 ,
.Xr ehci 4 ,
.Xr uaudio 4 ,
.Xr video 4 ,
.Pa pkgsrc/sysutils/xc5k-firmware
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 6.0 .
.Sh BUGS
Digital capture is not supported.
