NetBSD/src/share/man/man4/awi.4
.\"     $NetBSD: awi.4,v 1.21 2004/01/15 13:46:58 onoe Exp $
.\"
.\" Copyright (c) 1999,2000,2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Bill Sommerfeld
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.Dd September 18, 2001
.Dt AWI 4
.Os
.Sh NAME
.Nm awi
.Nd
AMD PCnetMobile IEEE 802.11 PCMCIA wireless network driver
.Sh SYNOPSIS
.Cd "awi*     at pcmcia? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports various IEEE 802.11 wireless cards
which run AMD PCnetMobile firmware based on AMD 79c930 controller
with Intersil (formerly Harris) PRISM radio chipset.
It provides access to 32kb of memory shared between the controller
and the host.
All host/device interaction is via this shared memory, which can be
accessed either via PCMCIA memory space or I/O space.
The
.Nm
driver encapsulates all IP and ARP traffic as 802.11 frames.
.Pp
The driver works both in infrastructure mode and in ad-hoc (independent
BSS) mode.
.Pp
In infrastructure mode, it communicates with an Access Point
which serves as a link-layer bridge between an Ethernet and
the wireless network.  An access point also provides roaming capability
which allows wireless node to move between access points.
.Pp
In ad-hoc mode, it communicates peer to peer.
Though it is more efficient to communicate between wireless nodes,
the coverage is limited spatially due to lack of roaming capability.
.Pp
In addition to these two mode in IEEE 802.11 specification, the
.Nm
driver also supports a variant of ad-hoc mode out of spec for DS radio cards,
which makes possible to communicate with WaveLAN ad-hoc mode of
.Xr wi 4
driver.  The NWID doesn't affect in this mode.
.Pp
Another mode added to the
.Nm
driver can be used with old Melco access point with 2Mbps card,
which actually use IEEE 802.11 ad-hoc mode with encapsulation of
raw Ethernet packet including header in 802.11 frames.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8
and
.Xr ifmedia 4 .
.Sh HARDWARE
Cards supported by the
.Nm
driver include:
.Pp
.Bl -tag -width BayStack_650x -offset indent -compact
.It BayStack 650
1Mbps Frequency Hopping PCCARD adapter
.It BayStack 660
2Mbps Direct Sequence PCCARD adapter
.It Icom SL-200
2Mbps Direct Sequence PCCARD adapter
.It Melco WLI-PCM
2Mbps Direct Sequence PCCARD adapter
.It NEL SSMagic
2Mbps Direct Sequence PCCARD adapter
.It Netwave AirSurfer Plus
1Mbps Frequency Hopping PCCARD adapter
.It Netwave AirSurfer Pro
2Mbps Direct Sequence PCCARD adapter
.It Nokia C020 WLAN
2Mbps Direct Sequence PCCARD adapter
.It Farallon SkyLINE
2Mbps Direct Sequence PCCARD adapter
.El
.Pp
The original Xircom Netwave AirSurfer is supported by the
.Xr cnw 4
driver, and the PRISM-II cards are supported by the
.Xr wi 4
driver.
.Sh MEDIA SELECTION
In addition to default
.Em Auto
media type,
the DS cards support
.Em DS1
and
.Em DS2
media types, while the FH cards support
.Em FH1
media type.  For each media type,
.Em adhoc
mediaopt can be used to indicate the driver to operate in ad-hoc mode.
The
.Em flag0
mediaopt
should be used only with old access point which operates in IBSS mode.
For DS radio cards,
.Em adhoc,flag0
mediaopt can be used for
.Xr wi 4
compatible WaveLAN ad-hoc mode.
.Sh DIAGNOSTICS
.Bl -diag
.It "awi0: no suitable CIS info found"
The device cannot be mapped due to conflict of the resource.
Or, the device failed to initialize its firmware.
.It "awi0: failed to complete selftest (%s)"
The device failed to complete its self test.
In some circumstances, resetting device after power on fails.
Re-inserting the card or down-then-up interface may be helpful.
.It "awi0: transmit timeout"
The device failed to generate an interrupt to acknowledge a
transmitted packet.
.It "awi0: failed to lock interrupt"
The system was unable to obtain the lock to access shared memory.
.It "awi0: command %d failed %x"
The device failed to complete the request from the system.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr cnw 4 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr pcmcia 4 ,
.Xr wi 4 ,
.Xr ifconfig 8 ,
.Xr wiconfig 8
.Rs
.%T Am79C930 PCnet Mobile Single-Chip Wireless LAN Media Access Controller
.%O http://www.amd.com
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Nx 1.5 .
.Sh AUTHORS
The initial version of the
.Nm
driver was written by
.An Bill Sommerfeld
.Aq sommerfeld@NetBSD.org .
Then the
.Nm
driver module completely rewritten to support cards with DS phy and
to support ad-hoc mode by
.An Atsushi Onoe
.Aq onoe@NetBSD.org .
