NetBSD/src/share/man/man4/axe.4
.\" $NetBSD: axe.4,v 1.17 2019/08/30 09:22:17 wiz Exp $
.\"
.\" Copyright (c) 2003-2004 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Copyright (c) 1997, 1998, 1999, 2000-2003
.\"     Bill Paul <wpaul@windriver.com>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"     This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: /repoman/r/ncvs/src/share/man/man4/axe.4,v 1.3 2003/05/29 21:28:35 ru Exp $
.\" $OpenBSD: axe.4,v 1.37 2009/11/08 20:25:29 jasper Exp $
.\"
.Dd August 24, 2019
.Dt AXE 4
.Os
.Sh NAME
.Nm axe
.Nd ASIX Electronics AX88172/AX88178/AX88772 10/100/Gigabit USB Ethernet device
.Sh SYNOPSIS
.Cd "axe*   at uhub?"
.Cd "ukphy* at mii?"
.Sh HARDWARE
The
.Nm
driver supports the following adapters:
.Pp
.Bl -tag -width Dv -offset indent -compact
.It Apple USB Ethernet Adapter A1277
.It ATEN UC-210T
.It BAFO BF-320
.It Billionton Systems USB2AR
.It Buffalo(MELCO) LUA-U2-GT
.It Buffalo(MELCO) LUA-U2-KTX
.It Buffalo(MELCO) LUA3-U2-ATX
.It Corega FEther USB2-TX
.It D-Link DUB-E100
.It Good Way GWUSB2E
.It Hawking UF200
.It Intellinet USB 2.0 to Ethernet (rev A)
.It IO-Data ETG-US2
.It JVC MP-PRX1
.It Konig CMP-NWUSB20
.It Level One USB-0200
.It Linksys USB200M
.It Linksys USB1000
.It Logitec LAN-GTJ/U2
.It Logitec LAN-TXU2C
.It Logitec LAN-TXU2H3A
.It Netgear FA120
.It Nintendo Wii USB Lan Ethernet Adapter RVL-015
.It OQO model 01+ Ethernet
.It Planex UE-200TX-G
.It Sitecom LN-029
.It SMC 2209USB/ETH
.It SnapPort USB 2.0 LAN Adapter
.It ST Lab USB 2.0 Fast Ethernet
.It Surecom EP-1427X-2
.It System TALKS SGC-X2UL
.It TRENDnet TU2-ET100
.It Z-TEK ZK-R01-2
.El
.Sh DESCRIPTION
The
.Nm
driver provides support for USB
.Tn Ethernet
adapters based on the ASIX Electronics AX88172, AX88178, AX88772, AX88772A,
AX88772B USB 2.0 chipsets.
.Pp
The chip contains a 10/100
.Tn Ethernet
MAC with MII interface and is designed to work with both
.Tn Ethernet
and HomePNA transceivers.
The AX88172 and AX88772 contain 10/100 Ethernet MACs with MII interfaces.
The AX88178 contains a 10/100/1000 Gigabit
.Tn Ethernet
MAC with a GMII/MII interface.
The chip also supports USB 2.0, thereby accommodating 100 Mb/s data rates.
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It autoselect
Enable automatic selection of the media type and options.
.It 10baseT/UTP
Set 10Mbps operation.
The
.Ar mediaopt
option can also be used to enable
.Ar full-duplex
operation.
Not specifying
.Ar full duplex
implies
.Ar half-duplex
mode.
.It 100baseTX
Set 100Mbps (fast
.Tn Ethernet )
operation.
The
.Ar mediaopt
option can also be used to enable
.Ar full-duplex
operation.
Not specifying
.Ar full duplex
implies
.Ar half-duplex
mode.
.It 1000baseT
Set 1000Mbps (Gigabit
.Tn Ethernet )
operation (AX88178 only).
.El
.Pp
The
.Nm
driver supports the following media options:
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It full-duplex
Force full duplex operation.
The interface will operate in half duplex mode
if this media option is not specified.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
See
.Xr usbnet 4
for diagnostics.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr usb 4 ,
.Xr usbnet 4 ,
.Xr ifconfig 8
.Rs
.%T ASIX AX88172 data sheet
.%U http://www.asix.com.tw
.Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx
and was ported to
.Nx 3.0 .
It replaces the
.Nx
uax driver.
