NetBSD/src/share/man/man4/axen.4
.\"	$NetBSD: axen.4,v 1.2.8.2 2014/08/20 00:02:35 tls Exp $
.\"	$OpenBSD: axen.4,v 1.2 2013/10/07 07:18:36 jmc Exp $
.\"
.\" Copyright (c) 2013 Yojiro UO <yuo@nui.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd October 26, 2013
.Dt AXEN 4
.Os
.Sh NAME
.Nm axen
.Nd ASIX Electronics AX88178a/AX88179 10/100/Gigabit USB Ethernet device
.Sh SYNOPSIS
.Cd "axen*   at uhub? port ?"
.Cd "rgephy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB Ethernet adapters based on the ASIX
Electronics AX88178a and AX88779 USB 2.0 chipsets
(potentially the AX88779 supports USB 3.0, but there is currently no xhci support in
.Nx ) ,
including the following:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Kurotoshiko GbE-USB3.0
.It Logitec LAN-GTJU3
.It Shanghai Donya DN-84327
.El
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width "autoselect"
.It autoselect
Enable autoselection of the media type and options (this is the default).
The user can manually override the autoselected mode by adding media
options to the appropriate
.Xr ifconfig.if 5
file.
.It 10baseT
Set 10Mbps operation.
.It 100baseTX
Set 100Mbps (Fast Ethernet) operation.
.It 1000baseT
Set 1000Mbps (Gigabit Ethernet) operation.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
.Bl -diag
.It "axen%d: watchdog timeout"
A packet was queued for transmission and a transmit command was
issued, however the device failed to acknowledge the transmission
before a timeout expired.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr rgephy 4 ,
.Xr usb 4 ,
.Xr ifconfig.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.4
and in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Yojiro UO Aq Mt yuo@nui.org
for
.Ox
and ported to
.Nx
by
.An NONAKA Kimihiro Aq Mt nonaka@NetBSD.org .
