NetBSD/src/share/man/man4/axen.4
.\"	$NetBSD: axen.4,v 1.13 2026/05/21 08:29:51 uwe Exp $
.\"	$OpenBSD: axen.4,v 1.2 2013/10/07 07:18:36 jmc Exp $
.\"
.\" Copyright (c) 2013 Yojiro UO <yuo@nui.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd May 20, 2026
.Dt AXEN 4
.Os
.Sh NAME
.Nm axen
.Nd ASIX Electronics AX88178A, AX88179, AX88179A 10\^/\^100\^/\^Gigabit USB Ethernet device
.Sh SYNOPSIS
.Cd "axen*   at uhub? port ?"
.Cd "rgephy* at mii?"
.Cd "ukphy*  at mii?"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB Ethernet adapters based on the ASIX
Electronics AX88178A USB 2.0, and AX88179\|/\^AX88179A USB 3.0 chipsets
including the following:
.Pp
.Bl -item -offset indent -compact
.It
Buffalo LUA4-U3-AGT
.It
D-Link DUB-1312
.It
Kuroutoshikou GbE-USB3.0
.It
Kuroutoshikou GbE-USB3.0S2
.It
Logitec LAN-GTJU3
.It
Logitec LAN-GTJU3H3
.It
Shanghai Donya DN-84327
.It
TP-Link UE300
.It
TP-Link UE306
.El
.Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width Cm -offset indent
.It Cm autoselect
Enable autoselection of the media type and options.
This is the default.
The user can manually override the autoselected mode by adding media
options to the appropriate
.Xr ifconfig.if 5
file.
.It Cm 10baseT
Set 10Mbps operation.
.It Cm 100baseTX
Set 100Mbps (Fast Ethernet) operation.
.It Cm 1000baseT
Set 1000Mbps (Gigabit Ethernet) operation.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Pp
It provides IPv4, TCPv4, UDPv4, TCPv6, UDPv6 checksumming, and TSOv4
segmentation offloading on capable hardware.
It also supports VLAN-sized frames.
It does not presently support other advertised features of the AX88179A,
such as jumbo frames and Energy-Efficient Ethernet.
.Sh DIAGNOSTICS
See
.Xr usbnet 4
for diagnostics.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr rgephy 4 ,
.Xr ukphy 4 ,
.Xr usb 4 ,
.Xr usbnet 4 ,
.Xr ifconfig.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 5.4
and in
.Nx 7.0 .
AX88179A support first appeared in
.Nx 10.2 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Yojiro UO Aq Mt yuo@nui.org
for
.Ox
and ported to
.Nx
by
.An NONAKA Kimihiro Aq Mt nonaka@NetBSD.org .
