NetBSD/src/share/man/man4/bba.4
.\" $NetBSD: bba.4,v 1.7 2008/04/30 13:10:53 martin Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 22, 2005
.Dt BBA 4
.Os
.Sh NAME
.Nm bba
.Nd IOASIC Baseboard Audio device driver
.Sh SYNOPSIS
.Cd "bba0   at ioasic? offset ?"
.Cd "audio* at audiobus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the IOASIC baseboard audio found on
DEC 3000/300, 3000/500
.Ns ( Nx Ns /alpha )
and DEC Personal DECstation
.Ns ( Nx Ns /pmax )
systems.  The baseboard
audio driver is based on the AMD 79c30 ISDN and audio interface.  The
interface is only capable of playing and recording 8kHz mu-law audio.
.Sh SEE ALSO
.Xr audio 4 ,
.Xr ioasic 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 1.5 .
The name for the driver was adopted from the same driver in ULTRIX.
