NetBSD/src/share/man/man4/bktr.4
.\" $NetBSD: bktr.4,v 1.1 2000/05/07 20:46:10 wiz Exp $
.\"
.\" Copyright (c) 2000 Thomas Klausner
.\" 	All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software withough specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 07, 2000
.Dt BKTR 4
.Os
.Sh NAME
.Nm bktr
.Nd Brooktree 848 compatible TV card driver
.Sh SYNOPSIS
.Cd bktr* at pci? dev ? function ?
.Pp
.Cd options BKTR_OVERRIDE_CARD=n
.Cd options BKTR_OVERRIDE_TUNER=n
.Cd options BKTR_OVERRIDE_DBX=n
.Cd options BKTR_OVERRIDE_MSP=n
.Cd options BKTR_SYSTEM_DEFAULT=n
.Cd options BKTR_USE_PLL
.Cd options BKTR_GPIO_ACCESS
.Cd options BKTR_NO_MSP_RESET
.\" The following options have no effect:
.\" .Cd options BKTR_430_FX_MODE
.\" .Cd options BKTR_SIS_VIA_MODE
.Pp
.Sh DESCRIPTION
This driver supports video capture (frame grabber) and TV tuner cards
based on the 
.Tn Brooktree
.Tn Bt848,
.Tn Bt848A,
.Tn Bt849A,
.Tn Bt878
and
.Tn Bt879
chips.
.Pp
The following kernel configuration options are available:
.Bl -ohang
.It Cd options BKTR_OVERRIDE_CARD=n
If the card is not recognized correctly by the auto-detection routine,
it can be overridden by setting this option to the appropriate
value. The following values are allowed:
.Em 1
for Pinnacle (Miro) TV,
.Em 2
for Hauppauge WinCast/TV,
.Em 3
for STB TV/PCI,
.Em 4
for Intel Smart Video III and Videologic Captivator PCI,
.Em 5
for IMS TV Turbo,
.Em 6
for AVer Media TV/FM,
.Em 7
for MMAC Osprey,
.Em 8
for NEC PK-UG-X017,
.Em 9
for I/O DATA GV-BCTV2/PCI,
.Em 10
for FlyVideo,
.Em 11
for Zoltrix,
.Em 12
for KISS TV/FM PCI,
.Em 13
for Video Highway Xtreme,
.Em 14
for Askey/Dynalink Magic TView,
.Em 15
for Leadtek Winfast TV 2000,
and
.Em 16
for TerraTVplus.
.It Cd options BKTR_OVERRIDE_TUNER=n
If the TV tuner is not recognized correctly by the auto-detection
routine, it can be overridden by setting this option to the
appropriate value. Known values are:
.Em 1
for Temic NTSC,
.Em 2
for Temic PAL,
.Em 3
for Temic SECAM,
.Em 4
for Philips NTSC,
.Em 5
for Philips PAL,
.Em 6
for Philips SECAM,
.Em 7
for Temic PAL I,
.Em 8
for Philips PAL I,
.Em 9
for Philips FR1236 NTSC FM,
.Em 10
for Philips FR1216 PAL FM,
.Em 11
for Philips FR1236 SECAM FM,
.Em 12
for ALPS TSCH5 NTSC FM,
and
.Em 13
for ALPS TSBH1 NTSC.
.It Cd options BKTR_OVERRIDE_DBX=n
To override detection of the BTSC (dbx) chip, set this to
.Em 1
if you have one, or
.Em 0
if not.
.It Cd options BKTR_OVERRIDE_MSP=n
To override detection of the MSP 34xx chip, set this to
.Em 1
if you have one, or
.Em 0
if not.
.It Cd options BKTR_SYSTEM_DEFAULT=n
If this option is set to
.Em BROOKTREE_PAL
default to PAL, else to NTSC.
.It Cd options BKTR_USE_PLL
Default to PLL instead of XTAL.
.It Cd options BKTR_GPIO_ACCESS
Use ioctl's for direct GPIO access.
.It Cd options BKTR_NO_MSP_RESET
Skip the MSP reset. This option is handy if you initialise the
MSP audio in another operating system first and then do a soft
reboot.
.\" The following options have no effect:
.\" .It Cd options BKTR_430_FX_MODE
.\" .It Cd options BKTR_SIS_VIA_MODE
.El
.Sh HARDWARE
Supported cards include most cards by
.Tn AVerMedia,
.Tn Hauppauge,
.Tn Leadtek,
.Tn Miro,
.Tn Pinnacle,
.Tn Pixelview,
.Tn Terratec,
and some other companies, especially all cards based on the
.Tn Brooktree
.Tn Bt848,
.Tn Bt848A,
.Tn Bt849A,
.Tn Bt878,
or
.Tn Bt879
chips.
A notable exception are the
.Tn ATI
.Tn All-in-Wonder
cards.
.Sh FILES
.Bl -tag -width /dev/tuner* -compact
.It Pa /dev/bktr*
.Nm
driver interface device
.It Pa /dev/tuner*
.Nm
tuner interface device
.It Pa /dev/vbi*
teletext interface device
.El
.Sh "SEE ALSO"
.Xr options 4 ,
.Xr pci 4
.Sh AUTHORS
The
.Nm
driver was originally written by Amancio Hasty for
.Fx
and is now maintained by Roger Hardiman.
.Nx 
porting was done by Bernd Ernesti, Berndt Josef Wulf, Matthias
Scheler, and Thomas Klausner.
.Sh HISTORY
The
.Nm
driver appeared in
.Fx 2.2
and 
.Nx 1.5 .
