NetBSD/src/share/man/man4/bochsfb.4
.\"	$NetBSD: bochsfb.4,v 1.2 2026/02/06 02:08:15 uwe Exp $
.\"
.\" Copyright (c) 2025
.\"	 The NetBSD Foundation, Inc.  All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jiaxun Yang.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 2, 2025
.Dt BOCHSFB 4
.Os
.Sh NAME
.Nm bochsfb
.Nd Bochs Display Interface framebuffer
.Sh SYNOPSIS
.Cd "bochsfb* at pci?"
.Cd "wsdisplay* at bochsfb?"
.Ss Options
.Cd options BOCHSFB_DEFAULT_WIDTH= Ns Ar integer
.Cd options BOCHSFB_DEFAULT_HEIGHT= Ns Ar integer
.Sh DESCRIPTION
The
.Nm
driver provides support for graphics devices implementing the Bochs VBE
DISPI interface, including the Bochs reference VGA implementation, and the
QEMU StdVGA device.
It programs the linear framebuffer through the DISPI registers and makes it
available through
.Xr wsdisplay 4
as a console or
.Xr wsfb 4
compatible framebuffer.
.Pp
When a memory-mapped DISPI bar with an EDID block is present,
.Nm
uses the preferred mode reported by the display.
Devices without EDID support
.Pq such as virtio-vga
fall back to a 1024x768
32-bit mode.
If no MMIO bar is available, the driver accesses the DISPI registers via the
legacy VGA I/O ports.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr vga 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 12.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jiaxun Yang Aq Mt jiaxun.yang@flygoat.com .
