NetBSD/src/share/man/man4/bq4802rtc.4
.\"	$NetBSD: bq4802rtc.4,v 1.1 2026/07/07 12:36:01 jdc Exp $
.\"
.\" Copyright (c) 2026 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Julian Coleman.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 8, 2026
.Dt BQ4802RTC 4
.Os
.Sh NAME
.Nm bq4802rtc
.Nd Texas Instruments bq4802Y/bq4802LY Real-Time Clock
.Sh SYNOPSIS
.Cd "bq4802rtc* at ebus?  # sparc64"
.Sh DESCRIPTION
The
.Nm
driver provides access to the Texas Instruments bq4802Y/bq4802LY
real-time clock.
Access methods to retrieve and set date and time
are provided through the
.Em TODR
interface defined in
.Xr todr 9 .
.Pp
The chip supports stopping the oscillator to conserve battery life
if the computer will be stored for an extended period.
The
.Nm
driver
makes the oscillator control available via
.Xr sysctl 8 .
For example:
.Bd -literal -offset indent
hw.bq4802rtc0.stop_oscillator = 0
.Ed
.Pp
A value of
.Dq 0
means that the oscillator is running when the computer is powered off,
and a value of
.Dq 1
means that the oscillator is stopped.
If the oscillator is stopped, then the driver will output a warning message
at attach time, but does not automatically restart the oscillator.
.Sh SEE ALSO
.Xr sysctl 8,
.Xr todr 9
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 11.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Julian Coleman Aq Mt jcoleman@NetBSD.org .
