NetBSD/src/share/man/man4/btbc.4
.\" $NetBSD: btbc.4,v 1.5 2010/01/12 09:26:26 wiz Exp $
.\"
.\" Copyright (c) 2007 KIYOHARA Takashi
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 19, 2007
.Dt BTBC 4
.Os
.Sh NAME
.Nm btbc
.Nd AnyCom BlueCard driver
.Sh SYNOPSIS
.Cd "btbc* at pcmcia? function ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the AnyCom BlueCard (LSE041, LSE039, LSE139)
to the Bluetooth protocol stack.
.Sh SEE ALSO
.Xr bluetooth 4 ,
.Xr pcmcia 4
.Sh HISTORY
This
.Nm
device driver was written by
.An "KIYOHARA Takashi"
using
Linux bluecard_cs driver as a reference.
It first appeared in
.Nx 4.0 .
.Sh BUGS
