NetBSD/src/share/man/man4/bthidev.4
.\" $NetBSD: bthidev.4,v 1.1 2006/06/19 15:44:36 gdamore Exp $
.\"
.\" Copyright (c) 2006 Itronix Inc.
.\" All rights reserved.
.\"
.\" Written by Iain Hibbert for Itronix Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of Itronix Inc. may not be used to endorse
.\"    or promote products derived from this software without specific
.\"    prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY ITRONIX INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL ITRONIX INC. BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
.\" ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 17, 2006
.Dt BTHIDEV 4
.Os
.Sh NAME
.Nm bthidev
.Nd Bluetooth Human Interface Device support
.Sh SYNOPSIS
.Cd "bthidev* at bthub?"
.Pp
.Cd "btkbd*   at bthidev? reportid ?"
.Cd "btms*    at bthidev? reportid ?"
.Sh DESCRIPTION
The
.Nm
driver handles all Bluetooth Human Interface Devices.  Each HID
device can have several components, e.g., a keyboard and a mouse.
These components use different report identifiers to
distinguish which component data is coming from.  The
.Nm
driver has other drivers attached that handle particular
kinds of devices and
.Nm
only dispatches data to them based on the report id.
.Pp
Normally, Bluetooth HIDs will be attached using the
.Xr btcontrol 8
program.
.Sh SEE ALSO
.Xr bluetooth 4 ,
.Xr btcontrol 8 ,
.Xr bthub 4 ,
.Xr btkbd 4 ,
.Xr btms 4
.Sh HISTORY
The
.Nm
driver was written by
.An Iain Hibbert
under the sponsorship of Itronix, Inc. and first appeared in
.Nx 4.0 .
