NetBSD/src/share/man/man4/btuart.4
.\" $NetBSD: btuart.4,v 1.3 2007/03/02 20:13:33 wiz Exp $
.\"
.\" Copyright (c) 2007 KIYOHARA Takashi
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 19, 2007
.Dt BTUART 4
.Os
.Sh NAME
.Nm btuart
.Nd Bluetooth HCI UART (H4) driver
.Sh SYNOPSIS
.Cd pseudo-device btuart
.Sh DESCRIPTION
The
.Nm
driver provides a
.Xr tty 4
line discipline to send and receive Bluetooth packets over a serial line,
as described in the
.Qo
Bluetooth Host Controller Interface
.Bq Transport Layer
specification, Vol 4 part A.
.Qc
.Pp
The
.Nm
sets the baud rate for that by a vendor specific or other command.
.Pp
Different modules require different handling.
The connected modules type can be set with
.Xr ioctl 2
calls:
.Bl -tag -width xxxxxx
.It Dv BTUART_HCITYPE Fa (int)
Set the module type.
The
.Nm
supports:
.Bl -tag -width XXXXXX -offset indent
.It Dv BTUART_HCITYPE_ERICSSON
Ericsson based modules
.It Dv BTUART_HCITYPE_DIGI
Digianswer based cards
.It Dv BTUART_HCITYPE_TEXAS
Texas Instruments
.It Dv BTUART_HCITYPE_CSR
Cambridge Silicon Radio Casira serial adapter or BrainBoxes serial dongle
(BL642)
.It Dv BTUART_HCITYPE_SWAVE
Silicon Wave kits
.It Dv BTUART_HCITYPE_ST
ST Microelectronics minikits based on STLC2410/STLC2415
.It Dv BTUART_HCITYPE_STLC2500
ST Microelectronics minikits based on STLC2500
.It Dv BTUART_HCITYPE_BT2000C
AmbiCom BT2000C Bluetooth PC/CF Card
.It Dv BTUART_HCITYPE_BCM2035
Broadcom BCM2035
.It Dv BTUART_HCITYPE_ANY
Unspecified HCI UART interface
.El
.It Dv BTUART_INITSPEED Fa (int)
Set initial speed of module, send initial command to module.
.It Dv BTUART_START Fa (void)
Start
.Nm
driver.
.El
.Sh SEE ALSO
.Xr bluetooth 4 ,
.Xr btuartd 8
.Sh HISTORY
The
.Nm
device appeared in
.Nx 4.0 .
.Sh AUTHORS
.An KIYOHARA Takashi Aq kiyohara@kk.iij4u.or.jp
