NetBSD/src/share/man/man4/bwfm.4
.\" $NetBSD: bwfm.4,v 1.2 2017/10/30 15:50:48 wiz Exp $
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 26, 2017
.Dt BWFM 4
.Os
.Sh NAME
.Nm bwfm
.Nd Broadcom and Cypress wireless network driver
.Sh SYNOPSIS
.Cd "bwfm* at uhub? port ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Broadcom and Cypress FullMAC network adapters.
.Sh SEE ALSO
.Xr bwi 4 ,
.\".Xr ifconfig 4 ,
.Xr ifmedia 4 ,
.Xr usb 4 ,
.Xr ifconfig.if 5 ,
.Xr wpa_supplicant 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Patrick Wildt
.Aq Mt patrick@blueri.se .
.Sh BUGS
The firmware is outdated and contains known vulnerabilities.
SDIO and PCI attachments are not supported yet.
