NetBSD/src/share/man/man4/ca.4
.\"	$NetBSD: ca.4,v 1.2 2000/03/21 13:10:23 ad Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Andy Doran.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 9, 2000
.Dt CA 4
.Os
.Sh NAME
.Nm ca
.Nd Compaq array disk driver
.Sh SYNOPSIS
.Cd ca* at cac? unit ?
.Sh DESCRIPTION
The
.Nm
driver provides support for RAID arrays attached to Compaq array controllers
(supported by the
.Nm cac
device).
.Sh FILES
.Bl -tag -width /dev/rcaXXXXX -compact
.It Pa /dev/ca Ns Ar u Ns Ar p
block mode disk unit
.Ar u ,
partition
.Ar p
.It Pa /dev/rca Ns Ar u Ns Ar p
raw mode disk unit
.Ar u ,
partition
.Ar p
.Sm off
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr cac 4 .
.Sh AUTHOR
The
.Nm
driver was written by
.An Andy Doran Aq ad@netbsd.org ,
based upon the
.Nm sd
driver, which is the work of others.
.Sh HISTORY
The
.Nm ca
driver first appeared in
.Nx 1.5 .
.Sh BUGS
Array state is not verified upon startup.
