NetBSD/src/share/man/man4/canloop.4
.\"	$NetBSD: canloop.4,v 1.1.2.1 2017/05/18 11:28:48 bouyer Exp $
.\"
.\" Copyright (c) 2017 Manuel Bouyer.
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
.\"
.Dd May 18, 2017
.Dt CANLOOP 4
.Os
.Sh NAME
.Nm canloop
.Nd software loopback CAN network interface
.Sh SYNOPSIS
.Cd "pseudo-device canloop"
.Sh DESCRIPTION
The
.Nm canloop
pseudo interface is a loopback interface for the CAN layer. It can be used
as destination by a CAN application, when no CAN hardware is available.
Other sockets bound to the same
.Nm canloop
interface (or not bound to any interface) will receive the frames.
.Pp
.Nm canloop
interfaces can be created by using the
.Xr ifconfig 8
.Cm create
command.
.Sh SEE ALSO
.Xr can 4 ,
.Xr intro 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device appeared in
.Nx 8.0 .
