NetBSD/src/share/man/man4/cardbus.4
.\"	$NetBSD: cardbus.4,v 1.6 2000/07/31 11:45:48 ad Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 14, 1999
.Dt CARDBUS 4
.Os
.Sh NAME
.Nm cardbus ,
.Nm cbb
.Nd introduction to Cardbus support
.Sh SYNOPSIS
.Cd "cbb*      at pci? dev? function ?"
.Cd "cardslot* at cbb? flags 0x0000"
.Cd "cardbus*  at cardslot?"
.Cd "pcmcia*   at cardslot?"
.Cd "XX*       at cardbus? dev ? function ?"
.Pp
.Sh INTRODUCTION
.Nx
provides machine-independent bus support and
drivers for Cardbus devices.
.Pp
The flags are used with cardslot definition.  The lowest order bit
(rightmost bit) of the flags define the pccard attach sequence at the
boot time.  When the bit is set, a pccard on the slot is probed and
attached immidiately.  On the other hand, the pccard is probed after
kernel thread wakes up.  If a pccard is used as a boot device (ex. CF
card or network card), you should set the bit 1.
.Sh SUPPORTED DEVICES
.Nx
includes the following machine-independent Cardbus
drivers, sorted by function and driver name:
.Pp
.Ss Network interfaces
.Bl -tag -width speaker -offset indent -compact
.It ex
3Com 3C575TX and 3C575BTX
.It fxp
Intel i8255x
.It rtk
RealTek 8129/8139
.It tlp
DECchip 21143
.El
.\"
.Pp
.Ss Serial interfaces
.Bl -tag -width speaker -offset indent -compact
.It com
Modems and serial cards
.El
.\"
.Pp
.Ss SCSI controllers
.Bl -tag -width speaker -offset indent -compact
.It ahc
Adaptec ADP-1480
.El
.\"
.Pp
.Ss USB controllers
.Bl -tag -width speaker -offset indent -compact
.It ohci
Open Host Controller driver
.El
.Sh SEE ALSO
.Xr ahc 4 ,
.Xr com 4 ,
.Xr ex 4 ,
.Xr fxp 4 ,
.Xr ohci 4 ,
.Xr pci 4 ,
.Xr pcmcia 4 ,
.Xr rtk 4 ,
.Xr tlp 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.5 .
