NetBSD/src/share/man/man4/ciss.4
.\"	$NetBSD: ciss.4,v 1.2.2.2 2006/04/08 23:33:21 tron Exp $
.\"	Jonathan Stone, 2006.
.\"
.\"	derived from:
.\"	$OpenBSD: ciss.4,v 1.4 2006/01/07 21:55:02 brad Exp $
.\"	Michael Shalayeff, 2005. Public Domain.
.\"
.Dd March 15, 2006
.Dt CISS 4
.Os
.Sh NAME
.Nm ciss
.Nd HP/Compaq Smart ARRAY 5/6 RAID controllers
.Sh SYNOPSIS
.Cd "ciss* at pci? function ?"
.Cd "scsibus* at ciss?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the CISS interface implemented by 5th and later
generations of the HP/Compaq Smart ARRAY family of controllers.
.Pp
The
.Em CISS
interface is  defined in the document entitled
.%T "CISS Command Interface for SCSI-3 Support Open Specification, Version 1.04, Valence Number 1" ,
dated 2000/11/27, produced by Compaq Computer Corporation.
.Pp
This
driver supports several Compaq and HP controllers implementing the CISS interface,
including:
.Pp
.Bl -bullet -compact
.It
Compaq Smart Array 5300 version 1
.It
Compaq Smart Array 5300 version 2
.It
HP Smart Array 5312
.It
Compaq Smart Array 5i version 1
.It
Compaq Smart Array 5i version 2
.It
HP Smart Array 6i
.It
HP Smart Array 641
.It
HP Smart Array 642
.It
HP Smart Array 6400
.It
HP Smart Array 6400 EM
.It
HP Smart Array E200
.It
HP Smart Array E200i
.It
HP Smart Array P400
.It
HP Smart Array P400i
.It
HP Smart Array P600
.It
HP Smart Array P800
.It
HP Smart Array V100
.It
HP Smart Array 1 through 13
.El
.Pp
These controllers support RAID 0, RAID 1, RAID 5, JBOD,
and superpositions of those configurations.
.Pp
Although the controllers are actual RAID controllers,
the 
.Nm
driver makes them look just like SCSI controllers.
All RAID configuration must be done through the controllers' BIOSes.
.Pp
Hardware from previous generations of this product family may be
supported by the
.Xr cac 4
driver.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sd 4 .
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Michael Shalayeff Aq mickey@openbsd.org ,
and ported to 
.Nx
by
.An Tonnerre Lombard Aq tonnerre@thebsh.sygroup.ch .
