NetBSD/src/share/man/man4/clcs.4
.\" $NetBSD: clcs.4,v 1.5.22.1 2008/05/18 12:31:05 yamt Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 2, 2006
.Dt CLCS 4
.Os
.Sh NAME
.Nm clcs
.Nd Cirrus Logic CS4280 audio device driver
.Sh SYNOPSIS
.Cd "clcs*  at pci? dev ? function ?"
.Cd "audio* at audiobus?"
.Cd "midi*  at clcs?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Cirrus Logic CS4280 chip.
Partial support exists for the CS461x chips, but is disabled.
Instead, the
.Xr wss 4
or
.Xr sb 4
drivers should be used.
.Sh SEE ALSO
.Xr audio 4 ,
.Xr midi 4 ,
.Xr pci 4 ,
.Xr sb 4 ,
.Xr wss 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 1.5 .
