NetBSD/src/share/man/man4/cmpci.4
.\" $NetBSD: cmpci.4,v 1.6 2002/02/13 08:17:32 ross Exp $
.\"
.\" Copyright (c) 2000, 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Takuya SHIOZAKI <AoiMoe@imou.to> .
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by ITOH Yasufumi.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 29, 2000
.Dt CMPCI 4
.Os
.Sh NAME
.Nm cmpci
.Nd C-Media CMI8x38 audio device driver
.Sh SYNOPSIS
.Cd "cmpci* at pci? dev ? function ?"
.Cd "audio* at cmpci?"
.Cd "mpu*   at cmpci?"
.Cd "opl*   at cmpci? flags 1"
.Sh DESCRIPTION
The
.Nm
device driver supports C-Media CMI8x38 based sound cards.
.Pp
The device has
SPDIF input/output interfaces,
16bit CODEC with analog mixer,
OPL3 FM Synthesizer,
and MPU401 compatible MIDI I/O port interface.
.Sh MIXER DEVICE
The mixer device of
.Nm
driver can be accessed via
.Xr mixerctl 1
command.
The complex structure is analyzed as follows.
.Bd -literal
SPDIF in  ----------------------
#1(coax)-\*[Gt]|spdin1              |  R    -----------------------
#2(opt)--\*[Gt]|spdin2  spdif.input |--*-\*[Gt]--|spdin   spdif.output |--\*[Gt] SPDIF
       --\*[Gt]|spdout              |  | --\*[Gt]|playback             |    output
       |  ----------------------  | |  -----------------------
       --------------------\*[Lt]------+-*
     ---------\*[Lt]-------------------+-+----------------------------------
     |  ------------------------  | |   -----------------------       |
     --\*[Gt]|legacy  spdif.output. |--+-*--\*[Gt]|spdout               |       |
     --\*[Gt]|wave    playback      |  -----\*[Gt]|spdin  spdif.monitor |----   |
     |  ------------------------     NC-|off                  |   |   |
     ---------\*[Lt]-- spdif                 -----------------------   |   |
         -------+------- dac ------------    -----------------    v   |
wave  --\*[Gt]|playback.mode|----\*[Gt]|inputs.dac|-*-\*[Gt]|inputs.dac.mute|-\*[Gt]----- |
playback ---------------     ------------ R  -----------------  | + | |
                  -----------------     ---------------------   |mix| |
FM synthesizer --\*[Gt]|inputs.fmsynth |--*-\*[Gt]|inputs.fmsynth.mute|--\*[Gt]----- |
                  -----------------  R  ---------------------     *-\*[Gt]--
CD        ----------------------   ---------------------------    v
LINE-IN -\*[Gt]|inputs.{cd,line,aux}|-*\*[Gt]|inputs.{cd,line,aux}.mute|-\*[Gt]-----
AUX       ---------------------- R ---------------------------  |   |
          ------------------                                    |   |
PC-SPK --\*[Gt]| inputs.speaker |-----------------------------------\*[Gt]| + |
          ------------------                                    |   |
          -------------------  ------------  -----------------  |mix|
MIC --*--\*[Gt]|inputs.mic.preamp|-\*[Gt]|inputs.mic|-\*[Gt]|inputs.mic.mute|-\*[Gt]|   |
      |   -------------------  ------------  -----------------  -----
      |   ------------   -----------------                       |
      ---\*[Gt]|record.mic|--\*[Gt]|               |                       v
          ------------   | record.source |--\*[Gt]to         -----------
                    *R--\*[Gt]| (select, mix) |   recording  |outputs.*|--\*[Gt]
                         -----------------              ----------- SPK
                                                                 (front)
.Ed
.Pp
Note the 2nd SPDIF input exists only on CMI8738/PCI-6ch versions.
.Sh MIXER EXAMPLES
Here are examples about wave playback and SPDIF input/output ports.
.Bl -tag -width 1n
.It Playback to speaker, SPDIF input to SPDIF output
.Dl mixerctl -w playback.mode=dac spdif.output=spdin spdif.monitor=off
.It Playback to SPDIF output, SPDIF input to speaker
.Dl mixerctl -w playback.mode=spdif spdif.output=playback spdif.output.playback=wave spdif.monitor=spdin
.It SPDIF input to both SPDIF output and speaker
.Dl mixerctl -w spdif.output=spdin spdif.monitor=spdin
.It Playback to both SPDIF output and speaker
.Dl mixerctl -w playback.mode=spdif spdif.output=playback spdif.output.playback=wave spdif.monitor=spdout
.It Mix playback and SPDIF input to speaker
.Dl mixerctl -w playback.mode=dac spdif.monitor=spdin
.El
.Sh SEE ALSO
.Xr mixerctl 1 ,
.Xr audio 4 ,
.Xr midi 4 ,
.Xr mpu 4 ,
.Xr opl 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 1.5 .
.Sh BUGS
4ch/6ch playback is not yet available.
Joystick port is not supported.
.Pp
.Dv spdif.output.playback=legacy
does not seem to work properly.
