NetBSD/src/share/man/man4/coretemp.4
.\" $NetBSD: coretemp.4,v 1.1.2.3 2008/01/09 01:39:06 matt Exp $
.\"-
.\" Copyright (c) 2007 Juan Romero Pardines.
.\" Copyright (c) 2007 Dag-Erling Coïdan Smørgrav
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/coretemp.4,v 1.4 2007/10/15 20:00:19 netchild Exp $
.\"
.Dd December 21, 2007
.Dt CORETEMP 4
.Os
.Sh NAME
.Nm coretemp
.Nd Intel Core on-die digital thermal sensor
.Sh SYNOPSIS
.Cd "options INTEL_CORETEMP"
.Sh DESCRIPTION
The
.Nm
driver provides support for the on-die digital thermal sensor present
on Intel Core and newer CPUs.
.Pp
The
.Nm
driver reports each core's temperature through the
.Xr envsys 4
API. The driver has only 1 temperature sensor:
.Bl -column "Sensor" "Units" "Typical" -offset indent
.It Sy "Sensor" Ta Sy "Units" Ta Sy "Typical Use"
.It Li "sensor0" Ta "uK" Ta "cpuN temperature"
.El
.Sh EVENTS
The
.Nm
driver is able to send a
.Em critical
event to the
.Fa /etc/powerd/scripts/sensor_temperature
.Xr powerd 8
script (if running) when the temperature has reached a critical state.
.Sh SEE ALSO
.Xr envstat 4 ,
.Xr powerd 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 7.0 .
And then was ported to
.Nx 5.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Rui Paulo Aq rpaulo@FreeBSD.org
as part of a Google Summer of Code project. It was adapted to
.Nx
by
.An Juan Romero Pardines .
