NetBSD/src/share/man/man4/cxdtv.4
.\" $NetBSD: cxdtv.4,v 1.2 2011/08/13 22:21:28 wiz Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 13, 2011
.Dt CXDTV 4
.Os
.Sh NAME
.Nm cxdtv
.Nd digital video driver for Conexant CX2388x based cards
.Sh SYNOPSIS
.Cd "cxdtv* at pci? dev ? function ?"
.Cd "iic* at cxdtv?"
.Sh DESCRIPTION
The
.Nm
driver provides support for digital video cards based on the
Conexant CX23881, CX23882, CX23883, and CX23884 multimedia bridges.
.Pp
Supported cards include:
.Bl -bullet -offset indent
.It
ATI HDTV Wonder (digital-only)
.It
pcHDTV HD5500
.El
.Sh SEE ALSO
.Xr dtv 4 ,
.Xr iic 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jonathan A. Kollasch
.Aq jakllsch@NetBSD.org
and
.An Jared D. McNeill
.Aq jmcneill@NetBSD.org .
.Sh BUGS
The
.Nm
driver lacks support for analog video capture, analog audio capture,
FM tuning, and the IR receiver.
