NetBSD/src/share/man/man4/devfsctl.4
.\"	$NetBSD: devfsctl.4,v 1.1.2.1 2008/04/04 10:52:56 mjf Exp $
.\"
.\" Copyright (c) 2008 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Matt Fleming.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 3, 2008
.Dt DEVFSCTL 4
.Os
.Sh NAME
.Nm devfsctl
.Nd devfs control driver
.Sh SYNOPSIS
.Cd "pseudo-device devfsctl"
.Sh DESCRIPTION
The
.Nm
driver enables communication between the devfs file-system code and the
.Xr devfsd 8
userland daemon. As devices are attached and removed from the system
events are generated which are enqueued in this driver. The userland
daemon can also create and remove device nodes via the
.Nm
driver.
.Sh SEE ALSO
.Xr mount 8 ,
.Xr devfsd 8
.Sh FILES
.Bl -tag -width /dev/devfsctl -compact
.It Pa /dev/devfsctl
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 5.0 .
