NetBSD/src/share/man/man4/dk.4
.\"	$NetBSD: dk.4,v 1.10 2021/01/06 14:07:43 wiz Exp $
.\"
.\" Copyright (c) 2006 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Jonathan A. Kollasch used vnd(4) as the template for this man page.
.\"
.Dd October 26, 2020
.Dt DK 4
.Os
.Sh NAME
.Nm dk
.Nd disk partition
.Pq wedge
driver
.Sh SYNOPSIS
.Cd "options DKWEDGE_AUTODISCOVER"
.Cd "options DKWEDGE_METHOD_BSDLABEL"
.Cd "options DKWEDGE_METHOD_GPT"
.Cd "options DKWEDGE_METHOD_MBR"
.Cd "options DKWEDGE_METHOD_RDB"
.Cd "options DKWEDGE_METHOD_APPLE"
.Sh DESCRIPTION
The
.Nm
driver provides a disk-like interface, or
.Em wedge ,
to an area of a physical disk.
Wedges may be configured manually with
.Xr dkctl 8
or automatically by the kernel upon the attachment of the physical disk.
.Pp
Wedges needs to have a unique name.
If a duplicate name is detected during
auto-discovery, that partition is ignored.
.Sh KERNEL OPTIONS
.Bl -tag -width DKWEDGE_METHOD_BSDLABEL
.It Dv DKWEDGE_AUTODISCOVER
Automatically detect and configure wedges using any available methods.
.Pp
Currently only
.Dv DKWEDGE_METHOD_GPT
and
.Dv DKWEDGE_METHOD_APPLE
are enabled by default.
.Pp
For each partition found, a wedge with a corresponding name is created.
.It Dv DKWEDGE_METHOD_BSDLABEL
BSD disklabel detection method.
For each configured partition in the
.Xr disklabel 5
that is not of type
.Dv FS_UNUSED ,
a wedge is created and named after the
.Va d_packname
field followed by "/" and the partition letter a..p.
.Pp
When the
.Va d_packname
is empty or has the value "fictitious", the regular partition names
are used as wedge names, i.e. the device name, unit number and
partition letter, for example "wd0a".
.It Dv DKWEDGE_METHOD_GPT
Extensible Firmware Interface Globally Unique Identifier Partition Table
(GPT) detection method.
.Pp
For every GPT partition a wedge is created and named after the
partition label.
GPT partitions are UTF-16-encoded, this is converted into UTF-8.
If a partition has no label, its UUID is used instead.
.It Dv DKWEDGE_METHOD_MBR
IBM PC-compatible Master Boot Record (MBR) partitioning detection method,
with support for Extended MBRs.
.Pp
For every partition in the MBR a wedge is created and named like a
regular partition name, i.e. the device name, unit number and a
partition letter, for example "wd0e".
Primary partitions start with "e", extended partitions start with "i".
.It Dv DKWEDGE_METHOD_RDB
Amiga Rigid Disk Block (RDB) partitioning detection method.
.It Dv DKWEDGE_METHOD_APPLE
Apple partition map detection method.
.El
.Sh FILES
.Bl -tag -width /dev/XXrXdkX -compact
.It Pa /dev/{,r}dk*
.Nm
device special files.
.El
.Sh SEE ALSO
.Xr config 1 ,
.Xr disklabel 8 ,
.Xr dkctl 8 ,
.Xr fdisk 8 ,
.Xr gpt 8 ,
.Xr MAKEDEV 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 3.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Jason R. Thorpe .
