NetBSD/src/share/man/man4/dpt.4
.\"	$NetBSD: dpt.4,v 1.4 2000/01/05 16:33:01 ad Exp $
.\"
.\" Copyright (c) 1999 Andy Doran <ad@NetBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 28, 1999
.Dt DPT 4
.Os
.Sh NAME
.Nm dpt
.Nd
.Tn Driver for DPT EATA SCSI adapters
.Sh SYNOPSIS
.Cd "dpt* at eisa? slot ?"
.Cd "dpt* at pci? dev ? function ?"
.Cd "scsibus* at dpt?"
.Sh HARDWARE
The
.Nm
driver provides support for the following
.Tn SCSI
adapters:
.Pp
.Bl -tag -width -offset indent -compact
.It Tn DPT SmartCache III
.It Tn DPT SmartCache IV
.It Tn DPT SmartRAID III
.It Tn DPT SmartRAID IV
.El
.Sh DIAGNOSTICS
.Bl -tag -width indent -compact
.It dpt0: readcfg failed - see dpt(4)
.br
The EATA configuration data did not appear upon request. This may be caused
by older firmware. Generally the solution is to power-cycle the affected
machine.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr cd 4 ,
.Xr ch 4 ,
.Xr scsi 4 .
.Xr sd 4 ,
.Xr st 4 ,
.Sh AUTHOR
The
.Nm
driver was written by Andy Doran, based upon the 
.Nm uha
and
.Nm bha
drivers, which are the work of others.
.Sh HISTORY
The
.Nm dpt
driver first appeared in
.Nx 1.5 .
.Sh BUGS
This manpage is inadaquate.
.Pp
EATA adapters other than listed may function correctly with the
.Nm 
driver, however a definitive list is not avaiable.
.Pp
Older firmware may prove problematic when used with this driver. It is
recommended that the latest available firmware be used. Contact DPT
for a firmware update.
.Pp
Boards that do not suppport scatter-gather I/O or DMA are not supported.
.Pp
An ISA front-end is needed.
