NetBSD/src/share/man/man4/dse.4
.\"	$NetBSD: dse.4,v 1.3 2025/06/27 21:36:23 andvar Exp $
.\" Copyright (c) 2022  Nathanial Sloss <nathanialsloss@yahoo.com.au>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 16, 2022
.Dt DSE 4
.Os
.Sh NAME
.Nm dse
.Nd DaynaPORT SCSI/Link SCSI bus Ethernet interface driver
.Sh SYNOPSIS
.Cd "dse* at scsibus? target ? lun ?"
.Sh DESCRIPTION
The
.Nm
driver supports the
.Tn DaynaPORT
SCSI/Link
.Tn SCSI
bus
.Tn Ethernet
interface.
These devices can also be currently emulated on a Raspberry Pi with an RaSCSI
board running PiSCSI software.
.Pp
There are additionally
.Fn open ,
.Fn close ,
and
.Fn ioctl
entry points so that the device also appears as a
.Tn SCSI
device.
Currently these functions are place holders.
.Sh SEE ALSO
.Xr scsi 4 ,
.Xr ifconfig 8
.Sh AUTHORS
.An -nosplit
.An Hiroshi Noguchi Aq Mt ngc@ff.iij4u.or.jp
.Pp
.An -nosplit
.An Matt Sandstrom Aq Mt mattias@beauty.se
who modified this driver for
.Nx 1.5.3
.Sh BUGS
This device  doesn't conform to the
.Tn SCSI
specification.
Also that this manual page was written by
.An -nosplit
.An Nathanial Sloss Aq Mt nathanialsloss@yahoo.com.au
.Sh REFERENCES
.Tn RaSCSI
http://retropc.net/gimons/rascsi/
.Pp
.Tn PiSCSI (formally RaSCSI Reloaded)
https://github.com/PiSCSI
.Pp
.Tn Raspberry Pi
https://www.raspberrypi.org/
