NetBSD/src/share/man/man4/dtv.4
.\" $NetBSD: dtv.4,v 1.6 2011/08/29 11:23:53 jruoho Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 14, 2011
.Dt DTV 4
.Os
.Sh NAME
.Nm dtv
.Nd interface for digital television
.Sh SYNOPSIS
.Cd "dtv* at dtvbus?"
.Pp
.In dev/dtv/dtvio.h
.In dev/dtv/dtvio_demux.h
.In dev/dtv/dtvio_frontend.h
.Sh DESCRIPTION
The machine-independent
.Nm
interface provides support for digital television
.Pq Dv DTV .
A subset of the Linux Digital Video Broadcasting
.Pq Dv DVB
.Dv APIs
is supported.
In particular,
.Nm
provides the DVB frontend and demodulator
.Dv APIs .
.Sh SUPPORTED DEVICES
The following machine-independent devices are supported:
.Bl -tag -width "auvitek(4) " -offset indent
.It Xr auvitek 4
Auvitek AU0828-based video capture cards
.\"
.\" XXX: Uncomment once the stub-pages are actually installed.
.\"
.\" .It Xr coram 4
.\" Hauppauge WinTV-HVR-1250
.\" .It Xr cxdtv 4
.\" Conexant CX2388X-based DTV cards
.\" .It Xr emdtv 4
.\" EM28XX-based DTV cards
.El
.Pp
Note that the
.Nm
device drivers are generally only available as kernel modules; see
.Xr module 7
and
.Xr modload 8
for additional details.
.Sh FILES
.Bl -tag -width 28n
.It Pa /dev/dvb/adapterN/frontend0
The frontend device, for controlling the tuner and demodulator hardware.
.It Pa /dev/dvb/adapterN/demux0
The demux device, for controlling the hardware filters.
.It Pa /dev/dvb/adapterN/dvr0
Digital video recording device.
.El
.Sh SEE ALSO
.Xr auvitek 4 ,
.\" coram 4 ,
.\" cxdtv 4 ,
.\" emdtv 4 ,
.Xr video 9
.Pp
.Pa pkgsrc/multimedia/dvb-apps ,
.Pa pkgsrc/multimedia/mplayer ,
.Rs
.%T Linux Media Infrastructure API.
.%T Part II. Linux DVB API
.%D 2011
.%U http://linuxtv.org/downloads/v4l-dvb-apis/dvbapi.html
.Re
.Sh HISTORY
The
.Nm
interface first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An Jared D. McNeill
.Aq jmcneill@invisible.ca
