NetBSD/src/share/man/man4/dtvi2c.4
.\" $NetBSD: dtvi2c.4,v 1.1 2011/08/14 16:04:12 wiz Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 14, 2011
.Dt DTVI2C 4
.Os
.Sh NAME
.Nm dtvi2c
.Nd iic-connected support modules for dtv
.Sh DESCRIPTION
The
.Nm
modules are drivers for support hardware needed by DVB devices.
This includes e.g. tuners, demodulators, and analog video decoders.
.Pp
The usual hardware structure consists of a host controller
(connected via
.Xr usb 4
or
.Xr pci 4 )
that provides the data moving facilities (for the analog or
digital video streams) and an
.Xr iic 4
bus over which the other chips can be configured.
.Pp
For example, a typical
.Xr dtv 4
setup would look like this:
.Bl -bullet -offset indent
.It
initialize transport stream (TS) port on host controller
.It
configure demodulator (put it in the ATSC/QAM/DVB-T/etc. mode)
.It
configure tuner (set frequency etc.)
.It
start TS transfer (using DMA transfers or USB high speed transfers)
.El
.Pp
The currently supported modules are:
.Bl -tag -width 10n -offset indent
.It au8522
Auvitek AU8522 ATSC demodulator
.It cx24227
Conexant CX24227 ATSC demodulator
.It lg3303
LG LGDT3303 ATSC demodulator
.It mt2131
MicroTune MT2131 ATSC demodulator
.It nxt2k
XXX description
.It tvpll
Philips TUV1236D and LG TDVS-H06xF ? XXX
.It xc3028
XCeive XC3028 analog and digital tuner
.It xc5k
XXX description
.El
.Sh FILES
.Bl -bullet
.It
.Pa dvb-fe-nxt2004.fw
needed by nxt2k
.It
.Pa xc3028L-v36.fw
or
.Pa xc3028-v27.fw
needed by xc3028
.It
.Pa dvb-fe-xc5000-1.6.114.fw
needed by xc5k, provided by
.Pa pkgsrc/sysutils/xc5k-firmware
.El
.Sh SEE ALSO
.Xr dtv 4 ,
.Xr iic 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
modules were written by
.An Jared D. McNeill
.Aq jmcneill@NetBSD.org
and
.An Jonathan A. Kollasch
.Aq jakllsch@NetBSD.org .
