NetBSD/src/share/man/man4/eisa.4
.\"	$NetBSD: eisa.4,v 1.4 2000/01/05 17:55:22 ad Exp $
.\"
.\" Copyright (c) 1997 Jonathan Stone
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Jonathan Stone
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 1997
.Dt EISA 4
.Os
.Sh NAME
.Nm eisa
.Nd Introduction to EISA bus machine-independent drivers and support
.Sh SYNOPSIS
.Pp
Machine-dependent; depends on the bus topology and EISA-bus interface
of your system. Typical EISA buses are either connected directly
to the main system bus, or via an PCI-to-EISA bridge.
See the
.Xr intro 4
documentation for your system for details.
.Sh INTRODUCTION
.Nx 1.2 
and later versions include  machine-independent bus support and
drivers for the following EISA bus devices.
.Sh SUPPORTED DEVICES
.Nx
includes machine-independent EISA drivers, sorted by device type
and driver name:
.Pp
SCSI adaptors:
.Bl -tag -width speaker -offset indent -compact
.It ahb
Adaptec 174x EISA SCSI adaptor.
.It ahc
Adaptec AIC 7770, 274x, and 284x EISA SCSI adaptor boards.
.It bha
BusLogic  BT-74x SCSI boards.
.It dpt
DPT SmartCache/SmartRAID III and IV SCSI adaptor boards.
.It uha
Ulrastor 24f EISA SCSI adaptor.
.El
.\"
.\"
.\"
.Pp
Network interfaces:
.Bl -tag -width speaker -offset indent -compact
.It ep
3Com 3c579 and 3c592 10Mbit Ethernet, and 3c597 10/100Mbit Ethernet interfaces.
.It fea
Digital DEFEA EISA FDDI adaptor.
.El
.Pp
Note that most or all EISA devices also have PCI or ISA equivalents.
variants. These are listed in 
.Xr pci 4 ,
.Xr isa 4 ,
or
.Xr isapnp 4 ,
respectively.  The manual pages for each individual driver also lists the
supported bus variants.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr ahb 4 ,
.Xr ahc 4 ,
.Xr bha 4 ,
.Xr dpt 4 ,
.Xr ep 4 ,
.Xr fea 4 ,
.Xr uha 4 .
.Sh HISTORY
The
.Nm eisa
introduction
appeared in
.Nx 1.3 .
