NetBSD/src/share/man/man4/elmc.4
.\" $NetBSD: elmc.4,v 1.7 2001/10/18 18:41:22 jdolecek Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 2, 2001
.Dt ELMC 4
.Os
.Sh NAME
.Nm elmc
.Nd
.Tn 3Com
EtherLink/MC (3c523)
.Tn MCA
.Tn Ethernet
driver
.Sh SYNOPSIS
.Cd "elmc* at mca? slot ?"
.Sh DESCRIPTION
The
.Nm
driver supports
.Tn 3Com
EtherLink/MC (3c523) 10Mb/s
.Tn Ethernet
NIC based on the
.Tn Intel
82586
.Tn Ethernet
chip.
.Sh SEE ALSO
.Xr ai 4 ,
.Xr ef 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr ix 4 ,
.Xr mca 4 ,
.Xr ifconfig 8
.Pp
.Pa http://www.3com.com/
.Sh AUTHORS
The driver was written by
.An Jaromir Dolecek Aq jdolecek@NetBSD.org .
