NetBSD/src/share/man/man4/emdtv.4
.\" $NetBSD: emdtv.4,v 1.2 2011/08/14 15:21:01 wiz Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 13, 2011
.Dt EMDTV 4
.Os
.Sh NAME
.Nm emdtv
.Nd digital video driver for Empia Technology EM28xx based cards
.Sh SYNOPSIS
.Cd "emdtv* at uhub?"
.Sh DESCRIPTION
The
.Nm
driver provides support for digital video cards based on the
Empia Technology EM28xx series of DTV interface chips (in particular,
the EM2883).
This chip is used in USB products.
.Pp
Supported cards include:
.Bl -bullet -offset indent
.It
ATI/AMD TV Wonder 600 USB
.\".It
.\"Empia Hybrid XS ATSC
.It
Pinnacle PCTV HD Pro Stick (800e)
.El
.Sh SEE ALSO
.Xr dtv 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jared D. McNeill
.Aq jmcneill@NetBSD.org .
