NetBSD/src/share/man/man4/ep.4
.\"	$NetBSD: ep.4,v 1.18 1997/11/11 05:11:28 thorpej Exp $
.\"
.\" Copyright (c) 1997 Jonathan Stone
.\" All rights reserved.
.\"
.\" Copyright (c) 1994 Herb Peyerl
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Herb Peyerl
.\"      This product includes software developed by Jonathan Stone
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 20, 1997
.Dt EP 4
.Os NetBSD
.Sh NAME
.Nm ep
.Nd device driver for 3Com Etherlink III family
.Sh SYNOPSIS
.Cd "ep0 at isa? port ? irq ?"
.Cd "ep* at isapnp?"
.Cd "ep* at eisa? slot ?"
.Cd "ep* at pci? dev ? function ?"
.Cd "ep* at pcmcia? function ?"
.Sh DESCRIPTION
The
.Nm ep
device driver supports the 3Com Etherlink III family of Ethernet cards.
Supported Etherlink III cards include:
.Pp
.Bl -tag -width xxxxxx -offset indent
.It 3c509
ISA 10Mbit card, in BNC and multiport variants
.It 3c509B
ISA Plug-and-Play 10Mbit card, in BNC and multiport variants
.It 3c579
EISA 10Mbit card, in BNC and muiltport variants
.It 3c592
EISA 10Mbit card with busmastering capability
.It 3c597
EISA 10/100Mbit card with busmastering capability
.It 3c590
PCI 10Mbit multiport card with busmastering capability
.It 3c595
PCI 10/100Mbit multiport card with busmastering capability
.It 3c900
PCI 10Mbit card in 10baseT and multiport variants
.It 3c905
PCI 10/100Mbit cards
.It 3c562
PCMCIA modem/10Mbit Ethernet combo card with dongle
.It 3c589
PCMCIA 10Mbit card with dongle
.El
.Pp
The 3c515 is an ISA 10/100 card with busmastering capability.
The chipset is similar to that of the 3c905, with some changes to
make it work with the more limited ISA bus address space.  This card
is not currently supported.
.Sh MEDIA SELECTION
Various models of these cards come with a different assortment of
media. Supported 10Mbit Ethernet media include:
.Pp
.Bl -tag -width xxxxxxxxxx -offset indent
.It 10base5
AUI, standard 15 pin connector
.It 10base2
BNC, also known as thin-net
.It 10baseT
UTP, also known as twisted pair
.El
.Pp
The 100Mbit cards each support exactly one of the following 100Mbit
standards:
.Pp
.Bl -tag -width xxxxxxxxxx -offset indent
.It 100baseTX
100Mbit over cat-5 UTP
.It 100baseT4
100Mbit over all four pairs of cat-3 UTP
.It 100baseFX
100Mbit over fiber
.It MII
MII connection to external 100Mbit PHY
.El
.Pp
Note that the 100baseTX and 100baseT4 cards can also run as 10baseT.
.Pp
The
.Nm 
driver defaults to using the port selected via the vendor-supplied
configuration utility.
To choose an alternate port,
use the following media flags with
.Xr ifconfig 8
or in your /etc/ifconfig.ep? file.
.Pp
.Bl -tag -width xxxxxxxxxx -offset indent
.It 10base2
Use the 10base-2 BNC port.
.It AUI
Use the AUI port.
.It 10baseT
Use the UTP port in 10base-T mode.
.It 100baseTX
Use the builtin 100base-Tx PHY on the UTP port.
.It 100baseFX
Use the builtin 100mbit fibre-optic PHY.
.It 100baseT4
Use the builtin 100base-T4 PHY on the UTP port.
.El
.Pp
The
.Nm
driver no longer supports changing media via the link0/link1/link2 flags.
.Pp
You may specify the port and irq numbers that ISA cards are expected
to be found at, but it is not necessary.
The cards are sufficiently intelligent to tell us where they
actually live on the ISA bus.
.Sh NOTES
Etherlink III cards have no jumpers to set the address.
3Com supplies software to set the address of the card in software.
To find the card on the ISA bus, the kernel performs a complex
scan operation at IO address 0x100.
Beware!
Avoid placing other cards at that address!
.Pp
The 3Com configuration utilities can `autosense' the active media and
save it as default.  The saved default medium is the medium that
was  active atthe time the configuration utility was run.  The
.Nm
driver does not yet re-autosense the active media at boot time.
If the EEPROM autosense bit is set, the driver simply uses the media
type sensed and saved when the configuration utility was run.
.Sh DIAGNOSTICS
.Bl -diag
.It "ep0: reset (status: %x)"
the driver has encountered a FIFO underrun or overrun. The driver will reset
the card and the packet will be lost. This is not fatal.
.It "ep0: eeprom failed to come ready"
The eeprom failed to come ready.  This probably means the card is wedged.
.It "ep0: 3c509 in test mode. Erase pencil mark!"
This means that someone has scribbled with pencil in the test area on the
card.  Erase the pencil mark and reboot.  (This is not a joke).
.El
.Sh BUGS
Support for autosensing the active media should be added to the driver.
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr intro 4 ,
.Xr isa 4 ,
.Xr isapnp 4 ,
.Xr eisa 4 ,
.Xr pci 4 ,
.Xr pcmcia 4
