NetBSD/src/share/man/man4/esl.4
.\"	$NetBSD: esl.4,v 1.3 2001/09/30 00:02:03 wiz Exp $
.\"
.\" Copyright (c) 2001 Jared D. McNeill <jmcneill@invisible.yi.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by Jared D. McNeill.
.\" 4. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 20, 2001
.Dt ESL 4
.Os
.Sh NAME
.Nm esl
.Nd ESS Technology AudioDrive (Programmed I/O mode) family audio device driver
.Sh SYNOPSIS
.Cd "esl*   at pcmcia? function ?"
.Cd "audio* at esl?"
.Cd "opl*   at esl?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the ESS 1688 AudioDrive audio devices on a
PCMCIA card.
.Pp
Since there is no way to do DMA over the pcmcia bus, the
.Nm
driver uses a Programmed I/O mode to drive the cards. This is very
inefficient, but is the only way to drive such a card.
.Pp
Cards supported by this driver are capable of 8- and 16-bit audio sample
playback at rates up to 44.1kHz.
.Sh SEE ALSO
.Xr audio 4 ,
.Xr midi 4 ,
.Xr opl 4 ,
.Xr pcmcia 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 1.6 .
.Sh AUTHORS
.An Jared D. McNeill Aq jmcneill@invisible.yi.org
.Sh BUGS
Putting a machine into suspend mode while this driver is active will
cause the machine to freeze.
.Pp
Recording is not yet supported by this driver.
