NetBSD/src/share/man/man4/esp.4
.\"	$NetBSD: esp.4,v 1.3 1998/04/30 08:50:05 fair Exp $
.\"
.\" Copyright (c) 1997 Eric S. Hvozda (hvozda@netcom.com)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Eric S. Hvozda.
.\" 4. The name of Eric S. Hvozda may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd May 6, 1997
.Dt ESP 4
.Os NetBSD 
.Sh NAME
.Nm esp
.Nd Emulex ESP406 and Qlogic FAS408 SCSI driver
.Sh SYNOPSIS
.Cd "esp0 at isa? port 0x230 irq ?"
.Cd "scsibus* at esp?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Emulex ESP406
and
.Tn Qlogic FAS408
.Tn SCSI
controller chips.
This includes the
.Tn Qlogic
.Tn ISA
and
.Tn VLB
.Tn SCSI
host adapters.
.Pp
For
.Tn Qlogic
.Tn PCI
.Tn SCSI
host adapters, use the
.Xr isp 4
device.
.Sh BUGS
Neither
.Tn DMA
or synchronous data transfers are currently supported.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr cd 4 ,
.Xr ch 4  
