NetBSD/src/share/man/man4/ess.4
.\" $NetBSD: ess.4,v 1.3 1998/08/26 12:30:51 augustss Exp $
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"

.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 1, 1998
.Dt ESS 4
.Os NetBSD
.Sh NAME
.Nm ess
.Nd ESS Technology sound driver 
.Sh SYNOPSIS
.Cd "device ess0 at isa? port 0x220 irq 5 drq 0 drq2 1"
.Cd "device ess* at ofisa?"
.Cd "device ess* at isapnp?"
.Cd "audio*      at ess?"
.Cd "opl*        at ess?"
.Sh DESCRIPTION
The
.Nm
driver supports card based on ESS Technology 1887, 1888, and 888.
.Pp
Valid I/O addresses are
0x220, 0x230, 0x240, or 0x250.
Both IRQ and DMA channels are software programmable.
The IRQ may be set to 5, 7, 9 or 10, and on the 1887 also to 15.
The DMA channels may be set to 0, 1, or 3, and on the 1887 the second
channel also to 5.
.Pp
.Sh SEE ALSO
.Xr audio 4 ,
.Xr isa 4 ,
.Xr isapnp 4 ,
.Xr ofisa 4 ,
.Xr opl 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 1.4 .
