NetBSD/src/share/man/man4/et.4
.\"	$NetBSD: et.4,v 1.1 2010/11/13 00:47:24 jnemeth Exp $
.\"	$OpenBSD: et.4,v 1.2 2007/10/30 13:22:21 jmc Exp $
.\"
.\" Copyright (c) 2007 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd October 13, 2010
.Dt ET 4
.Os
.Sh NAME
.Nm et
.Nd Agere/LSI ET1310/ET1301 10/100/Gigabit Ethernet device
.Sh SYNOPSIS
.Cd "et* at pci? dev ? function ?"
.Cd "etphy* at mii? phy ?"
.Sh DESCRIPTION
The
.Nm
driver supports PCI Express Ethernet adapters based on the Agere/LSI
ET1310/ET1301 integrated MAC/PHY.
.Pp
The following
.Ar media
types are supported:
.Pp
.Bl -tag -width autoselect -compact
.It Cm autoselect
Enable autoselection of the media type and options.
.It Cm 10baseT
Set 10Mbps operation.
.It Cm 100baseTX
Set 100Mbps (Fast Ethernet) operation.
.It Cm 1000baseT
Set 1000Mbps (Gigabit Ethernet) operation (ET1310 only).
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr etphy 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.3 .
It was added to
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Sepherosa Ziehau
for
DragonFlyBSD,
ported to
.Ox
by
.An Jonathan Gray
.Aq jsg@openbsd.org ,
and subsequently ported to
.Nx
by
.An Kaspar Brand .
