NetBSD/src/share/man/man4/flash.4
.\"	$NetBSD: flash.4,v 1.2 2011/02/26 18:07:17 ahoka Exp $
.\"
.\" Copyright (c) 2010 Department of Software Engineering,
.\"		      University of Szeged, Hungary
.\" Copyright (c) 2010 Adam Hoka <ahoka@NetBSD.org>
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by the Department of Software Engineering, University of Szeged, Hungary
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 21, 2010
.Dt FLASH 4
.Os
.Sh NAME
.Nm flash
.Nd device-independent flash layer
.Sh SYNOPSIS
.In sys/flash.h
.Sh DESCRIPTION
The
.Nm
driver provides a device-independent interface for using flash memory.
.Pp
The following
.Xr ioctl 2
operations are supported on
.Pa /dev/flash :
.Bl -tag -width indent
.It Dv FLASH_ERASE_BLOCK (struct flash_erase_params)
This command erases one or more blocks.
.It Dv FLASH_DUMP (struct flash_dump_params)
This command dumps a block.
.It Dv FLASH_GET_INFO (struct flash_info_params)
This command aquires information aboout the flash device.
.It Dv FLASH_BLOCK_ISBAD (struct flash_badblock_params)
This command checks if a block is marked as bad.
.It Dv FLASH_BLOCK_MARKBAD (struct flash_badblock_params)
This command marks a block as bad.
.El
.Sh FILES
.Bl -tag -width /dev/flash -compact
.It Pa /dev/flash
.El
.Sh SEE ALSO
.Xr flash 9
.Xr nand 9
.Sh AUTHORS
.An Adam Hoka Aq ahoka@NetBSD.org
