NetBSD/src/share/man/man4/flash.4
.\"	$NetBSD: flash.4,v 1.1.2.1 2010/07/29 06:49:56 uebayasi Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 27, 2010
.Dt FLASH 4
.Os
.Sh NAME
.Nm flash
.Nd NOR FlashROM driver
.Sh SYNOPSIS
.Cd "options XIP"
.Sh DESCRIPTION
The
.Nm
driver provides a minimal MI access to NOR FlashROMs.
The only supported interface is the
.Xr mmap 2
to userland.
Write is not supported.
The
.Nm
driver was added mainly to support XIP.
.Sh FILES
.Bl -tag -width /dev/XXrXflashX -compact
.It Pa /dev/{,r}flash*
.Nm
device special files.
.El
.Sh SEE ALSO
.Xr xip 7
.Sh HISTORY
The
.Nm 
driver first appeared in
.Nx 6.0 .
