NetBSD/src/share/man/man4/fpa.4
.\"	$NetBSD: fpa.4,v 1.11 2002/03/06 14:43:03 wiz Exp $
.\"
.\" Copyright (c) 1995, Matt Thomas
.\" All rights reserved.
.\"
.Dd March 13, 1995
.Dt FPA 4
.Os
.Sh NAME
.Nm fpa ,
.Nm fea ,
.Nm fta
.Nd
.Tn DEC
FDDI interface driver
.Sh SYNOPSIS
.Cd "fpa* at pci? dev ? function ?"
.Cd "fea* at eisa? slot ?"
.Ss alpha and pmax
.Cd "fta* at tc? slot ? offset ?"
.Sh DESCRIPTION
Cards supported by the
.Nm fpa ,
.Nm fea
and
.Nm fta
device driver are:
.Pp
.Bl -tag -width xxxxxx -offset indent
.It DEFPA
DEC PCI FDDI Controller
.It DEFEA
DEC EISA FDDI Controller
.It DEFTA
DEC TURBOchannel FDDI Controller
.El
.Pp
respectively.
All variants of either controller are supported including the DAS
and SAS configurations.
.Sh DIAGNOSTICS
.Bl -diag
.It "fea%d: error: desired IRQ of %d does not match device's actual IRQ (%d)"
The device probe detected that the DEFEA board is configured for a different
interrupt than the one specified in the kernel configuration file.
.It "fea%d: error: memory not enabled! ECU reconfiguration required"
The device probe found that no device memory had been configured on the DEFEA.
The DEFEA can be configured with no device memory, this driver
requires a minimum of 1K device memory be setup.
The ECU (EISA Configuration Utility) will need to be run to change the settings.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh AUTHORS
The
.Nm fpa ,
.Nm fea
and
.Nm fta
device driver and manual page was written by Matt Thomas.
.Sh BUGS
Normally, the device driver will not enable the reception of SMT frames.
However if the IFF_LINK1 flag is set, the device driver will enable the
reception of SMT frames and pass them up to the Berkeley Packet Filter for
processing.
