NetBSD/src/share/man/man4/fujbp.4
.\" $NetBSD: fujbp.4,v 1.1 2011/02/20 08:31:46 jruoho Exp $
.\"
.\" Copyright (c) 2010, 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 20, 2011
.Dt FUJBP 4
.Os
.Sh NAME
.Nm fujbp ,
.Nm fujhk
.Nd Fujitsu Brightness, Pointer, and Hotkeys
.Sh SYNOPSIS
.Cd "fujbp* at acpi?"
.Cd "fujhk* at acpi?"
.Sh DESCRIPTION
Some Fujitsu laptops come with vendor-specific
.Tn ACPI
devices to manage the laptop hotkeys (such as the
.Sq Eco
button), and to control various built-in components (such as the display,
the touchpad, and the speakers).
The
.Nm
and
.Ic fujhk
drivers provide support, through these
.Tn ACPI
devices, for hotkeys, backlight on/off switch, brightness level control, and
pointer on/off switch.
.Pp
The following
.Xr sysctl 8
read/write variables are provided (when hardware support is available):
.Bl -tag -width hw.acpi.fujbp0.brightness -offset indent
.It Va hw.acpi.fujbp0.brightness
Brightness level (integer).
.It Va hw.acpi.fujbp0.pointer
Pointer switch state (boolean).
.It Va hw.acpi.fujhk0.backlight
Backlight switch state (boolean).
.El
.Pp
Please note, however, that future versions of the drivers may remove these
.Xr sysctl 8
variables without prior notice.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr acpivga 4 ,
.Xr sysctl 8 ,
.Xr pmf 9 ,
.Xr sysmon_pswitch 9
.Sh HISTORY
The
.Nm
and
.Ic fujhk
drivers appeared in
.Nx 6.0 .
.Sh AUTHORS
.An Gr\('egoire Sutre
.Aq gsutre@NetBSD.org
.Sh CAVEATS
Brightness level and backlight switch state should be controlled via
.Xr wsconsctl 8
instead of
.Xr sysctl 8 .
.Pp
The
.Xr sysctl 8
variable
.Va hw.acpi.fujbp0.pointer
should be replaced by a platform-independent userland control.
