NetBSD/src/share/man/man4/g760a.4
.\" $NetBSD: g760a.4,v 1.1 2010/10/02 06:22:00 kiyohara Exp $
.\"
.\" Copyright (c) 2008 A.Leo.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"          This product includes software developed for the
.\"          NetBSD Project.  See http://www.NetBSD.org/ for
.\"          information about NetBSD.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 11, 2008
.Dt G760A 4
.Os
.Sh NAME
.Nm g760a
.Nd Global Mixed-mode Technology Inc. G760a fan speed controller driver
.Sh SYNOPSIS
.Cd g760a0 at iic? addr 0x3e
.Pp
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Global Mixed-mode Technology Inc
G760a on iicbus fan speed controller to be used with the
.Xr envsys 4
API. This chip could be found in
.Tn D-Link's DNS-323 NAS box.
.Pp
The following
.Xr sysctl 8
variable control the fan's speed:
.Bl -tag
.It Dv machdep.g760a0.rpm
This value specifies the desired speed for the fan.
Valid range is 2000..20000 or 0 (the fan is turned off).
The default value is 0.
.Pp
When setting the desired speed the RPM number will be converted
to the internal represenation and truncated. For example when you
are setting 2000 it will be truncated to 2006, and 8000 will be
changed to 8057.
.El
.Sh SEE ALSO
.Xr lm 4 ,
.Xr envsys 4 ,
.Xr envstat 4
.Sh AUTHORS
The
.Nm
driver was written by A. Leo.
