NetBSD/src/share/man/man4/genet.4
.\"	$NetBSD: genet.4,v 1.1 2025/08/28 17:23:44 wiz Exp $
.\"
.\"	This man page is based on
.\"	$OpenBSD: bse.4,v 1.6 2022/03/21 14:56:16 miod Exp $
.\"
.\" Copyright (c) 2020 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd August 28, 2025
.Dt GENET 4
.Os
.Sh NAME
.Nm bse
.Nd Broadcom GENET 10/100/1Gb Ethernet device
.Sh SYNOPSIS
.Cd "genet* at acpi?"
.Cd "genet* at fdt?"
.Cd "brgphy*" at mii?
.Sh DESCRIPTION
The
.Nm
driver provides support for the Broadcom GENET v5 controller found
on the Raspberry Pi 4.
.Pp
The
.Nm
driver supports several media types, which are selected via the
.Xr ifconfig 8
command.
The supported media types are:
.Bl -tag -width "media" -offset indent
.It Cm media No autoselect
Attempt to autoselect the media type (default)
.It Cm media No 1000baseT Cm mediaopt No full-duplex
Use 1000baseT on copper, full duplex
.It Cm media No 1000baseT Cm mediaopt No half-duplex
Use 1000baseT on copper, half duplex
.It Cm media No 100baseTX Cm mediaopt No full-duplex
Use 100baseTX, full duplex
.It Cm media No 100baseTX Cm mediaopt No half-duplex
Use 100baseTX, half duplex
.It Cm media No 10baseT Cm mediaopt No full-duplex
Use 10baseT, full duplex
.It Cm media No 10baseT Cm mediaopt No half-duplex
Use 10baseT, half duplex
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr brgphy 4 ,
.Xr ifmedia 4 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8 ,
.Xr rnd 9
.Sh HISTORY
The
.Nm
driver
first appeared in
.Nx 10 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jared D. McNeill Aq Mt jmcneill@NetBSD.org .
