NetBSD/src/share/man/man4/gsip.4
.\"	$NetBSD: gsip.4,v 1.2 2001/05/22 14:39:02 thorpej Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 17, 2001
.Dt GSIP 4
.Os
.Sh NAME
.Nm gsip
.Nd National Semiconductor DP83820 Gigabit Ethernet driver
.Sh SYNOPSIS
.Cd "gsip* at pci? dev ? function ?"
.Pp
Configuration of PHYs may also be necessary.  See
.Xr mii 4 .
.Sh DESCRIPTION
The
.Nm
device driver supports Gigabit Ethernet interfaces based on the
National Semiconductor DP83820 Gigabit Ethernet chips.
.Pp
The National Semiconductor DP83820 is found on NetGear GA-622,
Asante FriendlyNet GigaNIX, D-Link DGE-500T, and other low-cost
Gigabit Ethernet cards.  It uses an external PHY or an external
10-bit interface.
.Pp
The DP83820 supports VLAN tag insertion/removal in hardware.  The
.Nm
driver supports this feature of the chip.
.Pp
The DP83820 chip is a close relative of the DP83815 10/100 Ethernet
chip, which is supported by the
.Xr sip 4
driver, hence the
.Nm
name.
.\" .Sh DIAGNOSTICS
.\" XXX too be done.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig 8 ,
.Xr vlan 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.6 .
.Sh BUGS
The
.Nm
driver does not support the IPv4/TCP/UDP checksumming features
of the DP83820 chip.
.Pp
The
.Nm
driver does not support transmission or reception of jumbo Ethernet
frames.
.Pp
The
.Nm
driver does not support the 10-bit interface, which is required in
order to support fiber-optic media.
.Sh AUTHOR
The
.Nm
driver was written by
.An Jason R. Thorpe
.Aq thorpej@netbsd.org .
