NetBSD/src/share/man/man4/gtp.4
.\"	$NetBSD: gtp.4,v 1.2.18.1 2013/07/23 21:07:32 riastradh Exp $
.\"	$OpenBSD: gtp.4,v 1.9 2007/05/31 19:19:50 jmc Exp $
.\"
.\" Copyright (c) 2002 Vladimir Popov <jumbo@narod.ru>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF
.\" USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
.\" ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" .Dd $Mdocdate$
.Dd March 26, 2011
.Dt GTP 4
.Os
.Sh NAME
.Nm gtp
.Nd Gemtek PCI FM radio device
.Sh SYNOPSIS
.Cd "gtp*   at pci? flags 0x00"
.Cd "radio* at gtp?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Gemtek PCI and Guillemot MaxiRadio FM2000
FM radio tuners.
.Pp
The Gemtek PCI cards are stereo FM tuners that can tune in the range
87.5 \- 108.0 MHz, report signal status and stereo/mono on the current
frequency, force audio output to mono, perform hardware signal search,
and have an internal AFC.
.Pp
The card is based on the TEA5757 chip; see
.Xr radio 4
for details.
.Pp
The flags control the driver behavior.
For example, with flags 0x01 the driver
will assume that a TEA5759 chip is used.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr radio 4 ,
.Xr radio 9
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 3.2
and subsequently in
.Nx 1.6
wherein it replaced the
.Xr mr 4
driver.
.Sh AUTHORS
The
.Nm
driver and the man page was written by
.An Vladimir Popov Aq Mt jumbo@narod.ru .
.Sh BUGS
It is impossible to determine which frequency the card is tuned to.
Thus, the driver will report an internally stored value even if it is not
correct (changed by some program that uses direct port access).
