NetBSD/src/share/man/man4/hpacel.4
.\" $NetBSD: hpacel.4,v 1.3 2011/08/09 07:24:49 jruoho Exp $
.\"
.\" Copyright (c) 2011 Jukka Ruohonen <jruohonen@iki.fi>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 9, 2011
.Dt HPACEL 4
.Os
.Sh NAME
.Nm hpacel
.Nd HP 3D DriveGuard accelerometer
.Sh SYNOPSIS
.Cd "hpacel* at acpi?"
.Sh DESCRIPTION
The
.Nm
device driver supports accelerometers that are
commonly available in Hewlett-Packard laptops.
The supported chip is
.Dv LIS3LV02DL
from STMicroelectronics, although other chips from the same family, such as
.Dv LIS3LV02DQ ,
may also work, provided that that the vendor has implemented suitable
.Dv ACPI
access methods.
.Pp
The
.Nm
driver reports the acceleration readings of the X-, Y-, and Z-axis
via the
.Xr envsys 4
.Tn API
and the
.Xr envstat 8
command.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr aps 4 ,
.Xr hpqlb 4 ,
.Xr wmihp 4
.Rs
.%A STMicroelectronics
.%T "LIS3LV02DL: 3-Axis - \*(Pm\* 2g/\*(Pm\* 6g digital output \
low voltage linear accelerometer. AN2381 Application Note"
.%N Revision 1
.%D June, 2006
.%U http://www.st.com/stonline/products/literature/anp/12441.pdf
.Re
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 6.0 .
.Sh AUTHORS
.An Jukka Ruohonen
.Aq jruohonen@iki.fi
.Sh BUGS
The used accelerometer chip is capable of generating wake-up,
direction detection, and free-fall interrupts.
In the ideal situation these could be used to evoke possible emergency action.
However, the
.Nm
driver only reports the readings from the accelerometer via
.Xr sysmon_envsys 9 .
