NetBSD/src/share/man/man4/hvn.4
.\"	$NetBSD: hvn.4,v 1.2 2021/10/12 07:43:41 wiz Exp $
.\"
.\"	$OpenBSD: hvn.4,v 1.5 2016/10/07 14:42:27 jmc Exp $
.\"
.\" Copyright (c) 2016 Mike Belopuhov
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd October 12, 2021
.Dt HVN 4
.Os
.Sh NAME
.Nm hvn
.Nd Hyper-V networking interface
.Sh SYNOPSIS
.Cd "hvn* at vmbus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for a Network Virtual Service Client (NetVSC),
a virtual networking interface that relays device requests to the Virtual
Service Provider (VSP) in the management operating system via the VMBus.
.Pp
NetVSC emulates an RNDIS 1.0 compliant device on top of a custom NVS
protocol operating over the VMBus channel ring.
.Pp
Individual networking interfaces can be renamed by issuing a
.Cm Rename-VMNetworkAdapter
PowerShell command in the management domain.
In order to enable sending and receiving of IEEE 802.1q (VLAN) frames,
the virtual port needs to be put into
.Em Trunk
mode with the
.Cm Set-VMNetworkAdapterVlan
command.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr vlan 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.1
and appeared in
.Nx 8.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mike Belopuhov Aq Mt mikeb@openbsd.org
based on the
.Fx
driver by the Microsoft BSD Integration Services Team
.Aq Mt bsdic@microsoft.com
and ported to
.Nx
by
.An NONAKA Kimihiro .
