NetBSD/src/share/man/man4/igmafb.4
.\"	$NetBSD: igmafb.4,v 1.3 2014/09/19 13:34:25 wiz Exp $
.\"
.\" Copyright (c) 2014 Michael van Elst
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 21, 2014
.Dt IGMAFB 4
.Os
.Sh NAME
.Nm igmafb
.Nd Intel Graphics Media Accelerator framebuffer driver
.Sh SYNOPSIS
.Cd "options VGA_RASTERCONSOLE"
.Cd "no options VGA_POST"
.Cd "no agp"
.Cd "no device at drm"
.Cd "no genfb"
.Cd "igma0 at pci0 dev ? function ?"
.Cd "igmafb* at igma0"
.Cd "iic* at igma0"
.Sh DESCRIPTION
The
.Nm
driver provides support for integrated graphics functions in Intel chipsets
and provides an interface for the machine independent
.Xr wscons 4
driver.
.Pp
Currently
.Nm
configures the display for the integrated panel in notebooks
and can control the backlight.
Automatic detection of the main display on desktop machines may or
may not work.
.Pp
Supported hardware includes:
.Bl -bullet -compact
.It
GMA 900 (915G)
.It
GMA 950 (945G)
.It
GMA 3000 (Q965)
.It
GMA X3000 (G965)
.It
GMA X3500 (G35)
.It
GMA X4500 (G45)
.It
HD (Westmere)
.It
HD2000/3000 (Sandy Bridge)
.It
HD2500/4000 (Ivy Bridge)
.El
.Sh SEE ALSO
.Xr genfb 4 ,
.Xr wsdisplay 4
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Michael van Elst .
.Sh BUGS
The driver conflicts with
.Xr genfb 4 ,
.Xr agp 4 ,
and thus with
.Xr drm 4 .
Support for a hardware cursor is missing.
