NetBSD/src/share/man/man4/igpio.4
.\" $NetBSD: igpio.4,v 1.2.2.2 2023/03/12 17:52:13 martin Exp $
.\"
.\" Copyright (c) 2022 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Emmanuel Dreyfus.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 27, 2023
.Dt IGPIO 4
.Os
.Sh NAME
.Nm igpio
.Nd Intel GPIO Controller
.Sh SYNOPSIS
.Cd "igpio* at acpi?"
.Cd "gpio* at gpiobus?"
.Sh DESCRIPTION
.Nm
provides a
.Xr gpio 4
interface for the following Intel chipsets:
.Bl -tag -width autoselect -compact
.It Alder Lake-N
.It Alder Lake-P
.It Alder Lake-S
.It Cannon Lake-H
.It Cannon Lake-LP
.It Cedarfork
.It Coffee Lake-S
.It Denverton
.It Emmitsburg
.It Gemini Lake
.It Ice Lake-LP
.It Ice Lake-N
.It Jasper Lake
.It Lakefield
.It Lewisburg
.It Raptor Lake-S
.It Sunrisepoint-H
.It Sunrisepoint-LP
.It Tiger Lake-H
.It Tiger Lake-LP
.El
Support for Baytrail, Broxton, Cherryview and Lynxpoint are not enabled yet.
.Pp
The driver supports
.Dv GPIO_PIN_INPUT ,
.Dv GPIO_PIN_OUTPUT ,
.Dv GPIO_PIN_INOUT ,
.Dv GPIO_PIN_ININ ,
.Dv GPIO_PIN_PULLUP ,
.Dv GPIO_PIN_PULLDOWN ,
and interrupt capabilies
.Dv GPIO_INTR_POS_EDGE ,
.Dv GPIO_INTR_NEG_EDGE ,
.Dv GPIO_INTR_DOUBLE_EDGE ,
.Dv GPIO_INTR_HIGH_LEVEL ,
.Dv GPIO_INTR_LOW_LEVEL .
.Sh SEE ALSO
.Xr gpio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 10.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver and man page was written by
.An Emmanuel Dreyfus
.Aq Mt manu@NetBSD.org .
