NetBSD/src/share/man/man4/igsfb.4
.\"	$NetBSD: igsfb.4,v 1.2 2003/06/01 01:14:30 uwe Exp $
.\"
.\" Copyright (c) 2003 Valeriy E. Ushakov
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 1, 2003
.Dt IGSFB 4
.Os
.Sh NAME
.Nm igsfb
.Nd IGA 1682 and CyberPro series graphics cards
.Sh SYNOPSIS
.Cd "igsfb* at pci?"
.Cd "wsdisplay* at igsfb?"
.Sh DESCRIPTION
The
.Nm
driver provides support for IGA 1682 and CyberPro series of graphics
cards by InteGraphics Systems, now Tvia.
The
.Nm
driver operates these cards in linear framebuffer mode, not in VGA
mode.
.Sh SEE ALSO
.Xr wscons 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.6 .
.Sh BUGS
There's currently no way to change resolution, frequency, etc.
The driver is hardcoded to init the card to 1024\[tmu]768, 8bpp at 60Hz.
