NetBSD/src/share/man/man4/isa.4
.\"	$NetBSD: isa.4,v 1.4 1997/04/09 05:13:44 mikel Exp $
.\"
.\" Copyright (c) 1997 Jonathan Stone
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Jonathan Stone
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 1997
.Dt ISA 4
.Os NetBSD
.Sh NAME
.Nm isa
.Nd introduction to ISA bus machine-independent drivers and support
.Sh SYNOPSIS
.Pp
Machine-dependent; depends on the bus topology and ISA-host adaptor
of your system.  Typical ISA buses are connected either directly to the
main system bus or via PCI-ISA bridges. See the
.Xr intro 4
documentation for your system for details.
.Sh INTRODUCTION
.Nx 1.2 
and later versions include machine-independent bus support and
drivers for the following ISA bus devices.
Not all supported ISA devices are listed below; consult the
.Xr intro 4
page for your machine for additional machine-dependent drivers.
Note that console support (CGA, EGA, VGA, or better) and
NS8250/16450/16550 serial drivers are currently machine-dependent and
documented elsewhere.
.Sh SUPPORTED DEVICES
.Nx
includes machine-independent ISA drivers, sorted by function
and driver name:
.Pp
.Ss Disk controllers
.Bl -tag -width speaker -offset indent -compact
.It aha
SCSI controllers including the Adaptec AHA-154x family (154xA, 154xB,
154xC, and 154xCF)
of SCSI adaptors, and the Buslogic BT-54x.
.It aic
SCSI controllers including Adaptec AIC-6260, Adaptec AIC-6360, Adaptec
152x, and SoundBlaster
SCSI boards, as well as others based on Adaptec AIC-6x60 chips.
.It bha
Buslogic BT-445, BT-74x, and BT-9[45][68] SCSI boards.
.It mcd
Mitsumi CD-ROM drives.
.It sea
Seagate/Future Domain SCSI cards.  ST01/02, Future Domain TMC-885, and
Future Domain TMC-950.
.It uha
Ultrastor ISA and EISA SCSI adapter cards.  Ultrastor 14f, Ultrastor 34f,
and Ultrastor 24f.
.It wd
Standard ISA Western Digital type hard drives.  MFM, RLL, ESDI, and IDE.
.It wds
WD7000 family of bus-mastering SCSI controllers.
.It wt
Wangtek and compatible QIC-02 and QIC-36 tape drives.
.El
.Pp
.Ss Serial and parallel interfaces
.Bl -tag -width speaker -offset indent -compact
.It ast
Multi-port serial communications card first made by AST. 
.It boca
Boca BB100[48] and BB2016 multiplexing serial communications cards.
.It lpt
Standard ISA parallel port interface.
.It cy
Cyclades Cyclom-4Y, -8Y, and -16Y asynchronous serial communications cards.
.It rtfps
RT four-port serial cards.
.El
.Pp
.Ss Network interfaces
.Bl -tag -width speaker -offset indent -compact
.It ed
Western Digital/SMC 80x3 and Ultra, 3Com 3c503, and Novell NE1000 and 2000
Ethernet interfaces.
.It eg
3Com 3c505 Ethernet board.
.It el
3Com 3c501 Ethernet interface.
.It ep
3Com 3c509 Etherlink-III Ethernet interface.
.It fe
Ethernet interfaces based on the Fujitsu MB86960A/MB86965A chipset,
including Fujitsu FMV-181, FMV-182, Allied Telesis AT1700 series,
and RE2000 series.
.\".It hp
.\" Broken driver for HP -relabelled Ethernet cards.
.It ie
Ethernet interfaces based on Intel 82586 Ethernet chip,
including AT&T Starlan-10, AT&T EN100, AT&T Starlan Fibre, and 3Com 3c507.
.It iy
Ethernet interfaces based on the Intel EtherExpress Pro/10 chip.
(Does not support PRO/100).
.It le
Ethernet interfaces based on the AMD LANCE chip,
including BICC Isolan, Novell NE2100, and Digital DEPCA.
.El
.Ss Sound cards
.Bl -tag -width speaker -offset indent -compact
.It gus
Gravis Ultrasound sound cards.
.It pas
ProAudio Spectrum sound cards.
.It pss
Personal Sound System-compatible sound cards, including
Cardinal Digital SoundPro 16 and Orchid Soundwave 32.
.It sb
Soundblaster, Soundblaster 16, and Soundblaster Pro sound cards.
.It wss
Windows Sound System-compatible sound cards based on the AD1848 and
compatible chips.
.El
.Pp
Note that some ISA devices also have newer ISA Plug-and-Play
or PCI variants.  These are listed in 
.Xr isapnp 4
and
.Xr pci 4 ,
respectively.  The manual pages for each individual driver also list
the supported variants on other buses.
.Sh SEE ALSO
.Xr aha 4 ,
.Xr aic 4 ,
.Xr ast 4 ,
.Xr bha 4 ,
.Xr cy 4 ,
.Xr gus 4 ,
.Xr ed 4 ,
.Xr el 4 ,
.Xr ep 4 ,
.Xr fe 4 ,
.Xr ie 4 ,
.Xr isapnp 4 ,
.Xr iy 4 ,
.Xr le 4 ,
.Xr lpt 4 ,
.Xr mcd 4 ,
.Xr pas 4 ,
.Xr pss 4 ,
.Xr rtfps 4 ,
.Xr sb 4 ,
.Xr sea 4 ,
.Xr uha 4 ,
.Xr wd 4 ,
.Xr wds 4 ,
.Xr wss 4 ,
.Xr wt 4
.Sh HISTORY
The
.Nm
introduction
appeared in
.Nx 1.2 .
