NetBSD/src/share/man/man4/isa.4
.\"	$NetBSD: isa.4,v 1.5.2.3 1997/11/11 05:49:15 thorpej Exp $
.\"
.\" Copyright (c) 1997 Jason R. Thorpe.  All rights reserved.
.\" Copyright (c) 1997 Jonathan Stone
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Jonathan Stone
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 1997
.Dt ISA 4
.Os NetBSD
.Sh NAME
.Nm isa
.Nd introduction to machine-independent ISA bus support and drivers
.Sh SYNOPSIS
.Pp
Attachmens are machine-dependent and depend on the bus topology and
ISA bus interface of your system.  See
.Xr intro 4
for your system for details.
.Sh INTRODUCTION
.Nx
includes a machine-independent ISA bus subsystem and several
machine-independent ISA device drivers.
.Pp
Your system may support additional ISA devices.  Drivers for ISA
device not listed here are machine-dependent.
Consult your system's
.Xr intro 4
for additional information.
.Sh SUPPORTED DEVICES
.Nx
includes machine-independent ISA drivers, sorted by device type
and driver name:
.Pp
.Ss Disk and tape controllers
.Bl -tag -width speaker -offset indent
.It aha
Adaptec AHA-154x family (154xA, 154xB, 154xC, and 154xCF) and the
BusLogic BT54x SCSI interfaces.
.It aic
Adaptec AIC-6260 and Adaptec AIC-6360 based SCSI interfaces, including
the Adaptec 152x, SoundBlaster SCSI interfaces, and a variety of compatibles.
.It bha
BusLogic BT-445 SCSI interfaces.
.It mcd
Mitsumi CD-ROM drives.
.It sea
Seagate/Future Domain SCSI cards.  ST01/02, Future Domain TMC-885, and
Future Domain TMC-950.
.It uha
Ultrastor 14f SCSI interfaces.
.It wdc
Standard Western Digital type hard drive controllers: MFM, RLL, ESDI,
and IDE/ATAPI.
.It wds
WD-7000 family of bus-mastering SCSI interfaces.
.It wt
Wangtek and compatible QIC-02 and QIC-36 tape drives.
.El
.Pp
.Ss Serial and parallel interfaces
.Bl -tag -width speaker -offset indent
.It ast
Multi-port serial communications card first made by AST. 
.It boca
Boca BB100[48] and BB2016 multiplexing serial communications cards.
.It cy
Cyclades Cyclom-4Y, -8Y, and -16Y asynchronous serial communications cards.
.It lpt
Standard ISA parallel port interface.
.It rtfps
IBM RT four-port serial cards.
.El
.Pp
.Ss Network interfaces
.Bl -tag -width speaker -offset indent
.It ec
3Com Etherlink II (3c503) Ethernet interfaces.
.It eg
3Com Etherlink Plus (3c505) Ethernet interfaces.
.It el
3Com Etherlink (3c501) Ethernet interfaces.
.It ep
3Com Etherlink III (3c509) Ethernet interfaces.
.It fe
Ethernet interfaces based on the Fujitsu MB86960A/MB86965A chipset,
including Fujitsu FMV-181, FMV-182, Allied Telesis AT1700 series,
and RE2000 series.
.\".It hp
.\" Broken driver for HP -relabelled Ethernet cards.
.It ie
Ethernet interfaces based on Intel 82586 Ethernet chip,
including AT&T Starlan-10, AT&T EN100, AT&T Starlan Fibre, and 3Com 3c507.
.It iy
Intel i82595-based Ethernet interfaces, including the EtherExpress Pro/10.
.It lc
DEC EtherWORKS III Ethernet interfaces (DE203, DE204, and DE205).
.It le
Ethernet interfaces based on the AMD LANCE chip,
including BICC Isolan, Novell NE2100, Digital DEPCA, and PCnet-ISA.
.It ne
Novel NE2000 and compatible Ethernet interfaces.
.It sm
SMC91C9x-based Ethernet interfaces.
.It we
Western Digital/SMC 80x3, SMC Elite Ultra, and SMC EtherEZ Ethernet
interfaces.
.El
.Ss Sound cards
.Bl -tag -width speaker -offset indent
.It gus
Gravis Ultrasound sound cards.
.It pas
ProAudio Spectrum sound cards.
.It pss
Personal Sound System-compatible sound cards, including
Cardinal Digital SoundPro 16 and Orchid Soundwave 32.
.It sb
Soundblaster, Soundblaster 16, and Soundblaster Pro sound cards.
.It wss
Windows Sound System-compatible sound cards based on the AD1848 and
compatible chips.
.El
.Pp
Note that some ISA devices also have newer ISA Plug-and-Play variants.
These are listed in 
.Xr isapnp 4 .
.Sh SEE ALSO
.Xr aha 4 ,
.Xr aic 4 ,
.Xr ast 4 ,
.Xr bha 4 ,
.Xr cy 4 ,
.Xr gus 4 ,
.Xr ec 4 ,
.Xr el 4 ,
.Xr ep 4 ,
.Xr fe 4 ,
.Xr ie 4 ,
.Xr isapnp 4 ,
.Xr iy 4 ,
.Xr lc 4 ,
.Xr le 4 ,
.Xr lpt 4 ,
.Xr mcd 4 ,
.Xr ne 4 ,
.Xr pas 4 ,
.Xr pss 4 ,
.Xr rtfps 4 ,
.Xr sb 4 ,
.Xr sea 4 ,
.Xr sm 4 ,
.Xr uha 4 ,
.Xr wd 4 ,
.Xr wds 4 ,
.Xr we 4 ,
.Xr wss 4 ,
.Xr wt 4
.Sh HISTORY
The machine-independent ISA subsystem appeared in
.Nx 1.2 .
