NetBSD/src/share/man/man4/isa.4
.\"	$NetBSD: isa.4,v 1.49 2021/03/11 18:16:50 nia Exp $
.\"
.\" Copyright (c) 1997 Jason R. Thorpe.  All rights reserved.
.\" Copyright (c) 1997 Jonathan Stone
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Jonathan Stone
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 25, 2019
.Dt ISA 4
.Os
.Sh NAME
.Nm isa
.Nd introduction to machine-independent ISA bus support and drivers
.Sh SYNOPSIS
Attachments are machine-dependent and depend on the bus topology and
.Tn ISA
bus interface of your system.
See
.Xr intro 4
for your system for details.
.Sh DESCRIPTION
.Nx
includes a machine-independent
.Tn ISA
bus subsystem and several machine-independent
.Tn ISA
device drivers.
.Pp
Your system may support additional
.Tn ISA
devices.
Drivers for
.Tn ISA
devices not listed here are machine-dependent.
Consult your system's
.Xr intro 4
for additional information.
.Sh SUPPORTED DEVICES
.Nx
includes machine-independent
.Tn ISA
drivers, sorted by device type and driver name:
.Ss SCSI interfaces
.Bl -tag -width pcdisplay -offset indent
.It Xr adv 4
Advansys
.Tn SCSI
interfaces.
.It Xr aha 4
Adaptec AHA-154x family (154xA, 154xB, 154xC, and 154xCF) and the
BusLogic BT54x
.Tn SCSI
interfaces.
.It Xr ahc 4
Adaptec 29xx, 39xx, and other AIC-7xxx-based
.Tn SCSI
interfaces.
.It Xr aic 4
Adaptec AIC-6260 and Adaptec AIC-6360 based
.Tn SCSI
interfaces, including
the Adaptec 152x, SoundBlaster
.Tn SCSI
interfaces, and a variety of compatibles.
.It Xr bha 4
BusLogic BT-445
.Tn SCSI
interfaces.
.It Xr dpt 4
DPT SmartCache/SmartRAID III and IV
.Tn SCSI
interfaces.
.It Xr esp 4
NCR 53C9x, Emulex ESP406, and Qlogic FAS408
.Tn SCSI
interfaces.
.It Xr nca 4
NCR-5380/NCR-53C400
.It Xr sea 4
Seagate/Future Domain
.Tn SCSI
cards.
ST01/02, Future Domain TMC-885, and Future Domain TMC-950.
.It Xr uha 4
Ultrastor 14f
.Tn SCSI
interfaces.
.It Xr wds 4
WD-7000 family of bus-mastering
.Tn SCSI
interfaces.
.El
.Ss Disk and tape controllers
.Bl -tag -width pcdisplay -offset indent
.It Xr mcd 4
Mitsumi CD-ROM drives.
.It Xr wdc 4
Standard Western Digital type hard drive controllers: MFM, RLL, ESDI,
and IDE/ATAPI.
.It Xr wt 4
Wangtek and compatible QIC-02 and QIC-36 tape drives.
.El
.Ss Serial and parallel interfaces
.Bl -tag -width pcdisplay -offset indent
.It Xr ast 4
Multi-port serial communications card first made by AST.
.It Xr boca 4
Boca BB100[48] and BB2016 multiplexing serial communications cards.
.It Xr com 4
NS8250-, NS16450-, and NS16550-based serial ports.
.It Xr cy 4
Cyclades Cyclom-4Y, -8Y, and -16Y asynchronous serial communications cards.
.It Xr ioat 4
.Tn BOCA Research
IOAT66
serial interfaces.
.It Xr lpt 4
Standard
.Tn ISA
parallel port interface.
.It Xr rtfps 4
IBM RT four-port serial interfaces.
.It Xr tcom 4
Byte Runner Technologies TC-400 and TC-800 series serial interfaces.
.El
.Ss Network interfaces
.Bl -tag -width pcdisplay -offset indent
.It Xr ai 4
.Tn AT&T
.Tn StarLan
.Tn Ethernet
interfaces.
.It Xr ate 4
Allied Telesis AT1700 series and RE2000 series
.Tn Ethernet
interfaces.
.It Xr cs 4
.Tn Cirrus Logic
Crystal CS8900
.Tn Ethernet
interfaces.
.It Xr ec 4
3Com EtherLink II (3c503)
.Tn Ethernet
interfaces.
.It Xr ef 4
.Tn 3Com
EtherLink II (3c507)
.Tn Ethernet
interfaces.
.It Xr eg 4
3Com EtherLink Plus (3c505)
.Tn Ethernet
interfaces.
.It Xr el 4
3Com EtherLink (3c501)
.Tn Ethernet
interfaces.
.It Xr ep 4
3Com EtherLink III (3c509)
.Tn Ethernet
interfaces.
.It Xr fmv 4
Fujitsu FMV-181 and FMV-182 interfaces.
.It Xr ix 4
Intel EtherExpress/16
.Tn Ethernet
interfaces.
.It Xr iy 4
Intel i82595-based
.Tn Ethernet
interfaces, including the EtherExpress Pro/10.
.It Xr lc 4
DEC EtherWORKS III
.Tn Ethernet
interfaces (DE203, DE204, and DE205).
.It Xr le 4
.Tn Ethernet
interfaces based on the AMD LANCE chip,
including BICC Isolan, Novell NE2100, Digital DEPCA, and PCnet-ISA.
.It Xr ne 4
Novel NE2000 and compatible
.Tn Ethernet
interfaces.
.It Xr ntwoc 4
SDL Communications Riscom/N2 synchronous serial interfaces.
.It Xr sm 4
SMC91C9x-based
.Tn Ethernet
interfaces.
.It Xr we 4
Western Digital/SMC 80x3, SMC Elite Ultra, and SMC EtherEZ
.Tn Ethernet
interfaces.
.El
.Ss Sound cards and MIDI interfaces
.Bl -tag -width pcdisplay -offset indent
.It Xr aria 4
Sierra's Aria based sound cards.
.It Xr cms 4
Creative Music System.
.It Xr ess 4
ESS Technology AudioDrive 1788-, 1888-, 1887-, and 888-based sound cards.
.It Xr gus 4
Gravis Ultrasound sound cards.
.It Xr mpu 4
Roland MPU401 (and compatible) MIDI UARTs.
.It Xr opl 4
Yamaha OPL2 and OPL3 FM MIDI synthesizers.
.It Xr pas 4
ProAudio Spectrum sound cards.
.It Xr sb 4
SoundBlaster, SoundBlaster 16, and SoundBlaster Pro sound cards.
.It Xr wss 4
Windows Sound System-compatible sound cards based on the AD1848 and
compatible chips.
.El
.Ss Miscellaneous devices
.Bl -tag -width pcdisplay -offset indent
.It Xr az 4
Aztech/PackardBell radio card.
.It Xr lm 4
National Semiconductor LM78, LM79 and compatible hardware monitors.
.It Xr nct 4
Nuvoton NCT5104D SuperIO.
.It Xr pcdisplay 4
PC display adapters.
.It Xr pcic 4
.Tn PCI
.Tn PCMCIA
controllers, including the Cirrus Logic GD6729.
.It Xr pckbc 4
PC keyboard controllers.
.It Xr pcppi 4
PC control and timer ports.
.It Xr pms 4
PS/2 auxiliary port mice (including wheel mice).
.It Xr rt 4
AIMS Lab Radiotrack FM radio.
.It Xr rtii 4
AIMS Lab Radiotrack II FM radio.
.It Xr sf2r 4
SoundForte RadioLink SF16-FMR2 FM radio.
.It Xr tcic 4
Databook DB86082, DB86084, DB86184, and DB86072
.Tn PCMCIA
controllers.
.It Xr vga 4
VGA graphics boards.
.It Xr wbsio 4
Winbond LPC Super I/O.
.El
.Pp
Note that some
.Tn ISA
devices also have newer
.Tn ISA
Plug-and-Play variants.
These are listed in
.Xr isapnp 4 .
.Sh DIAGNOSTICS
.Bl -diag
.It "Stray interrupt on IRQ 7"
It means the interrupt controller reported an unmasked interrupt on IRQ
7, but no driver attached to that IRQ `claimed' it.
.Pp
There are two reasons this can happen:
.Bl -bullet
.It
In anything other than i386, it would almost always mean that there is a
driver attached to the IRQ, but it is the wrong driver.
.It
On i386, there is the more obscure issue of `default IRQ7's.
That is, when a device asserts an IRQ, but the IRQ is deasserted
after the PIC latches the interrupt and before the CPU acknowledges
it, the PIC just flat out lies about which IRQ it was.
It is usually due to a suboptimally coded driver.
.El
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isapnp 4 ,
.Xr isa 9
.Sh HISTORY
The machine-independent
.Tn ISA
subsystem appeared in
.Nx 1.2 .
