NetBSD/src/share/man/man4/ixg.4
.\" $NetBSD: ixg.4,v 1.12.4.1 2021/03/11 16:00:24 martin Exp $
.\"
.\" Copyright (c) 2001-2008, Intel Corporation
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright notice,
.\"    this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" 3. Neither the name of the Intel Corporation nor the names of its
.\"    contributors may be used to endorse or promote products derived from
.\"    this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
.\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
.\" LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" * Other names and brands may be claimed as the property of others.
.\"
.\" $FreeBSD: src/share/man/man4/ixgbe.4,v 1.3 2010/12/19 23:54:31 yongari Exp $
.\"
.Dd March 9, 2021
.Dt IXG 4
.Os
.Sh NAME
.Nm ixg
.Nd Intel(R) 10Gb Ethernet driver
.Sh SYNOPSIS
.Cd "ixg* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for PCI 10Gb Ethernet adapters based on
the Intel(R) 82598EB, 82599, X540 and X550 Ethernet Controllers.
The driver supports Jumbo Frames, TCP Segmentation Offload (TSO).
.Pp
For questions related to hardware requirements,
refer to the documentation supplied with your Intel 10GbE adapter.
All hardware requirements listed apply to use with
.Nx .
.Pp
Support for Jumbo Frames is provided via the interface MTU setting.
Selecting an MTU larger than 1500 bytes with the
.Xr ifconfig 8
utility configures the adapter to receive and transmit Jumbo Frames.
On
.Nx ,
the maximum MTU size for Jumbo Frames is 9000 bytes.
.Pp
This driver version supports VLANs.
For information on enabling VLANs, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
.Bl -diag
.It "ixg%d: Unable to allocate bus resource: memory"
A fatal initialization error has occurred.
.It "ixg%d: Unable to allocate bus resource: interrupt"
A fatal initialization error has occurred.
.It "ixg%d: watchdog timeout -- resetting"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.El
.Sh SUPPORT
For general information and support,
go to the Intel support website at:
.Lk http://www.intel.com/support/ .
.\" .Pp
.\" If an issue is identified with the released source code on the supported kernel
.\" with a supported adapter, email the specific information related to the
.\" issue to
.\" .Aq freebsdnic@mailbox.intel.com .
.Sh OPTIONS
The
.Nm
driver doesn't use the common
.Xr MCLGET 9
interface and use the driver specific cluster allocation mechanism.
If it's exhausted, the
.Xr evcnt 9
counter "ixgX qY Rx no jumbo mbuf" is incremented.
If this is observed,
the number can be changed by the following config parameter:
.Bl -tag -width IXGBE_JCLNUM_MULTI -offset 3n
.It Dv IXGBE_JCLNUM_MULTI
The number of RX jumbo buffers (clusters) per queue is calculated by
.Dv IXGBE_JCLNUM_MULTI
* (number of rx descriptors).
The total number of clusters per queue is available via the
.Li hw.ixgN.num_jcl_per_queue
.Xr sysctl 7 .
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ixv 4 ,
.Xr netintro 4 ,
.Xr vlan 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver comes from
.Fx ,
where it is called
.Nm ixgbe .
It first appeared in
.Nx 6.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Intel Corporation Aq Mt freebsdnic@mailbox.intel.com .
It was imported from
.Fx
into
.Nx
by
.An David Young Aq Mt dyoung@NetBSD.org .
.Sh BUGS
The hardware supports a maximum MTU of 16114 bytes, but the
.Nx
port of the driver supports only 9000 bytes.
