NetBSD/src/share/man/man4/ixl.4
.\"	$NetBSD: ixl.4,v 1.4 2020/11/04 15:24:56 kim Exp $
.\"
.\" Copyright (c) 2019 Internet Initiative Japan, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 10, 2019
.Dt IXL 4
.Os
.Sh NAME
.Nm ixl
.Nd Intel Ethernet 700 Series driver
.Sh SYNOPSIS
.Cd "ixl* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports Intel Ethernet 700 series controllers based on the
Intel X710, XXV710, XL710, and X722 Ethernet chipsets.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver comes from
.Ox .
It first appeared in
.Nx 10.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An David Gwynne Aq Mt dlg@openbsd.org
and
.An Jonathan Matthew Aq Mt jmatthew@openbsd.org .
It was imported from
.Ox
into
.Nx
by
.An Shoichi Yamaguchi Aq Mt yamaguchi@NetBSD.org .
.Sh BUGS
The VLAN hardware filter doesn't work while the interface is in
promiscuous mode.
If registering a VLAN tag fails due to lack of resources, the
interface doesn't send and receive packets containing the tag.
