NetBSD/src/share/man/man4/jmphy.4
.\"	$NetBSD: jmphy.4,v 1.2 2019/11/02 16:34:49 wiz Exp $
.\"	$openbsd: jmphy.4,v 1.2 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2008 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd October 30, 2019
.Dt JMPHY 4
.Os
.Sh NAME
.Nm jmphy
.Nd JMicron JMP202/JMP211 10/100/Gigabit Ethernet PHY
.Sh SYNOPSIS
.Cd "jmphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver supports the JMicron JMP202 10/100 and
JMP211 10/100/Gigabit Ethernet PHYs.
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr jme 4 ,
.Xr mii 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.5
and
.Nx 9.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Pyun YongHyeon
for
.Fx
and ported to
.Ox
by
.An Jonathan Gray Aq Mt jsg@openbsd.org
and then ported to
.Nx
by
.An Masanobu SAITOH .
.Sh BUGS
It the media is set to gigabit speed, it may not link up or take a very long time
to set the link up.
It depends on the link partner.
