NetBSD/src/share/man/man4/kse.4
.\"	$NetBSD: kse.4,v 1.6 2007/10/19 05:11:07 nisimura Exp $
.\"
.\" Copyright (c) 2006 Tohru Nishimura.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Tohru Nishimura.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 6, 2006
.Dt KSE 4
.Os
.Sh NAME
.Nm kse
.Nd Micrel 8842/8841 PCI Ethernet controller driver
.Sh SYNOPSIS
.Cd "kse* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports Ethernet interfaces based on the Micrel 8842/8841
PCI Ethernet chips.  The 8842 has 2 Ethernet ports which behave as
a managed switch to bridge each other.  It works like a T-shape
connector of Ethernet data flow in which an Ethernet controller
sits at the leg of the T.  Frames can flow between the two ports
while traffic destined for the 8842 reaches the EMAC. The 8841 is
a plain 10/100 Ethernet.
The
.Nm
driver distinguishs and handles them according to the HW model.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig 8
.Sh AUTHORS
The
.Nm
driver was written by
.An Tohru Nishimura .
.Sh BUGS
__STRICT_ALIGNMENT case is not written.  8842 media selection
keeps "auto" and indicates "up 100baseTX-FX flow" when either of
two ports is found link-up.  There is no functional provision to
see and control the media selection of them this moment.  Advanced
features like flow volume bound, VLAN tag insertion/removal, QoS
DiffServ are not implemented and remain uncontrollable by the
.Nm
driver.
UDP4CSUM is not very useful since the HW has an implementation
error for the case when a large UDP datagram is fragmented into
MTU sized frames.
