NetBSD/src/share/man/man4/lc.4
.\"	$NetBSD: lc.4,v 1.3.6.1 1999/12/27 18:30:43 wrstuden Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe of the Numerical Aerospace Simulation Facility,
.\" NASA Ames Research Center.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 10, 1997
.Dt LC 4
.Os
.Sh NAME
.Nm lc
.Nd DEC EtherWORKS III Ethernet interfaces device driver
.Sh SYNOPSIS
.Cd "lc0 at isa? port ? iomem ? irq ?"
.Sh DESCRIPTION
The
.Nm
device driver supports DEC EtherWORKS III Ethernet interfaces, which
are based on the LEMAC Ethernet chip.  This includes the DE203, DE204,
and DE205.
.Sh MEDIA SELECTION
The EtherWORKS III series supports various combinations of media, depending
on model.  Some models also support media autoselect.  Media is selected
with 
.Xr ifconfig 8 's
.Sq media
directive.
.\" .Sh DIAGNOSTICS
.Sh BUGS
The
.Nm
does not currently support EISA LEMAC interfaces.
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr ifconfig 8 ,
.Xr intro 4 ,
.Xr isa 4
