NetBSD/src/share/man/man4/lmc.4
.\" $NetBSD: lmc.4,v 1.1 2000/02/11 12:38:24 fair Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 4, 1999
.Dt LMC 4
.Os
.Sh NAME
.Nm lmc
.Nd LAN Media Corp PCI WAN adapter driver
.Sh SYNOPSIS
.Cd "lmc* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports Lan Media Corp Wide Area Network
.Pq Tn WAN
adapters based on the
.Tn DEC
.Tn DECchip
21140A
.Tn PCI
Fast
.Tn Ethernet
controller.
Supported boards include:
.Pp
.Bl -tag -width xxxx -offset indent
.It LMC1000
Synchronous Serial Interface adapter
.It LMC1200
T1/E1
.Tn WAN
adapter
.It LMC5200
High Speed Synchronous Interface
.Pq Tn HSSI
adapter
.It LMC5245
DS3
.Tn WAN
adapter
.El
.Sh SEE ALSO
.Xr lmcctl 8 ,
.Xr ifconfig 8 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr pci 4 .
.Pp
.Pa http://www.lanmedia.com/
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.4 .
