NetBSD/src/share/man/man4/lmenv.4
.\"	$NetBSD: lmenv.4,v 1.1.8.2 2014/08/20 00:02:35 tls Exp $
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Julian Coleman.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 14, 2013
.Dt LMENV 4
.Os
.Sh NAME
.Nm lmenv
.Nd National Semiconductor LM81, LM87, and compatible hardware monitors
.Sh SYNOPSIS
.Cd "lmenv0 at iic0 addr 0x2c: ADM9240 rev 2"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn National Semiconductor
LM87,
.Tn National Semiconductor
LM81,
.Tn Analog Devices
ADM9240, and
.Tn Dallas Semiconductor
DS1780 iicbus hardware monitors.
Sensor values are reported through the
.Xr envstat 8
interface.
.Pp
The
.Nm
supports the following voltage, temperature, and fan speed sensors:
.Bl -column "+5Vin/Vcc" "Temperature" -offset indent
.It Sy "Sensor" Ta "Type"
.It Li "+2.5Vin" Ta "Volts DC"
.It Li "Vccp1" Ta "Volts DC"
.It Li "+Vcc" Ta "Volts DC"
.It Li "+5Vin/Vcc" Ta "Volts DC"
.It Li "+12Vin" Ta "Volts DC"
.It Li "Vccp2" Ta "Volts DC"
.It Li "External" Ta "Temperature"
.It Li "Internal" Ta "Temperature"
.It Li "FAN1" Ta "Speed"
.It Li "FAN2" Ta "Speed"
.El
On the LM87 monitor, AIN1 and AIN2 Volts DC sensors may replace either,
or both of the FAN1 and FAN2 speed sensors, respectively.
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 3.9 .
.Nx
support was added in
.Nx 7.0 .
.Sh AUTHORS
The
.Nm
driver was written for
.Ox
by
.An Mark Kettenis
.Aq kettenis@openbsd.org ,
and ported to
.Nx
by
.An Julian Coleman
.Aq jdc@NetBSD.org .
.Sh BUGS
High and low sensor limits are not supported.
.Pp
Interrupt support is not implemented.
