NetBSD/src/share/man/man4/lmtemp.4
.\"	$NetBSD: lmtemp.4,v 1.4 2016/01/03 17:28:46 jdc Exp $
.\"
.\" Copyright (c) 2005 KIYOHARA Takashi
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 1, 2016
.Dt LMTEMP 4
.Os
.Sh NAME
.Nm lmtemp
.Nd National Semiconductor LM75, LM77 and compatible hardware monitors
.Sh SYNOPSIS
.Cd "lmtemp0 at iic? addr 0x48 flags 0x0000"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn National Semiconductor
LM on iicbus series temperature sensors and register compatible chips.
.Pp
Each device is specified by the value of the address and flags.
.Bl -column "Device" "0x48 - 0x4f" "flags" -offset indent
.It Sy "Device" Ta Sy "addr" Ta Sy "flags"
.It Li "LM75" Ta "0x48 - 0x4f" Ta "0x0000"
.It Li "LM75A" Ta "0x48 - 0x4f" Ta "0x0000"
.It Li "DS75" Ta "0x48 - 0x4f" Ta "0x0001"
.It Li "LM77" Ta "0x48 - 0x4b" Ta "0x0002"
.El
.Sh HARDWARE
Chips supported by the
.Nm
driver include:
.Bl -column "National Semiconductor LM75" "-55 \(en +125" "Resolution" \
-offset indent
.It Sy "Device" Ta Sy "Range" Ta Sy "Resolution"
.It Li "National Semiconductor LM75" Ta "-55 \(en +125" Ta "0.5 degC"
.It Li "Texas Instruments LM75A" Ta "-55 \(en +125" Ta "0.5 degC"
.It Li "Dallas Semiconductor DS75" Ta "-55 \(en +125" Ta "0.0625 degC"
.It Li "National Semiconductor LM77" Ta "-55 \(en +130" Ta "0.5 degC"
.El
.Pp
The LM75, LM75A, and DS75 have a programmable high temperature limit.
When this is exceeded, the device asserts an over-temperature output.
.Pp
The LM77 has programmable low and high temperature limits.
Exceeding either of these causes the device to assert an interrupt output.
It also has a programmable critical high temperature limit, and
exceeding this causes the device to assert a separate critical alarm
output.
.Pp
The sensor and limit values are made available through the
.Xr envstat 8
interface.
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
device appeared in
.Nx 4.0 .
.Sh BUGS
Interrupt support is unimplemented.
