NetBSD/src/share/man/man4/machfb.4
.\"	$NetBSD: machfb.4,v 1.2 2025/04/15 10:10:36 nia Exp $
.\"
.\" Copyright (c) 2025 The NetBSD Foundation
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 14, 2025
.Dt MACHFB 4
.Os
.Sh NAME
.Nm machfb
.Nd ATI Mach64/RAGE framebuffer driver
.Sh SYNOPSIS
.Cd "machfb* at pci?"
.Cd "wsdisplay* at machfb?"
.Sh DESCRIPTION
The
.Nm
driver provides support for ATI RAGE and Mach64 graphics accelerators.
2D acceleration is supported via the
.Xr rasops 9
framework.
.Pp
.Nm
is primarily used on PowerPC and SPARC64, but works on other architectures.
By default, on other architectures,
.Xr vga 4
or
.Xr genfb 4
will be used instead.
.Sh HARDWARE
The following chipsets should work:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It ATI RAGE II
.It ATI RAGE IIc
.It ATI RAGE Pro
.It ATI RAGE LT
.It ATI RAGE LT Pro
.It ATI RAGE XL
.It ATI Mach64 GX
.It ATI Mach64 CX
.It ATI Mach64 CT
.It ATI Mach64 VT
.El
.Sh SEE ALSO
.Xr ati 4 ,
.Xr mach64drm 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 2.0 .
