NetBSD/src/share/man/man4/mca.4
.\" $NetBSD: mca.4,v 1.10 2001/04/20 16:08:46 jdolecek Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 28, 2000
.Dt MCA 4
.Os
.Sh NAME
.Nm mca
.Nd introduction to machine-independent MCA bus support and drivers
.Sh SYNOPSIS
.Cd "mca0 at mainbus?"
.Pp
Machine-dependant; depends on the bus topology and
.Tn MCA
bus interface of your system. Typical
.Tn MCA
buses are connected directly to the main system bus.
.Sh INTRODUCTION
.Nx
includes a machine-independent
.Tn MCA
bus subsystem and several machine-independent
.Tn MCA
device drivers.
.Pp
.Sh SUPPORTED DEVICES
.Nx
includes machine-independent
.Tn MCA
drivers, sorted by device type and driver name:
.Pp
.\"
.Ss SCSI controllers
.Bl -tag -width speaker -offset indent
.It aha
Adaptec AHA-1640
.Tn SCSI
interface.
.El
.\"
.Ss Disk and tape controllers
.Bl -tag -width speaker -offset indent
.It edc
IBM ESDI Fixed Disk Controller
.El
.\"
.Ss Serial interfaces
.Bl -tag -width speaker -offset indent
.It com
NS8250-, NS16450-, and NS16550-based serial cards.
.El
.\"
.Ss Network interfaces
.Bl -tag -width speaker -offset indent
.It tr
TROPIC based token ring interfaces
.It ate
Allied-Telesis 1720 ethernet interface cards
.Pq Em recommended
.It we
WD/SMC WD80x3x ethernet interface cards and clones
.Pq Em recommended
.It elmc
3Com EtherLink/MC (3c523) ethernet interface
.It ep
3Com EtherLink III 3c529 ethernet interface
.El
.\"
.Sh SEE ALSO
.Xr aha 4 ,
.Xr ate 4 ,
.Xr com 4 ,
.Xr edc 4 ,
.Xr elmc 4 ,
.Xr ep 4 ,
.Xr tr 4 ,
.Xr we 4
.\"
.Sh HISTORY
The machine-independent
.Tn MCA
subsystem appeared in
.Nx 1.5 .
