NetBSD/src/share/man/man4/mcd.4
.\"	$NetBSD: mcd.4,v 1.8 2001/09/11 22:52:53 wiz Exp $
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd November 29, 1994
.Dt MCD 4
.Os
.Sh NAME
.Nm mcd
.Nd Mitsumi CD-ROM driver
.Sh SYNOPSIS
.Cd "mcd0 at isa? port 0x300 irq 10"
.Cd "options MCD_PROMISC"
.Sh DESCRIPTION
The
.Nm
driver provides support for
.Tn Mitsumi
.Tn CD-ROM
controller and drive on the
.Xr isa 4
bus.
.Pp
.Sh FILES
.Bl -tag -width /dev/rmcd[0-9][a-h] -compact
.It Pa /dev/cd[0-9][a-h]
block mode Mitsumi
.Tn CD-ROM
devices
.It Pa /dev/rmcd[0-9][a-h]
raw mode Mitsumi
.Tn CD-ROM
devices
.El
.Sh BUGS
The
.Nm
hardware is  difficult to probe accurately.
Historically, the
.Nm
probe would accept any return values as indicating that an
.Nm
drive was present.  Other devices, particularly
.Xr ne 4
or
.Xr we 4 ,
would then be incorrectly claimed by the
.Nm
driver.  The driver now only accepts result codes known to indicate
Mitsumi-compatible CD controllers, but may reject some
.Nm
hardware which  returns other result codes.
.Pp
.Cd "options MCD_PROMISC"
enables the  original promiscuous probe behaviour. Use with extreme caution.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr isa 4 ,
.Xr ne 4 ,
.Xr we 4
