NetBSD/src/share/man/man4/mcp23s17gpio.4
.\"	$NetBSD: mcp23s17gpio.4,v 1.1 2014/04/06 17:59:39 kardel Exp $
.\"
.\"Copyright (c) 2014 Frank Kardel
.\"All rights reserved.
.\"
.\"Redistribution and use in source and binary forms, with or without
.\"modification, are permitted provided that the following conditions
.\"are met:
.\"1. Redistributions of source code must retain the above copyright
.\"   notice, this list of conditions and the following disclaimer.
.\"2. Redistributions in binary form must reproduce the above copyright
.\"   notice, this list of conditions and the following disclaimer in the
.\"   documentation and/or other materials provided with the distribution.
.\"
.\"THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\"``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\"TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\"PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\"BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\"CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\"SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\"INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\"CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\"ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\"POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 6th, 2014
.Dt MCP23S17GPIO 4
.Os
.Sh NAME
.Nm mcp23s17gpio
.Nd Driver for MCP23S17 gpio chip via SPI bus
.Sh SYNOPSIS
.Cd "mcp23s17gpio0 at spi? slave 0 flags 0"
.Cd "mcp23s17gpio1 at spi? slave 0 flags 1"
.Cd "mcp23s17gpio2 at spi? slave 0 flags 2"
.Cd "mcp23s17gpio3 at spi? slave 0 flags 3"
.Cd "gpio* at gpiobus?"
.Sh DESCRIPTION
The
.Nm
driver supports up to 8 instances of the MCP23S17 16-bit GPIO chips. Access to
the pins is provided by the
.Xr gpio 4
interface. The
.Nm flags argument selects the hardware address of the chip instance.
.Sh SEE ALSO
.Xr spi 4 ,
.Xr intro 4 ,
.Xr gpio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Frank Kardel Aq Mt kardel@netbsd.org .
