NetBSD/src/share/man/man4/mcp980x.4
.\" $NetBSD: mcp980x.4,v 1.1.2.3 2014/08/20 00:02:35 tls Exp $
.\"
.\" Copyright (c) 2013 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 15, 2013
.Dt MCP980X 4
.Os
.Sh NAME
.Nm mcp980x
.Nd Microchip 9800/1/2/3 I2C temperature sensor driver
.Sh SYNOPSIS
.Cd "mcp980x* at iic? addr 0x48"
.Sh DESCRIPTION
The
.Nm
driver provides support for the MCP980x series of temperature sensors.
It allows reporting ambient temperature through the
.Xr envsys 4
API.
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 3
variable are provided:
.Bl -tag -width machdep.mcp980x0.hysteresis
.It Va machdep.mcp980x0.res
ADC resolution (integer).
Valid values are 0-3, where 0 is 9-bit (0.5 Celsius degree) and 3 is 12-bit
(0.0625 Celsius degree) resolution.
.It Va machdep.mcp980x0.templimit
If the ambient temperature exceeds this limit, the chip asserts an alert line
(integer).
.It Va machdep.mcp980x0.hysteresis
Hysteresis for temperature limit (integer).
.El
.Sh SEE ALSO
.Xr envsys 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq Mt radoslaw.kujawa@gmail.com .
.Sh CAVEATS
MCP9805 chip is different and is supported by the
.Xr sdtemp 4
driver.
.Pp
The MCP980x chip supports hysteresis and temperature limit values with a
resolution of 0.5 Celsius degree, however the
.Nm
driver supports setting only integer values.
