NetBSD/src/share/man/man4/md.4
.\"   $NetBSD: md.4,v 1.1 1997/04/11 05:26:27 mikel Exp $
.\"
.\" This file is in the public domain.
.\"
.Dd April 11, 1997
.Dt MD 4
.Os NetBSD
.Sh NAME
.Nm md
.Nd memory disk driver
.Sh SYNOPSIS
.Cd "pseudo-device md"
.Sh DESCRIPTION
The
.Nm
driver enables use of system or user memory as a disk.
Memory for the disk must be allocated within the kernel or with
.Xr mdconfig 8
before the
.Nm
device may be used as a disk.
.Sh FILES
.Bl -tag -width /dev/rmdX -compact
.It Pa "/dev/md??"
block mode memory disk devices.
.It Pa "/dev/rmd??"
raw mode memory disk devices.
.El
.Sh SEE ALSO
.Xr mdconfig 8 ,
.Xr mdsetimage 8
