NetBSD/src/share/man/man4/micphy.4
.\"	$NetBSD: micphy.4,v 1.2.4.2 2014/05/22 11:37:50 yamt Exp $
.\"
.\" Copyright (c) 2014 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd March 3, 2014
.Dt MICPHY 4
.Os
.Sh NAME
.Nm micphy
.Nd Micrel KSZ9021 10/100/1000 PHY driver
.Sh SYNOPSIS
.Cd "micphy* at mii? phy ?"
.Sh DESCRIPTION
The
.Nm
driver currently supports only Micrel KSZ9021RN PHY.
The driver has a fixup for
.Xr evbarm/cpsw 4
which requires Gig-E PHYs to adjust RGMII signal timing.
.Sh SEE ALSO
.Xr evbarm/cpsw 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr mii 4 ,
.Xr ifconfig 8
