NetBSD/src/share/man/man4/midi.4
.\" $NetBSD: midi.4,v 1.9 1999/09/16 19:49:04 augustss Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 6, 1998
.Dt MIDI 4
.Os
.Sh NAME
.Nm midi
.Nd device-independent MIDI driver layer
.Sh SYNOPSIS
.Cd "midi* at mpu?"
.Cd "midi* at opl?"
.Cd "midi* at pcppi?"
.Cd "midi* at sb?"
.Cd "midi* at wss?"
.Cd "pseudo-device sequencer"
.Pp
.Fd #include <sys/types.h>
.Fd #include <sys/midiio.h>
.Sh DESCRIPTION
The
.Nm
driver provides support for various MIDI peripherals.
It provides a uniform programming interface layer above different
underlying MIDI hardware drivers.  The MIDI hardware can be of many
different kinds, e.g., an external synthesizer on a MIDI port (or a serial port),
the PC speaker, an internal FM synth, or a wavetable synth.
.Pp
There are two device file types available for MIDI operation:
.Pa /dev/rmidiN ,
and
.Pa /dev/music .
The
.Pa /dev/rmidiN
devices provides raw access to a MIDI device.  Data written is sent
to the physical device as fast as possible and is uninterpreted.
Reading from the device returns data as soon as it becomes available.
A moderate amount of buffering is available both for reading and writing.
The raw MIDI devices are mostly useful for non realtime operations, such as
downloading patches to a device, since it is hard to get the accurate timing
needed for quality music from a user program.  But the devices can act as
a simple patchboard for MIDI devices.  For example, a MIDI keyboard could
be connected to a synthesizer by the command
.Cd "cat -u /dev/rmidi1 >/dev/rmidi2"
.Pp
The 
.Pa /dev/music
device is a MIDI sequencer device.  Data sent to and from this device
not only contains the information sent to the MIDI device, but also
timing information.  The kernel will make sure that data is sent
to the physical device at the indicated time.  The sequencer device
uses the 
.Pa /dev/rmidiN
devices internally and they are unavailable when used by the sequencer.
.Pp
The API for the sequencer device is binary compatible with the OSS sequencer
interface.
.Sh FILES
.Bl -tag -width /dev/sequencer -compact
.It Pa /dev/rmidiN
.It Pa /dev/music
.It Pa /dev/sequencer
.El
.Sh SEE ALSO
.Xr audio 4 ,
.Xr ioctl 2 ,
.Xr midiplay 1 ,
.Xr mpu 4 ,
.Xr opl 4 ,
.Xr ossaudio 3 .
.br
For ports using the ISA bus:
.Xr mpu 4 ,
.Xr pcppi 4 ,
.Xr sb 4 ,
.Xr wss 4 .
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.4 .
.Sh BUGS
This man page is very incomplete.
.Pp
