NetBSD/src/share/man/man4/mip.4
.\"	$NetBSD: mip.4,v 1.1.2.1 2008/02/22 02:53:32 keiichi Exp $
.\"
.\" Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the project nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 21, 2008
.Dt MIP 4
.Os
.Sh NAME
.Nm mip
.Nd Mobile IPv6 tunnel interface
.Sh SYNOPSIS
.Cd "pseudo-device mip"
.Sh DESCRIPTION
The
.Nm
interface is used when a node is operating Mobile IPv6 protocol.
It keeps a home address, which is a fixed address assigned by
the home site of the node, while the node is connected to the
networks other than its home network.
.Pp
A home address can be assigned by the
.Xr ifconfig 8
program using the
.Cm home
parameter, or specifying the
.Dv IN6_IFF_HOME
flag when issuing the
.Dv SIOCAIFADDR
ioctl message.

The
.Nm
interface is one of the parts of Mobile IPv6 implementation.  The
actual signal message processing is performed by the user space
programs provided separately from the NetBSD distribution.
 
.\"
.Sh SEE ALSO
.Xr inet6 4 ,
.Xr ifconfig 8
.Rs
.%A	D. Johnson
.%A	C. Perkins
.%A	J. Arkko
.%B	RFC 3775
.%T	Mobility Support in IPv6
.%D	June 2004
.%O	ftp://ftp.ietf.org/rfc/rfc3775.txt
.Re
.Rs
.%A	J. Arkko
.%A	V. Devarapalli
.%A	F. Dupont
.%B	RFC 3776
.%T	Using IPsec to Protect Mobile IPv6 Signaling Between Mobile Nodes and Home Agents
.%D	June 2004
.%O	ftp://ftp.ietf.org/rfc/rfc3776.txt
.Re
.\"
.Sh STANDARDS
Mobile IPv6 is specified in RFC3775 and RFC3776.
.\"
.Sh HISTORY
The
.Nm
device first appeared in SHISA Mobile IPv6 stack.
.\"
.Sh BUGS
