NetBSD/src/share/man/man4/mpii.4
.\"	$NetBSD: mpii.4,v 1.7 2019/05/08 07:17:29 wiz Exp $
.\"	OpenBSD: mpii.4,v 1.8 2010/10/01 12:27:36 mikeb Exp
.\"
.\" Copyright (c) 2010 Marco Peereboom <marco@openbsd.org>
.\" Copyright (c) 2009 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd May 7, 2019
.Dt MPII 4
.Os
.Sh NAME
.Nm mpii
.Nd LSI Logic Fusion-MPT Message Passing Interface II
.Sh SYNOPSIS
.Cd "mpii* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for storage controllers using the
LSI Logic Fusion-MPT Message Passing Interface II
family of chipsets:
.Pp
.Bl -dash -offset indent -compact
.It
LSISAS2004,
LSISAS2008,
LSISAS2108,
LSISAS2208,
LSISAS2216,
LSISAS2308,
LSISAS3004,
LSISAS3008,
LSISAS3108,
LSISAS3408,
LSISAS3416,
LSISAS3508,
LSISAS3516
.El
.Pp
These chipsets can be found on the following controllers:
.Pp
.Bl -dash -offset indent -compact
.It
Dell PERC H200, HBA330, 12Gbps SAS HBA
.It
IBM ServeRAID H1110
.It
Lenovo N2215, ThinkSystem 430
.It
LSI SAS 9200-8e, SAS 9207-8i, SAS 9211-4i, SAS 9211-8i
.It
Broadcom SAS 9300, HBA 9400
.El
.Pp
Some models of these controllers carry an Integrated RAID (IR) firmware
providing support for RAID 0, RAID 1, RAID10 or RAID5 using SAS or SATA
drives.
All RAID configuration is done through the controllers' BIOSes.
.Pp
.Nm
supports monitoring of the logical disks in the controller through the
.Xr bioctl 8
and
.Xr envstat 8
commands.
.Sh EVENTS
The
.Nm
driver is able to send events to
.Xr powerd 8
if a logical drive in the controller is not online.
The
.Em state-changed
event will be sent to the
.Pa /etc/powerd/scripts/sensor_drive
script when such condition happens.
.Sh SEE ALSO
.Xr bio 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr bioctl 8 ,
.Xr envstat 8 ,
.Xr powerd 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.7 .
.Nx
support was added in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An James Giannoules
and
.An Mike Belopuhov .
.Sh BUGS
The chips supported by
.Nm
do not use a SCSI-like identifier.
Instead they use an opaque ID and leave discovery order up to the operating
system.
The code to handle this is currently not implemented and therefore it is not a
good idea to run this driver on a multi-boot machine.
