NetBSD/src/share/man/man4/mpl115a.4
.\" $NetBSD: mpl115a.4,v 1.1 2013/09/08 15:57:39 rkujawa Exp $
.\"
.\" Copyright (c) 2013 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 8, 2013
.Dt MPL115A 4
.Os
.Sh NAME
.Nm mpl115a 
.Nd Freescale MPL115A2 absolute pressure sensor driver
.Sh SYNOPSIS
.Cd "mpl115a* at iic? addr 0x60"
.Sh DESCRIPTION
The
.Nm
driver provides support for the MPL115A2 pressure sensor.
It allows reporting absolute pressure through the
.Xr envsys 4
API.
.Sh SEE ALSO
.Xr envsys 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq radoslaw.kujawa@gmail.com .
The fixed-point pressure calculation algorithm was suggested by
.An Matt Thomas .
.Sh CAVEATS
The MPL115A2 chip has an accuracy of +/- 1 kPa, which makes it not very useful
for weather-related applications.
.Pp
The
.Xr envsys 4
API does not support pressure reporting yet, so the result is reported just as
integer number.
