NetBSD/src/share/man/man4/mvsata.4
.\" $NetBSD: mvsata.4,v 1.11 2020/08/28 16:07:49 fcambus Exp $
.\"
.\" Copyright (c) 2009 KIYOHARA Takashi
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 24, 2018
.Dt MVSATA 4
.Os
.Sh NAME
.Nm mvsata
.Nd Marvell Hercules-I and Hercules-II SATA controllers driver
.Sh SYNOPSIS
.Cd "mvsata* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports the Marvell Hercules-I and Hercules-II family of SATA
controllers, interfacing the hardware with the
.Xr ata 4
and
.Xr atapi 4
subsystems.
.Pp
The following controllers are supported by the
.Nm
driver:
.Pp
.Bl -tag -width "Gen IIe" -offset "xxxx" -compact
.It Gen I
.Bl -bullet -compact
.It
SATA 1.5Gbps; no support for NCQ, PMP, ATAPI
.It
Supported controllers:
.Bl -bullet -compact
.It
Marvell 88SX50xx Hercules-I
.El
.El
.It Gen II
.Bl -bullet -compact
.It
SATA 3Gbps, NCQ, and PMP support; no ATAPI support
.It
Supported controllers:
.Bl -bullet -compact
.It
Adaptec RAID 1420SA
.It
Marvell 88SX60xx Hercules-II
.El
.El
.It Gen IIe
.Bl -bullet -compact
.It
SATA 3Gbps, NCQ, PMP, ATAPI support
.It
Supported controllers:
.Bl -bullet -compact
.It
Adaptec RAID 1430SA
.It
Marvell 88SX70xx Hercules-II
.It
Triones Technologies RocketRAID 2310 RAID card
.El
.El
.El
.Sh SEE ALSO
.Xr ahcisata 4 ,
.Xr ata 4 ,
.Xr atapi 4 ,
.Xr pci 4 ,
.Xr wd 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 6.0 .
NCQ support was added, and ATAPI support enabled, in
.Nx
on October 7, 2017 .
.Sh AUTHORS
The
.Nm
driver was written by
.An KIYOHARA Takashi Aq Mt kiyohara@kk.iij4u.or.jp .
NCQ support was added by
.An Jaromir Dolecek Aq Mt jdolecek@NetBSD.org .
.Sh BUGS
.Bl -tag -width Ds -compact
.It NCQ is only enabled on Gen IIe controllers .
.It Device hot swapping is not yet supported .
.It Marvell's Software RAID is not supported by the
.Xr ataraid 4
driver.
.Xr raid 4
can be used instead.
.El
.Pp
This controller hardware is very old and pretty peculiar, with
poor ATAPI support.
It's very unlikely that the driver will receive any further changes,
particularly not for the Gen I and Gen II controllers.
Use an
.Xr ahcisata 4
compatible controller instead.
