NetBSD/src/share/man/man4/nca.4
.\" $NetBSD: nca.4,v 1.4.36.1 2008/05/18 12:31:06 yamt Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 18, 2000
.Dt NCA 4
.Os
.Sh NAME
.Nm nca
.Nd NCR-5380/NCR-53C400 SCSI driver
.Sh SYNOPSIS
.Cd "nca0     at isa? port 0x360 irq 15   # Port-mapped NCR 53C80 controller"
.Cd "nca1     at isa? iomem 0xd8000 irq 5 # Memory-mapped controller (T128...)"
.Cd "scsibus* at nca?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the NCR-5380/NCR-53C400 SCSI controllers.
.Sh SEE ALSO
.Xr isa 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.4 .
