NetBSD/src/share/man/man4/nct.4
.\"	$NetBSD: nct.4,v 1.2.4.2 2020/04/13 08:03:25 martin Exp $
.\"
.\" Copyright (c) 2019 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Andrew Doran.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 14, 2019
.Dt NCT 4
.Os
.Sh NAME
.Nm nct
.Nd Nuvoton NCT5104D SuperIO driver
.Sh SYNOPSIS
.Cd "nct0 at isa? port ?"
.Cd "nct0 at isa? port 0x2e"
.Cd "nct0 at isa? port 0x4e"
.Cd "gpio* at nct?"
.Sh DESCRIPTION
The
.Nm
driver supports the GPIO functions of the NCT5104D.
The driver does not support the watchdog function of the chip.
The chip's UARTs are driven by the
.Xr com 4
driver.
.Pp
The probe routine for this device is invasive.
The chip will be probed for only if the device is configured into the kernel
with a fixed port number (0x2e or 0x4e), or if running on a system that
is known to have a NCT5104D, such as the PC Engines APU line of systems.
.Pp
GPIO pins on this chip are shared with the 3rd UART, 4th UART, a clock
input line, and the watchdog timer.
If any these functions have been enabled by the BIOS, the
.Nm
driver will not take control of the corresponding GPIO lines.
At attach time, the driver logs which of the 17 GPIO lines are enabled.
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr isa 4 ,
.Xr gpioctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 9 .
.Sh CAVEATS
If the chip has not been configured in a complete and accurate manner by
the BIOS, GPIO lines may be needlessly disabled.
