NetBSD/src/share/man/man4/neo.4
.\"	$NetBSD: neo.4,v 1.5 2008/04/30 13:10:54 martin Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 22, 2005
.Dt NEO 4
.Os
.Sh NAME
.Nm neo
.Nd NeoMagic MagicMedia 256 audio device driver
.Sh SYNOPSIS
.Cd "neo*   at pci? dev ? function ?"
.Cd "audio* at audiobus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the NeoMagic MagicMedia 256AV and 256ZX
AC'97 audio devices, found on many laptops.
.Pp
The MagicMedia 256AV also comes in a variant (usually found on Dell
and HP laptops) that works in Windows Sound System emulation mode,
not in AC'97 mode.  That variant of the chip must be used with the
.Xr wss 4
driver.  The
.Nm
driver will not attach to such chips.
.Sh SEE ALSO
.Xr ac97 4 ,
.Xr audio 4 ,
.Xr intro 4 ,
.Xr midi 4 ,
.Xr pci 4 ,
.Xr wss 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 1.5.1 .
.Sh BUGS
The MagicMedia 256 series is not well-documented.
.Pp
No MIDI or FM synthesizer capability is provided with the MagicMedia 256
in AC'97 mode.  While those capabilities are provided by the Windows driver
for the chip, they are emulated by the Windows driver, and not directly
supported by the hardware.
