NetBSD/src/share/man/man4/npflog.4
.\" $NetBSD: npflog.4,v 1.2 2023/06/29 23:20:02 gutteridge Exp $
.\" $OpenBSD: pflog.4,v 1.10 2007/05/31 19:19:51 jmc Exp $
.\"
.\" Copyright (c) 2001 Tobias Weingartner
.\" All rights reserved.
.\"
.\" Copyright (c) 2023 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Portions of this documentation are derived from text contributed by
.\" David H. Gutteridge.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 29, 2023
.Dt NPFLOG 4
.Os
.Sh NAME
.Nm npflog
.Nd packet filter logging interface
.Sh SYNOPSIS
.Cd "pseudo-device npflog"
.Sh DESCRIPTION
The
.Nm 
interface is a pseudo-device which makes visible all packets logged by
the
.Xr npf 7
packet filter.
Logged packets can be monitored in real time by invoking
.Xr tcpdump 8
on the
.Nm
interface, or stored to disk using
.Xr npfd 8 .
.Pp
The npflog0 interface is created automatically at boot if
.Xr npf 7
is enabled;
further instances can be created using
.Xr ifconfig 8 .
.Pp
Each packet retrieved on this interface has a header associated
that presently matches the format used by
.Xr pf 4 .
This header documents the address family, interface name, rule
number, reason, action, and direction of the packet that was logged.
This structure looks like:
.Bd -literal -offset indent
struct npfloghdr {
	uint8_t		length;
	sa_family_t	af;
	uint8_t		action;
	uint8_t		reason;
	char		ifname[IFNAMSIZ];
	char		ruleset[NPFLOG_RULESET_NAME_SIZE];
	uint32_t	rulenr;
	uint32_t	subrulenr;
	uint32_t	uid;
	uint32_t	pid;
	uint32_t	rule_uid;
	uint32_t	rule_pid;
	uint8_t		dir;
	uint8_t		pad[3];
};
.Ed
.Sh EXAMPLES
Monitor all packets logged on the default interface:
.Bd -literal -offset indent
# tcpdump -n -e -tttt -i npflog0
.Ed
.Sh SEE ALSO
.Xr inet 4 ,
.Xr inet6 4 ,
.Xr netintro 4 ,
.Xr npf 7 ,
.Xr ifconfig 8 ,
.Xr npfd 8 ,
.Xr tcpdump 8
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 6.0 .
