NetBSD/src/share/man/man4/nsclpcsio.4
.\" $NetBSD: nsclpcsio.4,v 1.1 2002/08/06 16:44:50 drochner Exp $
.\"
.Dd August 6, 2002
.Dt NSCLPCSIO 4
.Os
.Sh NAME
.Nm nsclpcsio
.Nd National Semiconductor PC87366 hardware monitor
.Sh SYNOPSIS
.Cd "nsclpcsio* at isa?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the hardware monitor part of the
.Tn National Semiconductor
PC87366 LPC Super I/O chip to be used with
the
.Xr envsys 4
API.
.Pp
Currently, only the 3 temperature monitors are supported:
Two external inputs and one sensor built into the PC87366 chip.
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
device appeared in
.Nx 2.0 .
.Sh BUGS
The chip decodes address ranges which are not obvious and
cannot be controlled by the kernel configuration file
(must be set up by the BIOS).
.Pp
Voltage and Fan monitoring is not supported yet.
