NetBSD/src/share/man/man4/nxp75a.4
.\"	$NetBSD: nxp75a.4,v 1.1 2026/06/03 15:20:13 jdc Exp $
.\"
.\" Copyright (c) 2026 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Julian Coleman.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 13, 2026
.Dt NXP75A 4
.Os
.Sh NAME
.Nm nxp75a
.Nd NXP LM75A Digital temperature sensor and thermal watchdog
.Sh SYNOPSIS
.Cd "nxp75a* at iic? addr?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the NXP LM75A temperature sensor,
with a temperature resolution of 0.125 degC and a single
programable high limit.
Both the temperature value and the limit are available through the
.Xr envstat 8
interface.
.Pp
Note, that although this chip is described as a
.Qq pin-for-pin replacement for industry standard LM75
it is not software compatible with it.
The LM75 and similar chips are supported via the
.Xr lmtemp 4
driver.
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr iic 4 ,
.Xr intro 4 ,
.Xr lmtemp 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 11.1 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Julian Coleman Aq Mt jcoleman@netbsd.org .
