NetBSD/src/share/man/man4/ofisa.4
.\"	$NetBSD: ofisa.4,v 1.3.36.1 2008/05/18 12:31:06 yamt Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 25, 2000
.Dt OFISA 4
.Os
.Sh NAME
.Nm ofisa
.Nd introduction to machine-independent Open Firmware ISA bus support and drivers
.Sh SYNOPSIS
.Cd "ofisa* at mainbus0"
.Cd "XX*    at ofisa?"
.Sh DESCRIPTION
.Nx
includes a machine-independent
.Tn ISA
bus subsystem and several machine-independent
.Tn ISA
device drivers.
The
.Nm
bus uses Open Firmware to determine how to attach devices.
.Sh HARDWARE
.Nx
includes machine-independent Open Firmware
.Tn ISA
drivers, sorted by device type and driver name:
.Ss Disk and tape controllers
.Bl -tag -width mmmm -offset indent
.It wdc
Standard Western Digital type hard drive controllers: MFM, RLL, ESDI,
and IDE/ATAPI.
.El
.Ss Serial and parallel interfaces
.Bl -tag -width mmmm -offset indent
.It com
NS8250-, NS16450-, and NS16550-based serial ports.
.It lpt
Standard
.Tn ISA
parallel port interface.
.El
.Ss Network interfaces
.Bl -tag -width mmmm -offset indent
.It cs
.Tn Cirrus Logic
Crystal CS8900
.Tn Ethernet
interfaces.
.El
.Ss Sound cards and MIDI interfaces
.Bl -tag -width mmmm -offset indent
.It ess
ESS Technology AudioDrive 1788-, 1888-, 1887-, and 888-based sound cards.
.El
.Ss Miscellaneous devices
.Bl -tag -width mmmm -offset indent
.It joy
Game (joystick) adapters.
.El
.Sh SEE ALSO
.Xr com 4 ,
.Xr cs 4 ,
.Xr ess 4 ,
.Xr intro 4 ,
.Xr isa 4 ,
.Xr joy 4 ,
.Xr lpt 4 ,
.Xr wdc 4
.Sh HISTORY
The Open Firmware
.Tn ISA
subsystem appeared in
.Nx 1.4 .
