NetBSD/src/share/man/man4/pad.4
.\" $NetBSD: pad.4,v 1.6.8.1 2021/03/02 15:57:06 martin Exp $
.\"
.\" Copyright (c) 2007 Jared D. McNeill <jmcneill@invisible.ca>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 6, 2021
.Dt PAD 4
.Os
.Sh NAME
.Nm pad
.Nd Pseudo audio device driver
.Sh SYNOPSIS
.Cd "pseudo-device pad"
.Cd "audio* at audiobus?"
.Sh DESCRIPTION
.Nm
is a pseudo-device driver which provides support for feeding back PCM data
from consumers of an
.Xr audio 4
device to userland.
.Pp
The raw PCM data readable from
.Pa /dev/padN
is encoded in stereo little-endian 16-bit linear PCM at 44100 Hz.
.Sh FILES
The
.Nm
pseudo-device driver receives data from
.Pa /dev/audioN
and feeds the raw PCM output to
.Pa /dev/padN .
.Pa /dev/audioN
is created once
.Pa /dev/padN
is opened.
.Bl -item
.It
.Pa /dev/audioN
.It
.Pa /dev/padN
.El
.Sh EXAMPLES
The following example streams an MP3 to an Apple AirTunes compatible device:
.Bd -literal -offset indent
$ rtunes - < /dev/pad0 &
$ mpg123 -a /dev/audio1 mozart.mp3
.Ed
.Pp
Record the output of an application (in this case, audioplay):
.Bd -literal -offset indent
$ ffmpeg -f s16le -ar 44100 -ac 2 -i /dev/pad0 output.wav
$ audioplay -d /dev/audio1 input.wav
.Ed
.Sh SEE ALSO
.Xr audio 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 5.0 .
.Sh AUTHORS
.An Jared D. McNeill Aq Mt jmcneill@invisible.ca
