NetBSD/src/share/man/man4/pcdisplay.4
.\" $NetBSD: pcdisplay.4,v 1.1 1999/03/22 19:15:03 drochner Exp $

.Dd March 20, 1999
.Os
.Dt PCDISPLAY 4
.Sh NAME
.Nm pcdisplay
.Nd PC display adapter driver for wscons

.Sh SYNOPSIS
.Cd "pcdisplay0 at isa?"
.Cd "wsdisplay* at pcdisplay? console ?"

.Sh DESCRIPTION
This driver supports PC display adapter hardware within the
.Xr wscons 4
console framework. It doesn't provide direct device
driver entry points but makes its functions available via
the internal
.Xr wsdisplay 4
interface.
.Pp
The
.Nm
driver is indended as a minimal
.Dq catch-all
driver for the different kinds of
.Tn MDA
or
.Tn CGA
compatible adapters. It doesn't support multiple screens, nor
colors or font loading.

.Sh SEE ALSO
.Xr isa 4 ,
.Xr wscons 4 ,
.Xr vga 4
