NetBSD/src/share/man/man4/pcf8574io.4
.\"	$NetBSD: pcf8574io.4,v 1.1 2026/06/03 15:18:39 jdc Exp $
.\"
.\" Copyright (c) 2020 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Julian Coleman.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 13, 2026
.Dt PCF8754IO 4
.Os
.Sh NAME
.Nm pcf8574io
.Nd Philips Semiconductors PCF8574 and PCF857A GPIO Controllers
.Sh SYNOPSIS
.Cd "pcf8574io* at iic? addr?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCF8574 and PCF857A
GPIO controllers.
These differ only in their address on the i2c bus.
System properties are used to configure the pins as LED's or sensors
which are then exposed via the
.Xr led
or
.Xr envsys
frameworks.
If any pins are configured as alert sensors, then a console message
will be printed if the pin status changes.
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr iic 4 ,
.Xr intro 4 ,
.Xr led 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 10.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Julian Coleman Aq Mt jcoleman@netbsd.org .
