NetBSD/src/share/man/man4/pcf8563rtc.4
.\"	$NetBSD: pcf8563rtc.4,v 1.1 2011/01/24 01:15:00 jakllsch Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 24, 2011
.Dt PCF8563RTC 4
.Os
.Sh NAME
.Nm pcf8563rtc
.Nd NXP PCF8563 real-time clock
.Sh SYNOPSIS
.Cd "pcf8563rtc* at iic? addr 0x51"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn NXP
PCF8563 real-time clock chip.
.Pp
Access methods to retrieve and set date and time
are provided through the
.Em TODR
interface defined in
.Xr todr 9 .
.Sh SEE ALSO
.Xr iic 4 ,
.Xr todr 9
.Sh HISTORY
The
.Nm
device appeared in
.Nx 6.0 .
.Sh BUGS
The driver does not support the chip's alarm and timer features.
