NetBSD/src/share/man/man4/pci.4
.\"	$NetBSD: pci.4,v 1.2 1997/02/23 22:43:16 jonathan Exp $
.\"
.\"
.\" Copyright (c) 1997 Jonathan Stone
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Jonathan Stone
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 1997
.Dt PCI 4
.Os
.Sh NAME
.Nm pci
.Nd introduction to PCI bus machine-independent drivers and support
.Sh SYNOPSIS
.Pp
Machine-dependent; depends on the bus topology and PCI-bus interface
of your system. Typical PCI buses are connected to the
main system bus  via a PCI host bridge,  or daisy-chained
via a PCI-PCI bridge to an additional PCI bus.  See the
.Xr intro 4
documentation for your system for details.

.Sh INTRODUCTION
.Nx 1.2 
and later versions include  machine-independent bus support and
drivers for  the following PCI  bus devices.
Not all supported PCI devices are listed below.
Consult the
.Xr intro 4
section for your CPU for additional machine-dependent  drivers
(e.g., console drivers that support PCI video cards).
.Sh SUPPORTED DEVICES
.Nx
includes machine-independent PCI drivers, sorted by device type and
driver name:
.Pp
.Ss SCSI adaptors
.Bl -tag -width speaker -offset indent -compact
.It ahc
Adaptec 2940 and 3940 PCI SCSI adapter boards.
.It bha
Buslogic BT-9[45][68] SCSI boards.
.It ncr
Symbios (formerly NCR)  53c810 family of PCI and baseboard SCSI
adaptors
.El
.\"
.\"
.\"
.Pp
.Ss Network interfaces
.Bl -tag -width speaker -offset indent -compact
.It de
DEC  de-500 Ethernet interfaces. Also SMC and Znyx OEM cards, including
multiport cards using a PCI-PCI bridge.
.\"
.\" .It ed
.\" RealTek 8029 PCI Ethernet interfaces.
.\"
.It ep
3Com 3c590, 3c595, 3c900, and 3c905 Ethernet interfaces.
device interface
.It fpa
DEC  DEFPA FDDI cards
.It le
PCNet-PCI Ethernet interfaces.
.El
.Pp
.\"
.\"
.\"
.Ss Serial interface cards
.Bl -tag -width speaker -offset indent -compact
.It cy
Cyclades Cyclom-4Y, -8Y, and -16Y asynchronous serial communications
device interface
.El
.\"
.\"
.\"
.Pp
Note that many PCI devices also have EISA, ISA, or ISA Plug-and-Play
variants. These are listed in 
.Xr eisa 4 ,
.Xr isa 4 ,
and
.Xr isapnp 4 ,
respectively.  The manual pages for each individual driver also lists the
supported bus variants.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr ahc 4 ,
.Xr bha 4 ,
.Xr cy 4 ,
.Xr de 4 ,
.\".Xr ed 4 ,
.Xr ep 4 ,
.Xr fpa 4 ,
.Xr le 4 ,
.Xr ncr 4 .
.\" .Xr ppb 4 .
.Sh HISTORY
The
.Nm pci
introduction
appeared in
.Nx 1.3 .
