NetBSD/src/share/man/man4/pciback.4
.\"	$NetBSD: pciback.4,v 1.3 2011/01/11 13:46:47 jym Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jean-Yves Migeon <jym@NetBSD.org>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 8, 2011
.Dt PCIBACK 4 xen
.Os
.Sh NAME
.Nm pciback
.Nd Xen backend paravirtualized PCI pass-through driver
.Sh SYNOPSIS
.Cd "pciback* at pci?"
.Sh DESCRIPTION
The
.Nm
driver is the backend part of the PCI pass-through functionality
that can be used by the
.Tn Xen
dom0 to export
.Xr pci 4
devices to a guest domain.
To export a PCI device to a guest domain, the device has to be
attached to
.Nm
in the dom0.
.Pp
When the guest domain is
.Nx ,
the device attached to the
.Nm
driver will attach to a
.Xr xpci 4
bus inside the guest domain.
.Sh EXAMPLES
To attach a device to the
.Nm
driver,
follow these steps:
.Bl -enum -offset indent -compact
.It
look for the device PCI ID, via
.Xr pcictl 8 .
.It
edit
.Xr boot.cfg 5
and add the PCI ID to the list of PCI IDs that you want to
attach to
.Nm ,
in bus:device.function notation.
The list is passed to dom0 module via the
.Ic pciback.hide
parameter:
.Dl pciback.hide=(bus:dev.fun)(bus:dev.func)(...)
See also
.Xr boot 8 .
.It
reboot dom0.
.It
add the PCI ID to the list of PCI devices in the domain
configuration file:
.Dl pci = ['bus:dev.fun', '...']
.It
start the guest domain.
.El
.Sh SEE ALSO
.Xr pci 4 ,
.Xr xpci 4 ,
.Xr boot 8 ,
.Xr pcictl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 5.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Manuel Bouyer Aq bouyer@NetBSD.org .
.Sh CAVEATS
Currently, to attach a device to the
.Nm
backend, this procedure has to be performed at
.Xr boot 8
time.
In the future, it will be possible to do it without requiring
a dom0 reboot.
.Sh SECURITY CONSIDERATIONS
As PCI passthrough offers the possibility for guest domains
to send arbitrary PCI commands to a physical device, this has
direct impact on the overall stability and security of the system.
For example, in case of erroneous or malicious commands, the device
could overwrite physical memory portions, via DMA.
