NetBSD/src/share/man/man4/pciide.4
.\"	$NetBSD: pciide.4,v 1.6 1999/01/09 13:39:24 tron Exp $
.\"
.\" Copyright (c) 1998 Manuel Bouyer.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"

.Dd October 15, 1998
.Dt pciide 4
.Os NetBSD 
.Sh NAME
.Nm pciide
.Nd PCI IDE controllers driver
.Sh SYNOPSIS
.Cd "pciide* at pci ? dev ? function ? flags 0x0000"
.Cd "options PCIIDE_CMD064x_DISABLE"
.Sh DESCRIPTION
The
.Nm pciide
driver supports the PCI IDE controllers as specified in the
"PCI IDE controller specification, revision 1.0" draft, and provides the core
functions for the
.Nm wd
and
.Nm atapi
drivers. This driver include specific, enhanced support for the CMD Tech
PCI0640 controller, and IDE DMA/Ultra-DMA support for the Intel PIIX,
VIA Apollo and CMD Tech PCI0643 and PCI0646 controllers series.
.Pp
The 0x0001 flag force the
.Nm 
driver to use DMA when there is no explicit DMA mode setting support for
the controller but DMA is present. If the BIOS didn't set up the controller
properly, this can cause a machine hang.

.Sh BUGS
There's no way to reliably know if a PCI064x controller is enabled or not.
If the driver finds a PCI064x, it will assume it is enabled unless the
PCIIDE_CMD064x_DISABLE is specified in the kernel config file.
This will be a problem only if the controller has been disabled in the BIOS
and another controller has been installed and uses the ISA legacy I/O ports
and interrupts.
.Pp
The timings used for the PIO and DMA modes for the PCI064x, PIIX and Apollo
controllers are for a PCI bus running at 30 or 33 Mhz. This driver may not
work properly on overclocked systems.

.Sh SEE ALSO
.Xr intro 4 ,
.Xr wd 4 ,
.Xr scsi 4 ,
.Xr wdc 4
