NetBSD/src/share/man/man4/pckbd.4
.\" $NetBSD: pckbd.4,v 1.1 1999/03/22 19:15:02 drochner Exp $

.Dd March 20, 1999
.Os
.Dt PCKBD 4
.Sh NAME
.Nm pckbd
.Nd PC keyboard driver for wscons

.Sh SYNOPSIS
.Cd "pckbc0 at isa?"
.Cd "pckbd* at pckbc?"
.Cd "wskbd* at pckbd? console ?"
.Cd "options PCKBD_LAYOUT=XXX"

.Sh DESCRIPTION
This driver supports PC/AT keyboards within the
.Xr wscons 4
console framework. It doesn't provide direct device
driver entry points but makes its functions available via
the internal
.Xr wskbd 4
interface.
.Pp
The
.Nm
driver supports a number of different key mappings which
can be chosen from with the kernel option
.Dq PCKBD_LAYOUT
at compile time or with the utility
.Xr wsconsctl 8
(variable:
.Dq encoding
) at runtime.
Other mappings can be used if the whole keymap is replaced by means of
.Xr wsconsctl 8 .
The builtin mappings are at this time:
.Bl -hang
.It KB_US
(for wsconsctl:
.Dq us
) English / US keyboard mapping (default).
.It KB_DE
(
.Dq de
) German with
.Dq dead accents .
.It KB_DE | KB_NODEAD
(
.Dq de.nodead
) German without
.Dq dead accents .
.It KB_FR
(
.Dq fr
) French.
.It KB_DK
(
.Dq dk
) Danish with
.Dq dead accents .
.It KB_DK | KB_NODEAD
(
.Dq dk.nodead
) Danish without
.Dq dead accents .
.It KB_IT
(
.Dq it
) Italian.
.It KB_UK
(
.Dq uk
) British.
.It KB_JP
(
.Dq jp
) Japanese.
.It KB_US | KB_DECLK
(
.Dq us.declk
) English / US mapping for
.Tn DEC
LK400-style keyboards with PC keyboard interface (eg LK461).
.It KB_US | KB_SWAPCTRLCAPS
(
.Dq us.swapctrlcaps
) English / US mapping with swapped
.Dq Control
and
.Dq Caps Lock
keys.
.It KB_JP | KB_SWAPCTRLCAPS
(
.Dq jp.swapctrlcaps
) Japanese mapping with swapped
.Dq Control
and
.Dq Caps Lock
keys.
.El

.Sh BUGS
The list of builtin mappings doesn't follow any logics.
It grew as people submitted what they needed.

.Sh SEE ALSO
.Xr isa 4 ,
.Xr wskbd 4 ,
.Xr wsconsctl 8
