NetBSD/src/share/man/man4/pckbc.4
.\" $NetBSD: pckbc.4,v 1.9.42.1 2009/05/13 19:19:09 jym Exp $
.\"
.\" Copyright (c) 1999
.\" 	Matthias Drochner.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 16, 2002
.Dt PCKBC 4
.Os
.Sh NAME
.Nm pckbc
.Nd PC (ISA) keyboard controller driver
.Sh SYNOPSIS
.Cd "pckbc* at acpi?"
.Cd "pckbc* at isa?"
.Cd "pckbc* at pnpbios? index ?"
.Cd "pckbd* at pckbc? slot ?"
.Cd "pms*   at pckbc? slot ?"
.Sh DESCRIPTION
The
.Nm
driver handles resource allocation and device attachment for the
traditional PC/AT keyboard controller. It provides two logical
connections for child devices, the
.Dq keyboard
slot for a keyboard and the
.Dq auxiliary
slot for mice (the latter might be missing in older keyboard controllers).
.Pp
The optional
.Dq slot
locator argument can be used to force unusual connections of devices to
logical slots. This feature is for experimentation only, it will not be
useful in normal operation.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr isa 4 ,
.Xr pckbd 4 ,
.Xr pms 4 ,
.Xr pnpbios 4
