NetBSD/src/share/man/man4/pckbc.4
.\" $NetBSD: pckbc.4,v 1.7 2003/01/05 20:58:40 jmcneill Exp $
.Dd April 16, 2002
.Os
.Dt PCKBC 4
.Sh NAME
.Nm pckbc
.Nd PC (ISA) keyboard controller driver
.Sh SYNOPSIS
.Cd "pckbc* at acpi?"
.Cd "pckbc* at isa?"
.Cd "pckbc* at pnpbios? index ?"
.Cd "pckbd* at pckbc? slot ?"
.Cd "pms*   at pckbc? slot ?"
.Cd "opms*  at pckbc? slot ?"
.Sh DESCRIPTION
The
.Nm
driver handles resource allocation and device attachment for the
traditional PC/AT keyboard controller. It provides two logical
connections for child devices, the
.Dq keyboard
slot for a keyboard and the
.Dq auxiliary
slot for mice (the latter might be missing in older keyboard controllers).
.Pp
The optional
.Dq slot
locator argument can be used to force unusual connections of devices to
logical slots. This feature is for experimentation only, it will not be
useful in normal operation.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr isa 4 ,
.Xr opms 4 ,
.Xr pckbd 4 ,
.Xr pms 4 ,
.Xr pnpbios 4
