NetBSD/src/share/man/man4/pcmcia.4
.\" $NetBSD: pcmcia.4,v 1.5.2.3 2000/05/11 10:16:36 he Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 13, 2000
.Dt PCMCIA 4
.Os
.Sh NAME
.Nm pcmcia
.Nd introduction to PCMCIA (PC Card) support
.Sh SYNOPSIS
.Cd "pcic0   at isa? port 0x3e0 iomem 0xd0000 iosiz 0x4000"
.Cd "pcic1   at isa? port 0x3e2 iomem 0xd4000 iosiz 0x4000"
.Cd "pcmcia* at pcic? controller ? socket ?"
.Cd "XX*     at pcmcia? function ?"
.Pp
.Sh INTRODUCTION
.Nx
provides machine-independent bus support and
drivers for PCMCIA (PC Card, Card Bus)
devices.
.Sh SUPPORTED DEVICES
.Nx
includes the following machine-independent PCMCIA
drivers, sorted by function and driver name:
.Pp
.Ss Serial interfaces and modems
.Bl -tag -width speaker -offset indent -compact
.It com
8250/16450/16550-compatible PCMCIA serial cards and modems.
.El
.\"
.Pp
.Ss Network interfaces
.Bl -tag -width speaker -offset indent -compact
.It ep
3com 3c589 Etherlink-III Ethernet card.
.It mbe
Ethernet card based on the Fujitsu MB86960A/MB86965A chipset.
.It ne
NE2000 compatible cards.
.It sm
Megahertz Ethernet card.
.It wi
Lucent WaveLan/IEEE 802.11 controller.
.El
.\"
.Pp
.Ss SCSI controllers
.Bl -tag -width speaker -offset indent -compact
.It aic
Adaptec APA-1460 SCSI controller card.
.El
.Ss IDE controllers
.Bl -tag -width speaker -offset indent -compact
.It wdc
Digital Hinote Ultra Mobile Media Adapter
.El
.\"
.Pp
The supported PCMCIA controllers are those that are i82365 compatible.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr options 4 ,
.Xr aic 4 ,
.Xr com 4 ,
.Xr ep 4 ,
.Xr isa 4 ,
.Xr ne 4 ,
.Xr sm 4 ,
.Xr wi 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.3 .
.Sh BUGS
.Ss IO space conflicts
.Nx 
probes the pcmcia IO bus width and uses that information to decide
where to map PCMCIA IO space. For 10-bit wide cards, 0x300-0x3ff is
used, and this is satisfactory. For 12-bit wide cards, however,
it would nice to use 0x400-0xfff, however this causes some problems
for some specific PCMCIA devices, as well as some specific laptops;
consequently, 0x300-0x3ff is used.
.Pp
Unfortunately, the choice of 0x300-0x3ff causes problems as well.
In particular, a number of video devices are mapped in that range,
and may conflict. In the event that pcmcia devices are mapped
in 0x300 and appear to be nonfunctional, remapping to 0x400-0xfff
may be appropriate; consult 
.Cd options PCIC_ISA_ALLOC_IOBASE
and
.Cd options PCIC_ISA_ALLOC_IOSIZE
in
.Xr options 4 .
Example:
.Bd -literal -offset indent
# Avoid pcmcia bus space conflicts with the default io space
# allocation on 12-bit wide busses (base 0x300 size 0xff).
options PCIC_ISA_ALLOC_IOBASE=0x400
options PCIC_ISA_ALLOC_IOSIZE=0xbff
.Ed
