NetBSD/src/share/man/man4/pcppi.4
.\" $NetBSD: pcppi.4,v 1.2 2000/07/05 15:45:34 msaitoh Exp $
.Dd April 21, 1999
.Os
.Dt PCPPI 4
.Sh NAME
.Nm pcppi
.Nd PC (ISA) control and timer port driver
.Sh SYNOPSIS
.Cd pcppi* at isa?
.Cd spkr* at pcppi?
.Cd midi* at pcppi?
.Cd isabeep* at pcppi?
(alpha only)
.Cd sysbeep* at pcppi?
(i386 only)
.Sh DESCRIPTION
The
.Nm
driver handles ressource allocation and device attachment for the
ports related to the ISA speaker in the traditional PC/AT
.Dq design .
These are the
.Dq system control port
(which was implemented by the 8255
.Dq PPI
in the XT, hence the name of this driver)
at IO address 0x61 and the first 8253 timer at 0x40-0x43.
.Pp
It provides its child devices with the ability to output
simple tones through the PC speaker.
.Xr speaker 4
and
.Xr midi 4
are devices for their own.
.Dq isabeep /
.Dq sysbeep
is a helper device which the
.Xr pckbd 4
driver uses as a substitute for a
.Dq keyboard beep
because the PC keyboard hardware doesn't provide this.
.Sh SEE ALSO
.Xr isa 4 ,
.Xr speaker 4 ,
.Xr midi 4 ,
.Xr pckbd 4
