NetBSD/src/share/man/man4/pcscp.4
.\"    $NetBSD: pcscp.4,v 1.4 2000/05/15 06:31:56 bouyer Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by the NetBSD
.\"      Foundation, Inc. and its contributors.
.\" 4. The name of The NetBSD Foundations nor the names of its
.\"    contributors  may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"    $NetBSD: pcscp.4,v 1.4 2000/05/15 06:31:56 bouyer Exp $
.\"
.Dd February 21, 1999
.Dt PCSCP 4
.Os
.Sh NAME
.Nm pcscp
.Nd Advanced Micro Devices Am53c974 PCscsi-PCI SCSI driver
.Sh SYNOPSIS
.Cd "pcscp* at pci? dev ? function ?"
.Cd "scsibus* at pcscp?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Advanced Micro Devices
Am53c974 PCscsi-PCI
.Tn SCSI
controller and boards using this chip,
including the
.Tn Tekram
.Tn DC-390
.Tn PCI
.Tn SCSI
host adapter.
.Pp
For
.Tn Tekram
.Tn DC-390U/F
.Tn PCI
.Tn SCSI
host adapters, use the
.Xr ncr 4
or 
.Xr siop 4
driver.
.Sh BUGS
The driver currently ignores EEPROM settings, which establish
per-target parameters etc.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr scsi 4 ,
.Xr esp 4 ,
.Xr cd 4 ,
.Xr ch 4 ,
.Xr sd 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4
.Pp
.Pa http://www.amd.com/
