NetBSD/src/share/man/man4/pm3fb.4
.\" Copyright (c) 2015 Naruaki Etomi
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 1, 2015
.Dt PM3FB 4
.Os
.Sh NAME
.Nm pm3fb
.Nd 3Dlabs Permedia 3 / Oxygen VX1 / Proformance 3 framebuffer driver
.Sh SYNOPSIS
.Cd "pm3fb* at pci?"
.Cd "wsdisplay* at pm3fb?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the 3Dlabs Permedia 3 / Oxygen VX1 / Proformance 3 series of
graphics cards and provides an interface for machine independent
.Xr wscons 4
driver.
.Pp
Currently
.Nm
does not support Anti-alias font rendering and OpenLDI video interface.
However, it is capable of changing the resolution and uses DDC2 to
pick an appropriate video mode.
.Pp
A 2D graphics engine is used to accelerate scrolling, rectangle fills
and Bitmap font rendering.
.Sh SEE ALSO
.Xr pci 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Naruaki Etomi .
