NetBSD/src/share/man/man4/pwdog.4
.\"	$NetBSD: pwdog.4,v 1.1 2011/08/11 07:33:25 mbalmer Exp $
.\"	$OpenBSD: pwdog.4,v 1.6 2007/12/23 22:16:39 jmc Exp $
.\"
.\" Copyright (c) 2011 Marc Balmer <mbalmer@NetBSD.org>
.\" Copyright (c) 2006 Marc Balmer <mbalmer@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd August 11, 2011
.Dt PWDOG 4
.Os
.Sh NAME
.Nm pwdog
.Nd Quancom PWDOG1 watchdog timer device
.Sh SYNOPSIS
.Cd "pwdog0 at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Quancom PWDOG1 boards.
.Pp
If the kernel crashes, the watchdog timer is not reset and the system will
reboot (assuming a proper connection is made between the PWDOG1 and
the motherboard).
Alternatively, the watchdog can be reinitialized via a userland process which
ensures that process scheduling, not just kernel timeout processing, is still
taking place.
.Pp
The timeout period of the PWDOG1 card is set using DIP switches and cannot
be changed by software.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.1
and
.Nx 6.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Marc Balmer Aq mbalmer@NetBSD.org .
