NetBSD/src/share/man/man4/pxagpio.4
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Steve Woodford.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 15, 2017
.Dt PXAGPIO 4
.Os
.Sh NAME
.Nm pxaip
.Nd Intel Xscale PXA250/PXA270 GPIO Controller
.Sh SYNOPSIS
.Cd "pxagpio* at pxaip?"
.Cd "gpio* at gpiobus?"
.Sh DESCRIPTION
.Nm
is an on-board GPIO controller found in XScale PXA250, PXA255, PXA270,
PXA271, PXA272 and PXA273 processors manufactured by Intel and Marvell
Technology.
The driver does support either 86 pins for PXA250 and 121 pins for PXA270
processor family.
Access to the pins is provided by the
.Xr gpio 4
interface. The driver does support GPIO_PIN_INPUT and GPIO_PIN_OUTPUT.
GPIO pins being used in alternate configurations are not available
for GPIO operations.
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr pxagpio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 2.0 . GPIO attachment appeared in
.Nx 8.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Steve Woodford
.Aq Mt scw@NetBSD.org .
This manual page was contributed by
.An Stephan Meisinger .
