NetBSD/src/share/man/man4/pxaip.4
.\"	$NetBSD: pxaip.4,v 1.5.2.1 2018/05/21 04:35:56 pgoyette Exp $
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Steve Woodford.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 5, 2017
.Dt PXAIP 4
.Os
.Sh NAME
.Nm pxaip
.Nd Intel Xscale PXA250/PXA270 Onboard Peripheral Controller
.Sh SYNOPSIS
.Cd "pxaip0 at mainbus?"
.Sh DESCRIPTION
.Nm
is an on-board peripheral controller found in XScale PXA250, PXA255, PXA270,
PXA271, and PXA272 processors manufactured by Intel and Marvell Technology.
Drivers are available for the following peripherals:
.Bl -tag -width -pcdisplay -offset indent
.It com
NS16650-compatible serial ports.
.It gxiic
Gumstix Inter IC controller.
.It gxio
Gumstix I/O interface.
.It lcd
LCD controller.
.It obio
Onboard I/O interface.
.It ohci
USB OHCI host controller.
.It pxaacu
Intel Xscale PXA250/270 AC'97 audio device.
.It pxadmac
Intel XScale PXA250/270 DMA controller.
.It pxagpio0
Intel XScale PXA250/270 GPIO controller.
.It pxaintc
Intel XScale PXA250/270 interrupt controller.
.It pxamci
Intel XScale PXA250/270 SD/MMC card controller.
.It pxapcic
Intel XScale PXA250/270 PCMCIA controller.
.It pxartc
Intel XScale PXA250/270 real time clock.
.It saost
StrongARM SA-110 compatible OS timer.
.It sm
SMC91Cxx Ethernet interface.
.It zapm
Sharp Zaurus power management controller.
.It ziic
Sharp Zaurus Inter IC controller
.It zkbd
Sharp Zaurus keyboard.
.It zrc
Sharp Zaurus remote controller.
.El
.Sh SEE ALSO
.Xr com 4 ,
.Xr evbarm/gxio 4 ,
.Xr ohci 4 ,
.Xr sm 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 2.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Steve Woodford
.Aq Mt scw@NetBSD.org .
This manual page was contributed by
.An Stephan Meisinger .
