NetBSD/src/share/man/man4/qat.4
.\"	$NetBSD: qat.4,v 1.1 2019/11/20 09:37:45 hikaru Exp $
.\"
.\" Copyright (c) 2019 Internet Initiative Japan, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 20, 2019
.Dt QAT 4
.Os
.Sh NAME
.Nm qat
.Nd Intel QuickAssist crypto accelerator
.Sh SYNOPSIS
.Cd "qat* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports the following system-on-chips, chipsets, and PCIe adapters,
which are integrated with QuickAssist:
.Pp
.Bl -bullet -compact
.It
Intel Atom C2000 processor
.It
Intel Atom C3000 processor
.It
Intel Xeon D-1500 processor
.It
Intel Xeon D-2100 processor
.It
Intel C620 chipset
.It
Intel QuickAssist Adapter 8960/8970
.El
.Pp
When the
.Nm
driver is attached, it automatically registers itself to accelerate
DES-CBC, 3DES-CBC, AES-CBC, HMAC-SHA1, HMAC-SHA256, HMAC-SHA384,
and HMAC-SHA512 operations for
.Xr opencrypto 9 ,
and thus for
.Xr ipsec 4
and
.Xr crypto 4 .
.Sh FILES
The
.Nm
driver loads the firmware which is located in
.Pa /libdata/firmware/qat/ ,
by
.Xr firmload 9 .
.Sh SEE ALSO
.Xr crypto 4 ,
.Xr intro 4 ,
.Xr ipsec 4 ,
.Xr firmload 9 ,
.Xr opencrypto 9
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 10.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Hikaru Abe Aq Mt hikaru@iij.ad.jp .
