NetBSD/src/share/man/man4/qemufwcfg.4
.\"	$NetBSD: qemufwcfg.4,v 1.1 2017/11/26 21:02:37 wiz Exp $
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 26, 2017
.Dt QEMUFWCFG 4
.Os
.Sh NAME
.Nm qemufwcfg
.Nd QEMU Firmware Configuration device driver
.Sh SYNOPSIS
.\" TODO: is the next line correct?
.Cd "qemufwcfg* at acpi"
.Sh DESCRIPTION
The
.Nm
interface allows QEMU guests to query and modify various data items on
the host, usually related to firmware configuration.
.Sh SEE ALSO
.Rs
.%T QEMU Firmware Configuration (fw_cfg) Device
.%U https://raw.githubusercontent.com/qemu/qemu/master/docs/specs/fw_cfg.txt
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 9.0 .
