NetBSD/src/share/man/man4/r128fb.4
.\"	$NetBSD: r128fb.4,v 1.1.4.2 2025/08/02 05:55:12 perseant Exp $
.\"
.\" Copyright (c) 2007 Michael Lorenz
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 15, 2025
.Dt R128FB 4
.Os
.Sh NAME
.Nm r128fb
.Nd ATI RAGE 128 framebuffer driver
.Sh SYNOPSIS
.Cd "r128fb* at pci?"
.Cd "wsdisplay* at r128fb?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the ATI RAGE 128 graphics controller.
This driver provides backlight control via
.Xr wsconsctl 8 ,
as well as 2D acceleration for
.Xr rasops 9
operations.
.Sh SEE ALSO
.Xr machfb 4 ,
.Xr r128 4 ,
.Xr r128drm 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Michael Lorenz .
.Sh BUGS
The driver has been tested on macppc only.
