NetBSD/src/share/man/man4/rcons.4
.\"     $NetBSD: rcons.4,v 1.3 2008/04/30 13:10:54 martin Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 21, 2001
.Dt RCONS 4
.Os
.Sh NAME
.Nm rcons
.Nd raster console access
.Sh SYNOPSIS
.Cd options RASTERCONSOLE_FGCOL=n
.Cd options RASTERCONSOLE_BGCOL=n
.Cd options RCONS_2BPP
.Cd options RCONS_4BPP
.Cd options  RCONS_16BPP
.Ss pmax
.Cd pseudo-device rasterconsole N
.Sh DESCRIPTION
The
.Nm
driver provides support for machine-independent access to the raster
console.  Use of the
.Nm
driver is deprecated in favour of the
.Xr wscons 4
machine-independent console driver.
.Pp
The
.Nm
driver provides simple raster and frame buffer routines.  It's enough
to implement a console terminal emulator on monochrome and
pseudo-colour screens.
.Sh SEE ALSO
.Xr wscons 4
