NetBSD/src/share/man/man4/rge.4
.\" $NetBSD: rge.4,v 1.3.6.2 2025/11/26 19:00:18 martin Exp $
.\" $OpenBSD: rge.4,v 1.4 2020/10/12 02:11:10 kevlo Exp $
.\"
.\" Copyright (c) 2019, 2020 Kevin Lo <kevlo@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd November 20, 2025
.Dt RGE 4
.Os
.Sh NAME
.Nm rge
.Nd Realtek 8125/8125B/8126/8127 PCI Express 10/100/1Gb/2.5Gb/5Gb/10Gb Ethernet device
.Sh SYNOPSIS
.Cd "rge* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for NICs based on the
Realtek RTL8125, RTL8126, and RTL8127 PCI
Express Ethernet controllers, including the following:
.Pp
.Bl -bullet -offset indent -compact
.It
IOCrest IO-PCE8126-GLAN Adapter (5000baseT)
.It
WisdPi WP-NA5000 Adapter (5000baseT)
.It
Realtek 8125/8125B 2.5GbE Adapter (2500baseT)
.It
Realtek 8126 5GbE Controller (5000baseT)
.It
Rivet Networks Killer E3000 Adapter (2500baseT)
.It
TP-LINK TL-NG421 Adapter (2500baseT)
.El
.Pp
NICs based on the 8125 and 8125B are capable of 10, 100, 1000 and
2500Mbps operation.
NICs based on the 8126 are also capable of 5000Mbps operation, while
NICs based on the 8127 are additionally capable of 10000Mbps operation.
All NICs support off-loading of checksum calculations for IPv4, TCPv4,
and UDPv4, but not for xxxv6.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.\".Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh CAVEATS
The
.Nm
driver support for the RTL8127 chip should be
considered experimental.
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Kevin Lo Aq Mt kevlo@openbsd.org ,
and was initially ported to
.Nx
by
.An Sevan Janiyan .
The current version was updated by
.An Paul Goyette Aq Mt pgoyette@netbsd.org
to synch with changes from
.Ox .
