NetBSD/src/share/man/man4/rtk.4
.\"	$NetBSD: rtk.4,v 1.1 2000/04/27 08:56:42 haya Exp $
.\"
.\" Copyright (c) 2000 Manuel Bouyer
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Manuel Bouyer
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 6, 2000
.Dt RTK 4
.Os
.Sh NAME
.Nm rtk
.Nd Ethernet driver for RealTek 8129/8139 based ethernet boards
.Sh SYNOPSIS
.Cd "rtk* at pci? dev ? function ?"
.Pp
Configuration of PHYs are necessary.  See
.Xr mii 4 .
.Sh DESCRIPTION
The
.Nm rtk
device driver supports network adapters based on
the RealTek 8129/8139 chips.
.Pp
.Sh MEDIA SELECTION
Media selection is done using
.Xr ifconfig 8
using the standard
.Xr ifmedia 4
mechanism.  Refer to those manual pages for more information.
.Pp
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr mii 4
