NetBSD/src/share/man/man4/rtsx.4
.\"	$NetBSD: rtsx.4,v 1.5 2018/04/24 18:35:56 maya Exp $
.\"	$OpenBSD: rtsx.4,v 1.6 2014/05/18 10:52:17 stsp Exp $
.\"
.\" Theo de Raadt, 2006. Public Domain.
.\" Stefan Sperling, 2012. Public Domain.
.\"
.Dd April 24, 2018
.Dt RTSX 4
.Os
.Sh NAME
.Nm rtsx
.Nd Realtek SD card reader
.Sh SYNOPSIS
.Cd "rtsx* at pci?"
.Cd "sdmmc* at rtsx?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Realtek RTS5209, RTS5227, RTS5229,
RTS525A, RTL8402, RTL8411 and RTL8411B SD card readers.
.Pp
The
.Xr sdmmc 4
subsystem performs SD/MMC transactions to communicate with
whatever MMC, SD or SDHC devices are inserted into the SD slot.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sdmmc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.3
and in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Stefan Sperling
.Aq stsp@openbsd.org
for
.Ox
and ported to
.Nx
by
.An NONAKA Kimihiro
.Aq nonaka@netbsd.org .
.Sh BUGS
The
.Nm
driver does not support MS (Memory Stick) and xD (Extreme Digital) devices
even though the hardware supports them.
.Pp
Support for SDIO interrupts is not implemented.
