NetBSD/src/share/man/man4/rtsx.4
.\"	$NetBSD: rtsx.4,v 1.2.8.2 2014/08/20 00:02:35 tls Exp $
.\"	$OpenBSD: rtsx.4,v 1.4 2013/11/06 13:51:02 stsp Exp $
.\"
.\" Theo de Raadt, 2006. Public Domain.
.\" Stefan Sperling, 2012. Public Domain.
.\"
.Dd March 19, 2014
.Dt RTSX 4
.Os
.Sh NAME
.Nm rtsx
.Nd Realtek SD card reader
.Sh SYNOPSIS
.Cd "rtsx* at pci?"
.Cd "sdmmc* at rtsx?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Realtek RTS5209 and RTS5229 SD card readers.
.Pp
The
.Xr sdmmc 4
subsystem performs SD/MMC transactions to communicate with
whatever MMC, SD or SDHC devices are inserted into the SD slot.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr sdmmc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.3
and in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Stefan Sperling
.Aq stsp@openbsd.org
for
.Ox
and ported to
.Nx
by
.An NONAKA Kimihiro
.Aq nonaka@netbsd.org .
.Sh BUGS
The
.Nm
driver does not support MS (Memory Stick) and xD (Extreme Digital) devices
even though the hardware supports them.
.Pp
Support for SDIO interrupts is not implemented.
