NetBSD/src/share/man/man4/sbus.4
.\"	$NetBSD: sbus.4,v 1.1 2001/05/27 20:26:21 pk Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Kranenburg.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 27, 2001
.Dt SBUS 4
.Os
.Sh NAME
.Nm SBus
.Nd introduction to machine-independent SBus bus support and drivers
.Sh SYNOPSIS
.Pp
.Cd "sbus* at mainbus?"
.Cd "sbus* at iommu?"
.Cd "sbus* at xbox?"
.Pp
These
.Nm
attachments are specific to the
.Nx Ns /sparc
and
.Nx Ns /sparc64
ports.
.Sh INTRODUCTION
.Nm
is a I/O interconnect bus mostly found in
.Tm SPARC
workstations and small to medium server class systems. It supports both
on-board peripherals and extension boards. The
.Nm
specifications define the bus protocol as well as the electrical and
mechanical properties of the extension slots. 
.Sh SUPPORTED DEVICES
.Nx
includes machine-independent
.Nm
drivers, sorted by device type and driver name:
.Pp
.Ss SCSI interfaces
.Bl -tag -width xxxxxxxx -offset indent
.It esp
NCR53c94 and compatible
.Tn SCSI
interfaces.
.It isp
Qlogic
.Tn SCSI
interfaces.
.El
.Pp
.Ss Network interfaces
.Bl -tag -width xxxxxxxx -offset indent
.It le
.Tn Lance
7990 series
.Tn Ethernet
interfaces.
.It hme
.Dq Happy Meal
.Tn Ethernet
interfaces.
.It en
Midway-based Efficent Networks Inc. and Adaptec ATM interfaces.
.It be
.Dq Big Mac
.Tn Ethernet
board.
.It qe
Quad Ethernet Controller
board.
.El
.Pp
.Ss Bridges
.Bl -tag -width xxxxx -offset indent
.It xbox
an
.Nm Sbus
expansion box.
.El
.Ss Graphics devices
.Bl -tag -width xxxxxxx -offset indent
.It bwtwo
framebuffer device.
.It cgthree
framebuffer device.
.It cgsix
framebuffer device.
.It tcx
framebuffer device.
.El
.Pp
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The machine-independent
.Nm SBus
subsystem appeared in
.Nx 1.3 .
