NetBSD/src/share/man/man4/scmdi2c.4
.\" $NetBSD: scmdi2c.4,v 1.1 2021/12/07 17:39:54 brad Exp $
.\"
.\" Copyright (c) 2021 Brad Spencer <brad@anduin.eldar.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd December 1, 2021
.Dt SCMDI2C 4
.Os
.Sh NAME
.Nm scmdi2c
.Nd I2C frontend to the Sparkfun Serial Controlled Motor Driver
.Sh SYNOPSIS
.Cd "scmd* at iic? addr 0x58"
.Cd "scmd* at iic? addr 0x59"
.Cd "scmd* at iic? addr 0x5a"
.Cd "scmd* at iic? addr 0x5b"
.Cd "scmd* at iic? addr 0x5c"
.Cd "scmd* at iic? addr 0x5d"
.Cd "scmd* at iic? addr 0x5e"
.Cd "scmd* at iic? addr 0x5f"
.Cd "scmd* at iic? addr 0x60"
.Cd "scmd* at iic? addr 0x61"
.Sh DESCRIPTION
The
.Nm
driver provides the I2C frontend attachment for the Sparkfun SCMD device.
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 3
variables are inherited from
.Xr scmd 4
:
.Bl -tag -width indent
.It Li hw.scmd0.debug
If the driver is compiled with
.Dv SCMD_DEBUG ,
this node will appear and can be used to set the debugging level.
.El
.Sh FILES
.Bl -tag -width /dev/rcaXXXXX -compact
.It Pa /dev/scmd Ns Ar u
character device allowing access to the register space of a main
.Ar u ,
SCMD device
.Sh SEE ALSO
.Xr iic 4 ,
.Xr spi 4 ,
.Xr scmdi2c 4 ,
.Xr scmdspi 4 ,
.Xr scmdctl 1 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 10.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Brad Spencer Aq Mt brad@anduin.eldar.org .
