NetBSD/src/share/man/man4/sdtemp.4
.\"	$NetBSD: sdtemp.4,v 1.3 2011/01/08 20:13:01 jruoho Exp $
.\"
.\" Copyright (c) 2008 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Goyette.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 8, 2011
.Dt SDTEMP 4
.Os
.Sh NAME
.Nm sdtemp
.Nd JEDEC JC-42.4 compatible memory module temperature sensors
.Sh SYNOPSIS
.Cd "sdtemp0 at iic? addr 0x18"
.Cd "sdtemp0 at iic? addr 0x19"
.Cd "sdtemp0 at iic? addr 0x1a"
.Cd "sdtemp0 at iic? addr 0x1b"
.Cd "sdtemp0 at iic? addr 0x1c"
.Cd "sdtemp0 at iic? addr 0x1d"
.Cd "sdtemp0 at iic? addr 0x1e"
.Cd "sdtemp0 at iic? addr 0x1f"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Microchip Technology
MCP9805/98242 and other chips that conform to JEDEC Standard 21-C section
4.7.
Memory module temperature sensors are optional on DDR2 and DDR3 SDRAM DIMMs.
Sensors provided by this driver, including the on-chip thresholds for the
Alarm Window and Critical level, are accessed through the
.Xr envsys 4
API.
.Pp
The
.Nm
supports temperature ranges from -256 to +255 degrees C.
.Pp
Chips supported by the
.Nm
driver include:
.Pp
.Bl -bullet -offset indent
.It
.Tn Catalyst
.Em CAT34TS02
and
.Em CAT6095
.It
.Tn Analog Devices
.Em ADT7408
.It
.Tn Integrated Deviced Technology
.Em TSE2002B3
and
.Em TSE3000B3
.It
.Tn Maxim
.Em MAX6604
.It
.Tn Microchip Technology
.Em MCP9805 ,
.Em MCP9843 ,
.Em MCP98242 ,
and
.Em MCP98243
.It
.Tn NXP Semiconductors
.Em SE97
and
.Em SE98
.It
.Tn STmicroelectronics
.Em STTS424
and
.Em STTS424E
.El
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
device appeared in
.Nx 6.0 .
.Sh BUGS
Interrupt support is unimplemented.
