NetBSD/src/share/man/man4/sec.4
.\" $NetBSD: sec.4,v 1.1 2006/10/01 14:59:05 bjh21 Exp $
.\"
.\" Copyright (c) 2006 Ben Harris
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 1, 2006
.Os
.Dt SEC 4
.Sh NAME
.Nm sec
.Nd Acorn SCSI Expansion Card driver
.Sh SYNOPSIS
.Cd "sec* at podulebus0 slot ?"
.Cd "scsibus* at sec?"
.Sh DESCRIPTION
The
.Nm
driver supports the Acorn
.Tn SCSI
Expansion Card, model numbers
.Tn AKA30 ,
.Tn AKA31 ,
and
.Tn AKA32 .
These cards support 8-bit parallel synchronous transfers
at up to 4 MHz.
.Sh SEE ALSO
.Xr podulebus 4 ,
.Xr scsi 4
