NetBSD/src/share/man/man4/seeprom.4
.\"	$NetBSD: seeprom.4,v 1.4 2013/02/08 15:18:44 jdc Exp $
.\"
.\" Copyright (c) 2007 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 7, 2013
.Dt SEEPROM 4
.Os
.Sh NAME
.Nm seeprom
.Nd 24-series I2C EEPROM driver
.Sh SYNOPSIS
.Cd "seeprom0 at iic0 addr 0x50 size 128"
.Sh DESCRIPTION
The
.Nm
driver provides support for the 24-series of I2C EEPROMs,
available from a variety of vendors.
.Pp
Access to the contents of the memory is through a character device.
.Sh SEE ALSO
.Xr iic 4
.Sh HISTORY
The
.Nm
device appeared in
.Nx 2.0 .
.Sh BUGS
AT24C1024 EEPROM's are not supported.
.Pp
The
.Nm
driver reads and writes one byte at a time to be compatible with all
controllers.
