NetBSD/src/share/man/man4/seeprom.4
.\"	$NetBSD: seeprom.4,v 1.5 2013/10/25 14:23:15 jdc Exp $
.\"
.\" Copyright (c) 2007 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 25, 2013
.Dt SEEPROM 4
.Os
.Sh NAME
.Nm seeprom
.Nd 24-series I2C EEPROM driver
.Sh SYNOPSIS
.Cd "seeprom0 at iic0 addr 0x51: AT24Cxx or compatible EEPROM: size 256"
.Cd "seeprom16 at iic1 addr 0x57: power-supply: size 8192"
.Sh DESCRIPTION
The
.Nm
driver provides support for the ATMEL 24-series of I2C EEPROMs, and
compatables, available from a variety of vendors.  The Philips PCF8582
is also supported, as compatable with the AT24C02.
.Pp
Access to the contents of the memory is through a character device.
.Pp
The size of the EEPROM is either read from the firmware, or can be set
using the flags keyword in the kernel configuration.
The value of the flag represents the EEPROM size in Kbit.
.Bl -column -offset indent "flags" "EEPROM size in bytes"
.It Sy flags Ta Sy EEPROM size in bytes
.It Li 1 Ta 128
.It Li 2 Ta 256
.It Li 4 Ta 512
.It Li 8 Ta 1024
.It Li 16 Ta 2048
.It Li 32 Ta 4096
.It Li 64 Ta 8192
.It Li 128 Ta 16384
.It Li 256 Ta 32768
.It Li 512 Ta 65536
.El
.Sh EXAMPLES
Indirect configuration:
.Dl seeprom* at iic? addr 0x51 flags 0x2
Direct configuration:
.Dl seeprom* at iic? addr?
.Sh SEE ALSO
.Xr iic 4
.Sh HISTORY
The
.Nm
device appeared in
.Nx 2.0 .
.Sh BUGS
AT24C1024 EEPROM's are not supported.
.Pp
Software write protection on the AT34Cxx EEPROM's is not supported.
.Pp
The
.Nm
driver reads and writes one byte at a time to be compatible with all
controllers.
