NetBSD/src/share/man/man4/sf.4
.\"	$NetBSD: sf.4,v 1.5.34.1 2008/05/18 12:31:07 yamt Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 18, 2001
.Dt SF 4
.Os
.Sh NAME
.Nm sf
.Nd Adaptec AIC-6915 10/100 Ethernet driver
.Sh SYNOPSIS
.Cd "sf* at pci? dev ? function ?"
.Pp
Configuration of PHYs may also be necessary.  See
.Xr mii 4 .
.Sh DESCRIPTION
The
.Nm
device driver supports the Adaptec AIC-6915 10/100 Ethernet
chip.  This chip is found on several Adaptec Ethernet boards:
.Bl -bullet -offset indent
.It
ANA-62011 Single port 10/100 64-bit
.It
ANA-62022 Dual port 10/100 64-bit
.It
ANA-62044 Quad port 10/100 64-bit
.It
ANA-62020 Single port 100BASE-FX 64-bit
.It
ANA-69011 Single port 10/100 32-bit
.El
.\" .Sh DIAGNOSTICS
.\" XXX too be done.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.6 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Jason R. Thorpe
.Aq thorpej@NetBSD.org .
.Sh BUGS
The
.Nm
driver does not support the IPv4/TCP/UDP checksum function of the AIC-6915.
.Pp
The
.Nm
driver does not support the VLAN function of the AIC-6915.
