NetBSD/src/share/man/man4/sgsmix.4
.\" $NetBSD: sgsmix.4,v 1.1 2007/05/15 14:12:10 macallan Exp $
.\"
.\" Copyright (c) 2007
.\" 	Michael Lorenz.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 14, 2007
.Os
.Dt SGSMIX 4
.Sh NAME
.Nm sgsmix
.Nd driver for SGS 7433 Basic Audio Processor found in some Apple machines
.Sh SYNOPSIS
.Cd "iic* at cuda?"
.Cd "sgsmix* at iic? addr 0x8a"
.Sh DESCRIPTION
The
.Nm
driver provides support for the external mixer chip on Apple's 'personality cards' found in beige Power Macintosh G3. All mixer controls are accessed
through the
.Xr awacs 4
driver,
.Nm
additionally provides bass and treble controls.
.Pp
.Sh SEE ALSO
.Xr awacs 4 ,
.Xr cuda 4 ,
.Xr iic 4 
