NetBSD/src/share/man/man4/shb.4
.\"	$NetBSD: shb.4,v 1.1 2003/10/21 00:15:45 uwe Exp $
.\"
.\" Copyright (c) 2003 Valeriy E. Ushakov
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 21, 2003
.Dt SHB 4
.Os
.Sh NAME
.Nm shb
.Nd bus for SuperH on-chip peripheral devices
.Sh SYNOPSIS
.Cd "shb* at mainbus?"
.Sh DESCRIPTION
The
.Nm
driver provides a bus to which drivers for integrated peripheral
devices found in various SuperH microprocessors attach.
.Bl -tag -width xxxxxxxx
.It adc
analog/digital converter.
.It sci
serial communication interface.
.It scif
serial communication interface with FIFO.
.It wdog
watchdog timer.
.El
.Sh SEE ALSO
.Xr adc 4 ,
.Xr sci 4 ,
.Xr scif 4 ,
.Xr wdog 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.5 .
