NetBSD/src/share/man/man4/sht3xtemp.4
.\" $NetBSD: sht3xtemp.4,v 1.5 2025/01/24 03:47:47 uwe Exp $
.\"
.\" Copyright (c) 2021 Brad Spencer <brad@anduin.eldar.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd October 31, 2021
.Dt SHT3XTEMP 4
.Os
.Sh NAME
.Nm sht3xtemp
.Nd Driver for Sensirion SHT30/SHT31/SHT35 sensor chip via I2C bus
.Sh SYNOPSIS
.Cd "sht3xtemp* at iic? addr 0x44"
.Cd "sht3xtemp* at iic? addr 0x45"
.Sh DESCRIPTION
The
.Nm
driver provides measurements from the SHT30/SHT31/SHT35 humidity/temperature
sensors via the
.Xr envsys 4
framework.
The
.Nm
.Ar addr
locator selects the address at the
.Xr iic 4
bus.
The mode of operation, repeatability, heater controls, periodic update rate
and CRC validity can be changed through
.Xr sysctl 8
nodes.
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 8
variables are provided:
.Bl -tag -width Li
.It Li hw.sht3xtemp0.modes
Lists the modes supported by the driver and chip.
.It Li hw.sht3xtemp0.mode
Set the operation mode of the chip.
The SHT3X chip can run in a single-shot measurement mode or a
periodic update mode.
Use one of the strings listed in
.Li hw.sht3xtemp.modes .
.It Li hw.sht3xtemp0.rates
List the periodic update rates supported by the driver and chip.
.It Li hw.sht3xtemp0.rate
Set the periodic update rate when the mode of operation is set to
periodic.
The unit for this is measurements per second, or ART which is a
mode that operates at an update rate of 4Hz higher response time.
Use one of the strings listed in
.Li hw.sht3xtemp.rates .
.Pp
Since it is possible to have subsecond periodic updates from the
chip if so desired a device file is provided that can be used to
get the raw temperature and humidity values outside of the
.Xr envsys 4
framework.
The structure of this output is the raw temperature plus an 8-bit CRC
followed by the raw humidity plus an 8-bit CRC.
.It Li hw.sht3xtemp0.repeatabilities
List the valid values for the repeatability used for a measurement.
.It Li hw.sht3xtemp0.repeatability
Set the repeatability for the measurement.
The higher the repeatability the longer the measurement will take
and the more power used.
Use one of the strings listed in
.Li hw.sht3xtemp.repeatabilities .
.It Li hw.sht3xtemp0.ignorecrc
If set, the crc calculation for %RH and temperature in the measurement phrase
will be ignored.
.It Li hw.sht3xtemp0.heateron
Turn the heater on and off.
.It Li hw.sht3xtemp0.debug
If the driver is compiled with
.Dv SHT3X_DEBUG ,
this node will appear and can be used to set the debugging level.
.It Li hw.sht3xtemp0.readattempts
To read %RH or temperature the chip requires that the command be sent,
then a delay must be observed before a read can be done to get the values
back.
The delays are documented in the datasheet for the chip.
The driver will attempt to read back the values readattempts number of
times.
The default is 10 which should be more than enough for most purposes.
.It Li hw.sht3xtemp0.clockstretch
The chip supports a set of commands that lets it use I2C clock
stretching to perform the temperature or humidity measurement.
If this is set to 1 then use the clock stretching commands with the
device.
Note that the I2C controller must support clock stretching in order
for this to work reliability.
When this option is enabled, the readattempts sysctl noted above will
not be used.
This option only apply to single shot measurements.
.El
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/sht3xtemp Ns Ar u
SHT3X device unit
.Ar u
file.
.El
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr iic 4 ,
.Xr envstat 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 10.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Brad Spencer Aq Mt brad@anduin.eldar.org .
.Sh BUGS
The datasheet did not provide enough information to get the alarm
function of the chip working.
