NetBSD/src/share/man/man4/sht4xtemp.4
.\" $NetBSD: sht4xtemp.4,v 1.1 2021/10/03 17:27:02 brad Exp $
.\"
.\" Copyright (c) 2021 Brad Spencer <brad@anduin.eldar.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd September 28th, 2021
.Dt SHT4XTEMP 4
.Os
.Sh NAME
.Nm sht4xtemp
.Nd Driver for Sensirion SHT40/SHT41/SHT45 sensor chip via I2C bus
.Sh SYNOPSIS
.Cd "sht4xtemp* at iic? addr 0x44"
.Sh DESCRIPTION
The
.Nm
driver provides measurements from the SHT40/SHT41/SHT45 humidity/temperature
sensors via the
.Xr envsys 4
framework.
The
.Nm
.Ar addr
argument selects the address at the
.Xr iic 4
bus.
The resolution, heater controls and crc validity can be changed through
.Xr sysctl 8
nodes.
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 3
variables are provided:
.Bl -tag -width indent
.It hw.sht4xtemp0.resolutions
Lists the resolutions supported by the driver and chip.
.It hw.sht4xtemp0.resolution
Set the resolution, or number of bits, used for %RH and temperature.
Use one of the strings listed in hw.sht4xtemp.resolutions.
.It hw.sht4xtemp0.ignorecrc
If set, the crc calculation for %RH and temperature will be ignored.
.It hw.sht4xtemp0.heateron
Turn the heater on and off.  Please note that the heater is turned on right
before the measurement and runs for a pulse width of time.  Then the measurement
is taken and the heater is turned off.  There is no way to keep the heater running
with this chip.
.It hw.sht4xtemp0.heaterstrength
From 1 to 3, the amount of energy put into the heater.
The higher the number, the more power used.
.It hw.sht4xtemp0.heaterpulses
Lists the valid heater pulses supported by the driver and chip.
.It hw.sht4xtemp0.heaterpulse
Set the heater pulse length.  Use one of the strings listed in
hw.sht4xtemp.heaterpulses
.It hw.sht4xtemp0.debug
If the driver is compiled with
.Dv SI70XX_DEBUG ,
this node will appear and can be used to set the debugging level.
.It hw.sht4xtemp0.readattempts
To read %RH or temperature the chip requires that the command be sent,
then a delay must be observed before a read can be done to get the values
back.  The delays are documented in the datasheet for the chip.
The driver will attempt to read back the values readattempts number of
times.
The default is 10 which should be more than enough for most purposes.
.El
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr iic 4 ,
.Xr envstat 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 10.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Brad Spencer Aq Mt brad@anduin.eldar.org .
