NetBSD/src/share/man/man4/si70xxtemp.4
.\" $NetBSD: si70xxtemp.4,v 1.7 2021/11/12 15:12:11 brad Exp $
.\"
.\" Copyright (c) 2017 Brad Spencer <brad@anduin.eldar.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd December 28, 2017
.Dt SI70XXTEMP 4
.Os
.Sh NAME
.Nm si70xxtemp
.Nd Driver for Silicon Labs SI7013/SI7020/SI7021, HTU21D and SHT21 sensor chip via I2C bus
.Sh SYNOPSIS
.Cd "si70xxtemp* at iic? addr 0x40"
.Sh DESCRIPTION
The
.Nm
driver provides measurements from the SI7013/SI7020/SI7021 humidity/temperature
sensors via the
.Xr envsys 4
framework.
The
.Nm
.Ar addr
argument selects the address at the
.Xr iic 4
bus.
The resolution, heater control and crc validity can be changed through
.Xr sysctl 8
nodes.
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 3
variables are provided:
.Bl -tag -width indent
.It hw.si70xxtemp0.resolutions
Lists the resolutions supported by the driver and chip.
.It hw.si70xxtemp0.resolution
Set the resolution, or number of bits, used for %RH and temperature.
Use one of the strings listed in hw.si70xxtemp.resolutions.
.It hw.si70xxtemp0.ignorecrc
If set, the crc calculation for %RH and temperature will be ignored.
.It hw.si70xxtemp0.vddok
If 1, the chip is getting enough power.
.It hw.si70xxtemp0.heateron
Turn the heater on and off.
.It hw.si70xxtemp0.heaterstrength
From 1 to 6, the amount of energy put into the heater.
The higher the number, the more power used.
.Pp
Some HTU21D chips do not support a heater register.
These chips are detected and the heater features of the driver will
be disabled.
.It hw.si70xxtemp0.debug
If the driver is compiled with
.Dv SI70XX_DEBUG ,
this node will appear and can be used to set the debugging level.
.It hw.si70xxtemp0.readattempts
To read %RH or temperature the driver uses a No Hold Master command.
This command needs to be sent to the device, a wait must then occur
and then another read command is sent to read back the values.
Depending on the resolution, and other factors, the wait time varies.
The driver will attempt to read back the values readattempts number of
times.
The default is 40 which should be enough for most purposes.
There is an initial wait of 10,500 microseconds followed by
a additional 1,000 microseconds per read attempt.
.El
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr iic 4 ,
.Xr envstat 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 8.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Brad Spencer Aq Mt brad@anduin.eldar.org .
