NetBSD/src/share/man/man4/siop.4
.\"	$NetBSD: siop.4,v 1.1 2000/05/15 06:31:57 bouyer Exp $
.\"
.\" Copyright (c) 2000 Manuel Bouyer.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,     
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"

.Dd May 15, 2000
.Dt siop 4
.Os
.Sh NAME
.Nm siop
.Nd Symbios Logic/NCR 53c8xx SCSI driver
.Sh SYNOPSIS
.Cd "siop* at pci? dev ? function ?"
.Cd "scsibus* at siop?"
.Sh DESCRIPTION
The
.Nm
driver support the Symbios Logic/NCR 53x8xx serie of SCSI controllers chips:
.Bl -dash -compact -offset indent
.It
53c810, 53c810a and 53c815 (fast scsi)
.It
53c820, 53c825 and 53c825a (fast wide scsi)
.It
53c860 (ultra scsi)
.It
53c875 and 53c875j (ultra-wide scsi)
.It
53c876 (dual ultra-wide scsi)
.It
53c885 (ultra-wide scsi + ethernet)
.It
53c895 (ultra2-wide scsi)
.It
53c896 (PCI 64bit, dual ultra2-wide scsi)
.El 

.Sh BUGS
This driver is still being worked on, some features are not used and
performances are not optimal. However it appears to be more robust than the
.Xr ncr 4
driver.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr ncr 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4 ,
.Xr cd 4 ,
.Xr ch 4 ,
.Xr uk 4

.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 1.5 .

.Sh AUTHOR
The
.Nm
driver was written by
.An Manuel Bouyer Aq Manuel.Bouyer@lip6.fr
for
.Nx .
