NetBSD/src/share/man/man4/sl.4
.\"	$NetBSD: sl.4,v 1.3 1998/04/30 05:42:40 fair Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From:	@(#)lo.4	8.1 (Berkeley) 6/5/93
.\"
.Dd August 10, 1996
.Dt SL 4
.Os NetBSD
.Sh NAME
.Nm sl
.Nd Serial Line IP (SLIP) network interface
.Sh SYNOPSIS
.Cd pseudo-device sl Op Ar count
.Sh DESCRIPTION
The
.Nm
interface allows asynchronous serial lines to be used as
.Tn IP 
network interfaces using the
.Tn SLIP
protocol.
The
.Nm
interface can use Van Jacobson
.Tn TCP
header compression and
.Tn ICMP
filtering.
.Pp
However,
.Tn SLIP
can only transmit
.Tn IP
packets between preconfigured hosts on an asynchronous serial link.
It has no provision for address negotiation,
carriage of additional protocols (e.g.
.Tn XNS ,
.Tn AppleTalk ,
.Tn DECNET ) ,
and is not designed for synchronous serial links.
This is why
.Tn SLIP
has been superceded by the Point-to-Point Protocol
.Pq Tn PPP ,
which does all of those things, and much more.
.Sh DIAGNOSTICS
.Bl -diag
.It sl%d: af%d not supported.
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4 ,
.Xr ppp 4 ,
.Xr slattach 8 ,
.Xr sliplogin 8 ,
.Xr slstats 8
.Rs
.%J RFC
.%N 1055
.%A John Romkey
.%D June 1988
.%T "A Nonstandard for Transmission of IP Datagrams over Serial Lines: SLIP"
.Re
.Sh HISTORY
The
.Nm
device appeared in
.Nx 1.0 .
