NetBSD/src/share/man/man4/slhci.4
.\" $NetBSD: slhci.4,v 1.4 2003/02/14 15:20:19 grant Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Tetsuya Isaki.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by the NetBSD
.\"      Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 11, 2002
.Dt SLHCI 4
.Os
.Sh NAME
.Nm slhci
.Nd ScanLogic SL811HS/T USB Host Controller driver
.Sh SYNOPSIS
.Ss ISA controllers
.Cd "slhci*   at isa? port ? irq ?"
.Cd "usb*     at slhci?"
.Ss x68k
.Cd "slhci0   at intio0 addr 0xece380 intr 251"
.Cd "slhci1   at intio0 addr 0xeceb80 intr 250"
.Cd "usb*     at slhci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for ScanLogic SL811HS/T USB Host Controller.
.Sh SEE ALSO
.Xr isa 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver appeared in
.Nx 2.0 .
.Sh AUTHORS
.An Tetsuya Isaki
.Aq isaki@NetBSD.org
.Sh BUGS
There are many bugs.
.Pp
There is no support (yet) for Low Speed devices both
connected directly or connected via external HUBs.
.Pp
There is no support yet bulk and isochronous transfers.
