NetBSD/src/share/man/man4/slurm.4
.\" $NetBSD: slurm.4,v 1.1 2022/07/08 16:50:10 nia Exp $
.\"
.\" Copyright (c) 2022 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 8, 2022
.Dt SLURM 4
.Os
.Sh NAME
.Nm slurm
.Nd Silicon Labs USB FM radio device driver
.Sh SYNOPSIS
.Cd "slurm* at uhub? port ?"
.Cd "radio* at slurm?"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB FM radios based on the Silicon Labs
si470x reference design, such as the Instant FM Music RDX-155.
.Pp
Programs such as
.Xr radioctl 1
can control the device using the
.Xr radio 4
interface.
The device supports: querying and setting frequency, volume, signal,
and stereo status, as well as searching for stations.
.Sh SEE ALSO
.Xr radioctl 1 ,
.Xr radio 4 ,
.Xr uaudio 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jonathan A. Kollasch .
