NetBSD/src/share/man/man4/smscmon.4
.\"	$NetBSD: smscmon.4,v 1.1 2010/02/22 03:54:24 pgoyette Exp $
.\"
.\" Copyright (c) 2009 Takahiro Hayashi
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 21, 2010
.Dt SMSCMON 4
.Os
.Sh NAME
.Nm smscmon
.Nd Standard Microsystems Corporation LPC47M192 Super I/O
.Sh SYNOPSIS
.Cd "smscmon0 at iic? addr 0x2c"
.Cd "smscmon0 at iic? addr 0x2d"
.Sh DESCRIPTION
The
.Nm
driver provides support for the hardware monitoring portion of the
.Tn Standard Microsystems Corporation
LPC47M192 and LPC47M997 Super I/O chips to be used with the
.Xr envsys 4
API.
.Pp
The chip supports 11 sensor inputs:
.Bl -column "Sensor" "Units" "Typical" -offset indent
.It Sy "Sensor" Ta Sy "Units" Ta Sy "Typical Use"
.It Li "+2.5V" Ta "uV DC" Ta "2.5V Supply"
.It Li "Vccp" Ta "uV DC" Ta "CPU Vcore"
.It Li "+3.3V" Ta "uV DC" Ta "3.3V Supply"
.It Li "+5V" Ta "uV DC" Ta "%5 Supply"
.It Li "+12V" Ta "uV DC" Ta "12V Supply"
.It Li "Vcc" Ta "uV DC" Ta "Chip's supply voltage"
.It Li "+1.5V" Ta "uV DC" Ta "1.5V Supply"
.It Li "+1.8V" Ta "uV DC" Ta "1.8V Supply"
.It Li "Remote Temp1" Ta "uK" Ta "CPU temperature"
.It Li "Ambient Temp" Ta "uK" Ta "Local chip temperature"
.It Li "Remote Temp2" Ta "uK"
.El
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr envstat 8
.Sh HISTORY
The
.Nm
device appeared in
.Nx 6.0 .
.Sh AUTHOR
The
.Nm
driver was written by Takahiro Hayashi.
