NetBSD/src/share/man/man4/spc.4
.\"	$NetBSD: spc.4,v 1.4 2008/05/14 13:29:27 tsutsui Exp $
.\"
.\" Copyright (c) 2003 Izumi Tsutsui.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 1, 2006
.Dt SPC 4
.Os
.Sh NAME
.Nm spc
.Nd Fujitsu MB87030/MB89352 SCSI driver
.Sh SYNOPSIS
.Cd "spc* at pcmcia? function ?"
.Ss hp300
.Cd "spc0 at dio? scode ?"
.Ss luna68k
.Cd "spc0 at mainbus0"
.Ss x68k
.Cd "spc0 at scsirom0"
.Cd "spc1 at scsirom1"
.Pp
.Cd "scsibus* at spc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn Fujitsu
MB87030/MB89352
.Tn SCSI
Protocol Controller (SPC) chips.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr intro 4 ,
.Xr pcmcia 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr ss 4 ,
.Xr st 4 ,
.Xr uk 4 ,
.Xr scsipi 9
.Sh BUGS
Synchronous data transfers are not currently supported.
