NetBSD/src/share/man/man4/ss.4
.\"	$NetBSD: ss.4,v 1.1 1998/06/10 11:15:22 fair Exp $
.\"
.Dd June 10, 1998
.Dt SS 4
.Os NetBSD
.Sh NAME
.Nm ss
.Nd SCSI scanner driver
.Sh SYNOPSIS
.Cd "ss* at scsibus? target ? lun ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for
.Tn SCSI
bus based document scanners.
.Sh FILES
.Bl -tag -width /dev/rsdXXXXX -compact
.It Pa /dev/ss Ns Ar u
.Tn SCSI
bus scanner unit
.Ar u
.It Pa /dev/nss Ns Ar u
.Tn SCSI
bus scanner unit
.Ar u
\- no rewind.
.It Pa /dev/enss Ns Ar u
.Tn SCSI
bus scanner unit
.Ar u
\-
.Xr ioctl 2
operations only.
.El
.Sh SEE ALSO
.Xr scsi 4
.Sh AUTHORS
Kenneth Stailey,
Joachim Koenig
