NetBSD/src/share/man/man4/ssdfb.4
.\"	$NetBSD: ssdfb.4,v 1.3 2019/03/17 11:20:36 wiz Exp $
.\"
.\" Copyright (c) 2019 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Tobias Nygren.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 17, 2019
.Dt SSDFB 4
.Os
.Sh NAME
.Nm ssdfb
.Nd OLED/PLED framebuffer device driver
.Sh SYNOPSIS
.Cd "options FONT_SPLEEN5x8"
.Cd "ssdfb* at iic? addr ?"
.Cd "ssdfb* at iic? addr 0x3c"
.Cd "ssdfb* at iic? addr 0x3d flags 0x102"
.Cd "wsdisplay* at ssdfb?"
.Sh DESCRIPTION
The
.Nm
driver provides
.Xr wsdisplay 4
support for OLED/PLED framebuffer modules based on one
of the following controller chips:
.Bl -bullet -offset indent
.It
Solomon Systech Ltd SSD1306
.It
Sino Wealth Electronic Ltd SH1106
.El
.Pp
The following products (controller + panel assemblies) are supported:
.Bl -bullet -offset indent
.It
.Em 0x01 :
Generic SSD1306 modules using default settings
.It
.Em 0x02 :
Generic SH1106 modules using default settings
.It
.Em 0x03 :
Adafruit Industries, LLC product 938 (128x64)
.It
.Em 0x04 :
Adafruit Industries, LLC product 931 (128x32)
.El
.Pp
The flags value can contain one or more of the following, bitwise OR'ed:
.Bl -bullet -offset indent
.It
.Em 0x0?? :
Exactly one product id from the above list
.It
.Em 0x100 :
indicates that the display is mounted upside down and flips the screen
.It
.Em 0x200 :
enable inverse video
.It
.Em 0x400 :
forcibly attach as console
.El
.Sh SEE ALSO
.Xr iic 4 ,
.Xr wsdisplay 4
.Sh HISTORY
An
.Nm
driver first appeared in
.Ox 6.4
and later in
.Nx 9.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver
was written by
.An Tobias Nygren Aq Mt tnn@NetBSD.org .
.Pp
It was inspired by (and shares its name with) the
.Ox
driver written by
.An Patrick Wildt Aq Mt patrick@blueri.se
but does not share any code.
.Sh BUGS
Some modules can be reconfigured to attach via
.Xr spi 4 ,
typically by moving surface mount zero ohm resistors.
This is currently not supported.
