NetBSD/src/share/man/man4/swsensor.4
.\"	$NetBSD: swsensor.4,v 1.2.2.2 2010/10/22 07:11:53 uebayasi Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Paul Goyette.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 19, 2010
.Dt SWSENSOR 4
.Os
.Sh NAME
.Nm swsensor
.Nd software environmental sensor
.Sh SYNOPSIS
.Cd "pseudo-device swsensor"
.Sh DESCRIPTION
The
.Nm
driver provides a software environmental sensor that works with
.Xr  sysctl 8
and
.Xr envstat 8 .
The driver creates a single sensor which is intended to be loaded as a
kernel module.
By default, the sensor is of type
.Dv ENVSYS_UNITS_INTEGER .
This can be overridden when the module is loaded by passing the desired
sensor type in the property list with
.Xr modload 8 .
For example,
.Dl Ic modload -i type=1 swsensor
will create a sensor of type
.Dv ENVSYS_UNITS_SFANRPM .
.Pp
The sensor's raw value can be manually updated by modifying the
.Xr sysctl 8
variable
.Dq hw.swsensor.cur_value .
.Sh SEE ALSO
.Xr modctl 2 ,
.Xr envstat 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver was written by
.An Paul Goyette
and first appeared in
.Nx 6.0 .
