NetBSD/src/share/man/man4/sysmon.4
.\" $NetBSD: sysmon.4,v 1.1 2011/06/22 19:34:53 jruoho Exp $
.\"
.\" Copyright (c) 2011 Jukka Ruohonen <jruohonen@iki.fi>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
.\" OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
.\" OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 22, 2011
.Dt SYSMON 4
.Os
.Sh NAME
.Nm sysmon
.Nd system monitoring and power management interface
.Sh DESCRIPTION
The machine-independent
.Nm
is a general purpose framework for system monitorin and power management.
The main components of
.Nm
include:
.Bl -bullet -offset indent
.It
An
.Xr ioctl 2
interface available via
.Pa /dev/sysmon .
The userland counterparts
include utilities such as
.Xr envstat 8
and daemons such as
.Xr powerd 8 .
.It
An interface for the purpose of delivering different
system and power events to userspace;
.Xr sysmon_pswitch 9 .
.It
A general purpose sensor framework,
.Xr sysmon_envsys 9 .
.It
A general purpose task queue,
.Xr sysmon_taskq 9 .
.It
An interface for watchdog timers.
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr swsensor 4 ,
.Xr envstat 8 ,
.Xr powerd 8 ,
.Xr wdogctl 8 ,
.Xr pmf 9
.Sh FILES
.Bd -literal
/dev/sysmon
.Ed
.Sh AUTHORS
.An Jason R. Thorpe Aq thorpej@NetBSD.org
