NetBSD/src/share/man/man4/tcu.4
.\"     $NetBSD: tcu.4,v 1.2 2016/08/18 19:22:45 wiz Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 9, 2016
.Dt TCU 4
.Os
.Sh NAME
.Nm tcu
.Nd TURBOchannel USB host options
.Sh SYNOPSIS
.Cd "tcu*    at tc? slot ? offset ?"
.Pp
.Cd "slhci*  at tcu?"
.Cd "usb*    at slhci?"
.Pp
.Cd "gpio*   at gpiobus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the flxd TC-USB TURBOchannel USB host options based
upon a Cypress SL811HST USB 1.1 host controller and a glue logic CPLD.
USB is handled by the
.Xr slhci 4
driver.
Eight GPIO pins provided by the CPLD can be accessed through the
.Xr gpio 4
driver.
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr slhci 4 ,
.Xr tc 4 ,
.Xr usb 4
