NetBSD/src/share/man/man4/tdvfb.4
.\"	$NetBSD: tdvfb.4,v 1.1 2012/07/19 08:57:09 rkujawa Exp $
.\"
.\" Copyright (c) 2012 Radoslaw Kujawa
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 19, 2012
.Dt TDVFB 4
.Os
.Sh NAME
.Nm tdvfb
.Nd 3Dfx Voodoo 2 framebuffer driver
.Sh SYNOPSIS
.Cd "tdvfb* at pci?"
.Cd "wsdisplay* at tdvfb?"
.Cd "options TDVFB_CONSOLE"
.Sh DESCRIPTION
The
.Nm
driver provides support for the 3Dfx Voodoo 2 graphics card and provides an
interface for machine independent
.Xr wscons 4
driver.
.Pp
Since Voodoo2 was originally designed as a 3D-only solution, most boards do not
have any kind of firmware.
The
.Nm
driver is albe to do low level initialization (boot) of the board, which means
that it can be used on all architectures and is truly machine independent.
However, it also means that driver is can not detect automatically if Voodoo2
is used as a console.
.Dv TDVFB_CONSOLE
option is provided and should be set if the
.Nm
driver is intended to be used as a console.
.Sh SEE ALSO
.Xr genfb 4 ,
.Xr voodoofb 4 ,
.Xr wsdisplay 4
.Rs
.%A 3Dfx Interactive, Inc.
.%T Voodoo2 Graphics Engine for 3D Game Acceleration
.%N Revision 1.16
.%D December 1, 1999
.Re
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa .
3Dfx Glide 2.x source code, Linux driver by
.An Ghozlane Toumi
were used as reference.
The
.Xr wscons 4
attachment code is based mostly on a
.Xr genfb 4
driver by
.An Michael Lorenz .
.Sh BUGS
The
.Nm 
driver is unaccelerated. 3Dfx Voodoo2 has a simple 2D graphics engine but it is
unsupported yet.
.Pp
Video mode is hard coded to 800x600 at 60Hz in 32-bits, it should be selectable
at least via kernel configuration file. 
It is not possibe to detect what resolutions are supported by the monitor,
since Voodoo2 has no DDC interface.
.Pp
8-bit depth is not supported by the hardware. 
16-bit depth is supported by the hardware and is a prefered depth, however it 
does not work corretly at the moment (this is a driver problem).
