NetBSD/src/share/man/man4/thinkpad.4
.\"	$NetBSD: thinkpad.4,v 1.4 2014/03/18 18:20:39 riastradh Exp $
.\"
.\" Copyright (c) 2008 Jared D. McNeill <jmcneill@invisible.ca>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 9, 2010
.Dt THINKPAD 4
.Os
.Sh NAME
.Nm thinkpad
.Nd IBM/Lenovo Thinkpad laptop features support
.Sh SYNOPSIS
.Cd "thinkpad* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for vendor specific features found in IBM and
Lenovo brand laptops, such as function key handling, hotkey handling, and
temperature and fan monitoring.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr aps 4 ,
.Xr pmf 9 ,
.Xr sysmon_envsys 9
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 5.0 .
.Sh AUTHORS
.An Jared D. McNeill Aq Mt jmcneill@invisible.ca
