NetBSD/src/share/man/man4/tl.4
.\"	$NetBSD: tl.4,v 1.11 2000/05/15 06:33:22 bouyer Exp $
.\"
.\" Copyright (c) 1997 Manuel Bouyer
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Manuel Bouyer
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,    
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 17, 1997
.Dt TL 4
.Os
.Sh NAME
.Nm tl
.Nd Ethernet driver for Texas Instruments ThunderLAN based board
.Sh SYNOPSIS
.Cd "tl* at pci? dev ? function ?"
.Pp
Configuration of PHYs are necessary.  See
.Xr mii 4 .
.Sh DESCRIPTION
The
.Nm tl
device driver supports network adapters based on
the Texas Instruments ThunderLAN chip.
.Sh HARDWARE
Supported cards include:
.Pp
.Bl -tag -width xxxxxx -offset indent
.It Compaq Netelligent 
in baseboard and PCI variants (10bT-only variant untested).
.It Compaq NetFlex 3/P
in baseboard variant only (the PCI variant doesn't use the same chip !).
.It Baseboard Compaq Deskpro 4000 5233MMX Ethernet (untested).
.It TI TravelMate 5000 series laptop docking station's Ethernet board.
.El
.Sh MEDIA SELECTION
The different models of the supported boards come with some subset of RJ-45,
BNC and AUI connectors.  Media selection is done using
.Xr ifconfig 8
using the standard
.Xr ifmedia 4
mechanism.  Refer to those manual pages for more information.
.Pp
The
.Nm 
driver don't have full automatic media selection. By default it will do an NWay
on the UTP port for negotiation of the speed and duplex mode with the
link partner. If the AUI or BNC port is used, an explicit medium must be
specified to
.Xr ifconfig 8
or in your /etc/ifconfig.tl? file.
.in -4
.Sh BUGS
The board marked as untested will always claim having an AUI connector, where
it may be a BNC one.
.Pp
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr mii 4
