NetBSD/src/share/man/man4/tpm.4
.\"	$NetBSD: tpm.4,v 1.7 2021/01/19 05:05:39 riastradh Exp $
.\"
.\" Copyright (c) 2019 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Maxime Villard.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 15, 2021
.Dt TPM 4
.Os
.Sh NAME
.Nm tpm
.Nd Trusted Platform Module
.Sh SYNOPSIS
.Cd "tpm* at isa? iomem 0xfed40000"
.Cd "tpm* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver provides support for various Trusted Platform Module (TPM) chips.
.Pp
Supported modules:
.Pp
.Bl -bullet -compact -offset indent
.It
TPM 2.0 chips over ACPI
.It
TPM 1.2 chips over ACPI and ISA
.El
.Pp
Note that the supported interface version is TIS1.2 in each case.
.Pp
The TPM may need to be enabled in the system's firmware or BIOS, which
requires a reboot to take effect.
This is generally beyond the control of
.Nx .
Enabling a TPM does not require using trusted boot \(em it can be
enabled, for example, only for the
.Xr rnd 4
entropy source.
.Sh SEE ALSO
.Xr config 1 ,
.Xr intro 4 ,
.Xr rnd 4
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Maxime Villard ,
.An Michael Shalayeff
and
.An Hans-Joerg Hoexer .
