NetBSD/src/share/man/man4/tpm.4
.\"	$NetBSD: tpm.4,v 1.2.4.2 2012/04/17 00:05:46 yamt Exp $
.\"
.\" Copyright (c) 2010 Hans-Jörg Höxer, <Hans-Joerg.Hoexer@genua.de>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd January 22, 2012
.Dt TPM 4
.Os
.Sh NAME
.Nm tpm
.Nd Trusted Platform Module
.Sh SYNOPSIS
.Cd "tpm* at isa? iomem 0xfed40000"
.Cd "tpm* at isa? iomem 0xfed40000 irq 7"
.Sh DESCRIPTION
The
.Nm
driver provides support for various trusted platfrom modules (TPM) that can
store cryptographic keys.
.Pp
Supported modules:
.Pp
.Bl -bullet -compact -offset indent
.It
Atmel 97SC3203
.It
Broadcom BCM0102
.It
Infineon IFX SLD 9630 TT 1.1 and IFX SLB 9635 TT 1.2
.It
Intel INTC0102
.It
Sinosun SNS SSX35
.It
STM ST19WP18
.It
Winbond WEC WPCT200
.El
.Pp
The driver can be configured to use an IRQ by providing a free ISA
interrupt vector using the keyword
.Em irq
in the kernel configuration file or using
.Xr config 1 .
If not IRQ is specified, the driver uses polling.
This is the default configuration.
.Sh SEE ALSO
.Xr config 1 ,
.Xr intro 4
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Michael Shalayeff
and
.An Hans-Joerg Hoexer .
