NetBSD/src/share/man/man4/tprof.4
.\"	$NetBSD: tprof.4,v 1.4 2018/12/12 08:28:19 maxv Exp $
.\"
.\" Copyright (c)2011 YAMAMOTO Takashi,
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" ------------------------------------------------------------
.Dd December 12, 2018
.Dt TPROF 4
.Os
.\" ------------------------------------------------------------
.Sh NAME
.Nm tprof
.Nd a sampling based profiler
.\" ------------------------------------------------------------
.Sh SYNOPSIS
.Cd pseudo-device tprof
.\" ------------------------------------------------------------
.Sh DESCRIPTION
The
.Nm
driver provides kernel services necessary for
.Xr tprof 8 .
.Pp
Specifically, it makes its backend driver collect profiling samples and
provide them to the userland consumer.
.Pp
The API/ABI is currently undocumented and will likely change in future
without keeping compatibility.
.Pp
On x86, the tprof_x86 module must be loaded in addition to the
.Nm
driver.
.\" ------------------------------------------------------------
.\".Sh EXAMPLES
.\" ------------------------------------------------------------
.Sh SEE ALSO
.Xr tprof 8
.\" ------------------------------------------------------------
.\".Sh HISTORY
.\"The
.\".Nm
.\"driver first appeared in
.\".Nx 4.0 .
.\" ------------------------------------------------------------
.Sh AUTHORS
The
.Nm
driver was written by
.An YAMAMOTO Takashi .
.\" ------------------------------------------------------------
.Sh BUGS
There is no way to configure multiple backend drivers statically.
