NetBSD/src/share/man/man4/tps65217pmic.4
.\" $NetBSD: tps65217pmic.4,v 1.2 2013/04/26 20:57:48 wiz Exp $
.\"
.\" Copyright (c) 2013 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 26, 2013
.Dt TPS65217PMIC 4
.Os
.Sh NAME
.Nm tps65217pmic
.Nd Texas Instruments TPS65217 Power Management IC driver
.Sh SYNOPSIS
.Cd "tps65217pmic0 at iic? addr 0x24"
.Sh DESCRIPTION
The
.Nm
driver provides minimal support for the TPS65217 chip and allows reporting
regulated voltages through the
.Xr envsys 4
API.
.Sh SEE ALSO
.Xr envsys 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq radoslaw.kujawa@gmail.com .
.Sh CAVEATS
The driver can only report current voltage regulator settings.
It can not measure the real voltage, as the TPS65217 chip lacks hardware to do
that.
.Pp
Modifying voltage regulator parameters was deliberately left unimplemented, as
these parameters should only be set at the firmware level.
Setting wrong parameters may result in permanent hardware damage.
.Sh BUGS
Battery and interrupt support is not implemented.
