NetBSD/src/share/man/man4/twe.4
.\"	$NetBSD: twe.4,v 1.2 2000/10/20 15:14:25 ad Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Andrew Doran.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 17, 2000
.Dt TWE 4
.Os
.Sh NAME
.Nm twe
.Nd
.Tn 3ware Escalade RAID controller driver
.Sh SYNOPSIS
.Cd "twe* at pci? dev ? function ?"
.Cd options TWE_MAX_QUEUECNT=n
.Cd options TWE_MAX_PU_QUEUECNT=n
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Tn 3ware Escalade
family of RAID controllers.
Attached disk arrays are supported by the
.Nm lsu
driver.
.Pp
The following kernel configuration options are available:
.Bl -ohang
.It Cd options TWE_MAX_QUEUECNT=n
Set the maximum queued command count to
.Ar n
commands.
The default value is 128.
The maximum value that the underlying hardware can support is 256.
.It Cd options TWE_MAX_PI_QUEUECNT=n
Set the maximum per-unit queued command count to
.Ar n
commands.
The default value is 32.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr lsu 4
.Sh AUTHOR
The
.Nm
driver was written by
by Andrew Doran
.Aq ad@netbsd.org .
Some parts of the driver are derived from code written by Micheal Smith
.Aq msmith@freebsd.org .
.Sh HISTORY
The
.Nm twe
driver first appeared in
.Nx 1.6 .
