NetBSD/src/share/man/man4/ualea.4
.\" $NetBSD: ualea.4,v 1.2.4.2 2017/04/26 02:52:58 pgoyette Exp $
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Taylor R. Campbell.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 18, 2017
.Dt UALEA 4
.Os
.Sh NAME
.Nm ualea
.Nd USB Araneus Alea I/II TRNG
.Sh SYNOPSIS
.Cd "ualea* at uhub? port ? configuration ? interface ?"
.Sh DESCRIPTION
The
.Nm
driver reads data generated randomly by an Araneus Alea I/II device and
adds it to the kernel entropy pool.
.Sh SEE ALSO
.Xr rnd 4 ,
.Lk https://www.araneus.fi/products/alea2/en/
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 8.0 .
.Sh AUTHORS
.An Taylor R Campbell Aq Mt riastradh@NetBSD.org
.Sh CAVEATS
Destruction of an Alea II TRNG device with a consumer-grade laundry
washing machine is ineffective.
