NetBSD/src/share/man/man4/udl.4
.\" $NetBSD: udl.4,v 1.1 2022/07/10 19:49:24 nia Exp $
.\"
.\" Copyright (c) 2022 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 10, 2022
.Dt UDL 4
.Os
.Sh NAME
.Nm udl
.Nd DisplayLink DL-1x0/1x5 USB display device driver
.Sh SYNOPSIS
.Cd "udl* at uhub?"
.Cd "wsdisplay* at udl?"
.Sh DESCRIPTION
The
.Nm
driver provides support for DisplayLink DL-1x0/1x5 based USB LCD screens,
docks, and display adapters.
.Pp
The following devices are supported:
.Pp
.Bl -bullet -offset indent -compact
.It
Buffalo GX-DVI/U2B
.It
Century Japan Plus One LCD-8000U
.It
Century Japan Plus One LCD-4300U
.It
DisplayLink DVI adapter
.It
HP Docking Station
.It
HP USB DVI (NL571)
.It
IOGEAR DVI GUC2020
.It
IO-DATA USB-RGB
.It
IO-DATA LCD-USB7X
.It
IO-DATA LCD-USB10XB-T
.It
Lenovo ThinkVision LT1421
.It
Lilliput UM-70
.It
Logitec LDE-WX015U
.It
Nanovision MiMo
.It
Polaris2 USB dock
.It
Rextron DVI adapter
.It
Samsung LD220
.It
Samsung LD190
.It
Samsung U70
.It
StarTech CONV-USB2DVI
.It
Sunweit USB to DVI adapter
.It
VideoHome NBdock1920
.El
.Sh HISTORY
The
.Nm
device driver appeared in
.Ox 4.6
and
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Marcus Glocker
for
.Ox ,
and ported to
.Nx
with many modifications by
.An Naoki Fukaumi .
