NetBSD/src/share/man/man4/uhso.4
.\" $NetBSD: uhso.4,v 1.1 2010/03/06 21:05:36 plunky Exp $
.\"
.\" Copyright (c) 2009 Iain Hibbert
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 6, 2010
.Dt UHSO 4
.Os
.Sh NAME
.Nm uhso
.Nd Option N.V. Wireless WAN modem driver
.Sh SYNOPSIS
.Cd "uhso*	at uhub? port ?"
.Sh HARDWARE
The
.Nm
driver supports at least the following adapters:
.Lp
.Bl -tag -compact -offset indent
.It GlobeTrotter Max HSDPA
.It GlobeSurfer iCON 7.2
.It GlobeTrotter iCON 225
.It GlobeTrotter Express HSUPA
.It GlobeTrotter HSUPA
.It GlobeSurfer HSUPA
.It GlobeTrotter iCON EDGE
.It GlobeTrotter iCON 321
.It GlobeTrotter iCON 322
.It GlobeTrotter Express 40x
.It GlobeTrotter iCON 401
.It GlobeTrotter Module 382 
.It GlobeTrotter iCON 505
.El
.Sh DESCRIPTION
The
.Tn Option N.V.
modems appear at first as a
.Xr umass 4
device containing the
.Tn Windows
and
.Tn MacOS
drivers and, upon receipt of a SCSI
.Qq REZERO UNIT
command, will detach from the USB bus and reattach as a
Wireless WAN modem.
Unless disabled by clearing the
.Xr sysctl 8
variable
.Dv hw.uhso.autoswitch ,
the driver will handle that automatically.
.Pp
The modems provide a number of IO channels spread over several USB
interfaces which are mapped by function to a standard port number
in each driver instance.
The defined channels are:
.Lp
.Bl -column -offset indent "Sy Channel Name" "Sy Port"
.It Sy "Channel Name" Ta Sy "Port"
.It Control Ta 0
.It Diagnostic Ta 1
.It Diagnostic 2 Ta 2
.It Application Ta 3
.It Application 2 Ta 4
.It GPS Ta 5
.It GPS Control Ta 6
.It PC Smartcard Ta 7
.It Modem Ta 8
.It MSD Ta 9
.It Voice Ta 10
.It Network Ta 11
.El
.Pp
Apart from the Network port, which is attached as a network
interface, the ports are attached as
.Xr tty 4
devices using the port number as the minor device number.
.Pp
Before the Network port can be used, the modem needs to
be placed in connected mode and network settings subsequently
retrieved using the proprietary
.Qq _OWANCALL
and
.Qq _OWANDATA
AT commands on the Control port.
.Pp
Note that the Modem and Network ports should not be enabled at the
same time for USB performance reasons.
.Sh FILES
.Bl -tag -compact
.It Pa /dev/ttyHS?.??
.It Pa /dev/dtyHS?.??
.It Pa /dev/ctyHS?.??
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr tty 4 ,
.Xr uhub 4 ,
.Xr usb 4 ,
.Xr ifconfig 8
.Sh HISTORY
This driver originated as the
.Nm hso
module for
.Fx
written by
.An Frederik Lindberg .
It was rewritten for
.Nx ,
and to provide more complete device support with
information extracted from the
.Nm hso
driver for
.Tn Linux
provided by
.Tn Option N.V.
.Pp
The rewrite and this manual page by
.An Iain Hibbert .
