NetBSD/src/share/man/man4/uintuos.4
.\" $NetBSD: uintuos.4,v 1.1 2022/07/08 08:59:33 nia Exp $
.\"
.\" Copyright (c) 2022 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 8, 2022
.Dt UINTUOS 4
.Os
.Sh NAME
.Nm uintuos
.Nd Wacom Intuos drawing tablet device driver
.Sh SYNOPSIS
.Cd "uintuos* at uhidbus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Wacom Intuos PTS Pen devices.
The device driver returns absolute mouse position events through a
.Xr wsmouse 4
device, similar to a touch
panel.
.Pp
The following devices are supported:
.Bl -bullet -offset indent -compact
.It
Wacom Intuos CTH-490
.It
Wacom Intuos CTL-6100WL
.El
.Sh SEE ALSO
.Xr uhid 4 ,
.Xr usb 4 ,
.Xr wsmouse 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 10.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Yorick Hardy .
