NetBSD/src/share/man/man4/uipad.4
.\" $NetBSD: uipad.4,v 1.3 2017/09/30 13:39:00 wiz Exp $
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Sevan Janiyan.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 30, 2017
.Dt UIPAD 4
.Os
.Sh NAME
.Nm uipad
.Nd USB support for charging iOS devices
.Sh SYNOPSIS
.Cd "uipad* at uhub? port ?"
.Sh HARDWARE
The
.Nm
driver supports the following iOS based devices:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Apple iPad
.It Apple iPad 2
.It Apple iPad 3
.It Apple iPad Mini
.El
.Sh DESCRIPTION
The
.Nm
driver provides support for charging iOS based devices by sending
the magic command to a connected device, instructing it to start
charging.
.Sh SEE ALSO
.Xr uhub 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nx
driver first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An Christos Zoulas Aq Mt christos@NetBSD.org
