NetBSD/src/share/man/man4/umass.4
.\" $NetBSD: umass.4,v 1.14 2001/12/24 18:27:09 augustss Exp $
.\"
.\" Copyright (c) 1999, 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 23, 1999
.Dt UMASS 4
.Os
.Sh NAME
.Nm umass
.Nd USB mass storage support
.Sh SYNOPSIS
.Cd "umass*     at uhub?"
.Cd "atapibus*  at umass? channel ?"
.Cd "scsibus*   at umass? channel ?"
.Cd "wd*        at umass?"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB mass storage class devices.
The driver supports subclasses SCSI, 8020i (ATAPI), 8070i (ATAPI), QIC157 (ATAPI), RBC (subset of SCSI), and UFI (USB Floppy).
The driver handles the protocols Bulk-Only, CBI, and CBI-with-CCI.
.Sh HARDWARE
Devices known to work with this driver include:
.Pp
.Bl -tag -width -offset indent -compact
.It Tn Imation SuperDisk
.It Tn IOmega Zip 100
.It Tn IOmega Zip 250
.It Tn LaCie CD R/W
.It Tn SanDisk ImageMate SDDR-31
.It Tn Y-E Data FlashBuster floppy
.El
.Pp
The driver also supports certain adapters from In-System Design that use
the (non-standardized) ATA protocol over Bulk-Only.
.Sh SEE ALSO
.Xr atapi 4 ,
.Xr scsi 4 ,
.Xr usb 4 ,
.Xr wd 4
.Sh HISTORY
The
.Nm
driver is a port of the
.Fx
driver.  The
.Nm
driver
appeared in
.Nx 1.5 .
