NetBSD/src/share/man/man4/ums.4
.\" $NetBSD: ums.4,v 1.12 2021/06/07 03:04:50 dholland Exp $
.\"
.\" Copyright (c) 1999, 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 6, 2021
.Dt UMS 4
.Os
.Sh NAME
.Nm ums
.Nd USB mouse and touchpanel support
.Sh SYNOPSIS
.Cd "ums*     at uhidev? reportid ?"
.Cd "wsmouse* at ums?"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB mice and touchpanels.
Access to the movement data is through the
.Xr wsmouse 4
driver.
.Pp
Be aware that many USB mice will, if the mouse device is not open,
detach and reattach themselves repeatedly at regular intervals
(usually around one minute) causing spam on the console and the system
log.
This is apparently intentional behavior on the part of the hardware
manufacturers.
The best workaround is to keep the mouse device open, either via 
X11, or, if not using the window system, by running
.Xr wsmoused 8 .
.Sh SEE ALSO
.Xr uhidev 4 ,
.Xr usb 4 ,
.Xr wsmouse 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.4 .
Touchpanel support was added in
.Nx 5.1 .
