NetBSD/src/share/man/man4/ure.4
.\" $NetBSD: ure.4,v 1.3.2.3 2020/04/13 08:03:25 martin Exp $
.\" $OpenBSD: ure.4,v 1.5 2017/04/16 20:26:34 jmc Exp $
.\"
.\" Copyright (c) 2015 Kevin Lo <kevlo@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: head/share/man/man4/ure.4 291557 2015-12-01 05:12:13Z kevlo $
.\"
.Dd August 24, 2019
.Dt URE 4
.Os
.Sh NAME
.Nm ure
.Nd RealTek RTL8152/RTL8153 10/100/Gigabit USB Ethernet device
.Sh SYNOPSIS
.Cd "ure*   at uhub?"
.Cd "rgephy* at mii?"
.Cd "rlphy* at mii?"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB Ethernet adapters based on the RealTek
RTL8152 USB Fast Ethernet devices including:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Cable Matters 202023 USB 2.0 to 10/100 Fast Ethernet Network Adapter
.El
.Pp
and RTL8153 USB Gigabit Ethernet devices including:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Anker A7611 Aluminum USB 3.0 to Ethernet Adapter
.El
.Pp
The RTL8152 contains an integrated Fast Ethernet MAC, which supports
both 10 and 100Mbps speeds in either full or half duplex.
The RTL8153 has a Gigabit Ethernet MAC and additionally supports
1000Mbps speeds.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
See
.Xr usbnet 4
for diagnostics.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr rgephy 4 ,
.Xr rlphy 4 ,
.Xr uhub 4 ,
.Xr usb 4 ,
.Xr usbnet 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 6.0
and
.Nx 9.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Kevin Lo Aq Mt kevlo@FreeBSD.org
for
.Ox
and ported to
.Nx
by
.An Rin Okuyama Aq Mt rin@NetBSD.org .
