NetBSD/src/share/man/man4/urndis.4
.\" $NetBSD: urndis.4,v 1.10 2019/12/29 20:58:34 triaxx Exp $
.\"
.\" Copyright (c) 2010 Michael Knudsen <mk@openbsd.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\"    - Redistributions of source code must retain the above copyright
.\"      notice, this list of conditions and the following disclaimer.
.\"    - Redistributions in binary form must reproduce the above
.\"      copyright notice, this list of conditions and the following
.\"      disclaimer in the documentation and/or other materials provided
.\"      with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $OpenBSD: urndis.4,v 1.11 2011/07/20 13:12:16 jasper Exp $
.\"
.Dd September 1, 2019
.Dt URNDIS 4
.Os
.Sh NAME
.Nm urndis
.Nd USB Remote NDIS Ethernet device
.Sh SYNOPSIS
.Cd "urndis*  at uhub?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Ethernet access over Remote NDIS.
The
.Nm
driver should work with all USB RNDIS devices, but the following devices are
known to work:
.Pp
.Bl -bullet -compact -offset indent
.It
Geeksphone ONE
.It
Google Nexus One
.It
HTC Desire
.It
HTC Dream / T-Mobile G1 / ADP1
.It
HTC Hero
.It
HTC Magic
.It
HTC Tattoo
.It
HTC Wildfire
.It
LGE Nexus 5
.It
Motorola Moto X (2nd Gen.)
.It
Samsung Galaxy S / S2
.It
Samsung Galaxy S8 Active
.It
Sony Xperia XA2
.El
.Pp
The
.Nm
driver does not support different media types or options.
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh DIAGNOSTICS
See
.Xr usbnet 4
for diagnostics.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr usb 4 ,
.Xr usbnet 4 ,
.Xr ifconfig.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.7
and in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jonathan Armani Aq Mt armani@openbsd.org ,
.An Michael Knudsen Aq Mt mk@openbsd.org ,
and
.An Fabien Romano Aq Mt fabien@openbsd.org .
