NetBSD/src/share/man/man4/urtw.4
.\"	$NetBSD: urtw.4,v 1.3 2012/06/16 14:38:54 nonaka Exp $
.\" Copyright (c) 2008 Weongyo Jeong
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\" notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\" notice, this list of conditions and the following disclaimer in the
.\" documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd May 30, 2012
.Dt URTW 4
.Os
.Sh NAME
.Nm urtw
.Nd Realtek RTL8187B/L USB IEEE 802.11b/g wireless network device
.Sh SYNOPSIS
.Cd "urtw* at uhub? port ?"
.Sh DESCRIPTION
The
.Nm
driver supports USB 802.11b/g wireless adapters based on the
Realtek RTL8187B/L.
.Pp
.Nm
supports
.Cm station
and
.Cm monitor
mode operation.
Only one virtual interface may be configured at any time.
For more information on configuring this device, see
.Xr ifconfig 8 .
.Sh HARDWARE
The
.Nm
driver supports Realtek RTL8187B/L based wireless network devices, including:
.Pp
.Bl -column "Shuttle XPC Accessory PN20" "RTL8225" "USB" -compact -offset 6n
.It Em "Card Radio Bus"
.It "Belkin F5D7050E RTL8225 USB"
.It "Linksys WUSB54GCv2 RTL8225 USB"
.It "Netgear WG111v2 RTL8225 USB"
.It "Netgear WG111v3 RTL8225 USB"
.It "Safehome WLG-1500SMA5 RTL8225 USB"
.It "Shuttle XPC Accessory PN20 RTL8225 USB"
.It "Sitecom WL168v1 RTL8225 USB"
.It "Sitecom WL168v4 RTL8225 USB"
.It "SureCom EP-9001-g(2A) RTL8225 USB"
.It "TRENDnet TEW-424UB V3.xR RTL8225 USB"
.El
.Sh EXAMPLES
.Xr ifconfig.if 5
example configures urtw0 to join whatever network is available on boot,
using WEP key
.Dq 0x1deadbeef1 ,
channel 11, obtaining an IP address using DHCP:
.Bd -literal -offset indent
nwkey 0x1deadbeef1 chan 11
dhcp
.Ed
.Pp
Configure urtw0 to join network
.Dq my_net
using WPA with passphrase
.Dq my_passphrase :
.Bd -literal -offset indent
# ifconfig urtw0 nwid my_net wpakey my_passphrase
.Ed
.Pp
Join an existing BSS network,
.Dq my_net :
.Bd -literal -offset indent
# ifconfig urtw0 192.168.1.1 netmask 0xffffff00 nwid my_net
.Ed
.Sh SEE ALSO
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr usb 4 ,
.Xr ifconfig.if 5 ,
.Xr wpa_supplicant.conf 5 ,
.Xr ifconfig 8 ,
.Xr wpa_supplicant 8
.Lk http://www.realtek.com.tw Realtek
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 8.0
and
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Weongyo Jeong
.Aq weongyo@FreeBSD.org .
