NetBSD/src/share/man/man4/usbnet.4
.\"	$NetBSD: usbnet.4,v 1.2 2019/08/30 09:22:17 wiz Exp $
.\"
.\" Copyright (c) 2019 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 24, 2019
.Dt USBNET 4
.Os
.Sh NAME
.Nm usbnet
.Nd generic USB network driver backend diagnostics
.Sh DESCRIPTION
The
.Nm
subsystem provides support for USB network devices.
This manual describes diagnostics that may be seen.
.Pp
.Sh DIAGNOSTICS
.Bl -tag width
.It "devN: sysctl_createv failed"
Unable to create debug node for
.Nx .
.It "devN: usb errors on rx"
Error status from device upon Rx interrupt, device may be non-functional.
.It "devN: usb error on tx"
Error status from device upon Tx interrupt., device may be non-functional.
.It "devN: usb error on intr"
Error status from device upon interrupt, device may be non-functional.
.It "devN: rxeof: too large transfer"
Network input rejected.
.It "devN: close pipe N"
Closing of Rx, Tx or Interrupt pipe failed, device may be non-functional.
.It "devN: open rx/tx pipes failed"
Opening of Rx or Tx pipes failed, device non-functional.
.It "devN: [rt]x list init failed"
Creation of Rx or Tx list failed, device non-functional.
.It "devN: watchdog timeout"
Time out in transmission.
.It "devN: pipe abort failed"
Aborting USB pipes after watchdog timeout failed.
.It "devN: if_initialize failed"
Couldn't register network interface, device non-functional.
.It "devN: couldn't establish power handler"
Call to
.Xr pmf_device_register 9
failed, disabling system suspend.
.El
.Pp
The
.Xr usbnet 4
manual lists generic diagnostics generated by USB network devices.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr aue 4 ,
.Xr axe 4 ,
.Xr axen 4 ,
.Xr cdce 4 ,
.Xr cue 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr kue 4 ,
.\" Xr mos 4 ,
.Xr mue 4 ,
.Xr netintro 4 ,
.Xr smsc 4 ,
.Xr udav 4 ,
.Xr upl 4 ,
.Xr ure 4 ,
.Xr url 4 ,
.Xr urndis 4 ,
.Xr usb 4 ,
.Xr usbnet 4 ,
.Xr usbnet 9
.Sh HISTORY
The
.Nm
framework first appeared in
.Nx 9.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
framework was written by
.An Matthew R. Green Aq Mt mrg@eterna.com.au
