NetBSD/src/share/man/man4/uthum.4
.\"	$NetBSD: uthum.4,v 1.6 2014/03/18 18:20:39 riastradh Exp $
.\"	$OpenBSD: uthum.4,v 1.3 2009/11/23 20:53:18 jmc Exp $
.\"
.\" Copyright (c) 2009 Yojiro UO <yuo@nui.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd November 23, 2009
.Dt UTHUM 4
.Os
.Sh NAME
.Nm uthum
.Nd TEMPer and TEMPerHUM USB temperature and humidity sensor
.Sh SYNOPSIS
.Cd "uthum* at uhidev? reportid ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the pcsensors TEMPer and TEMPerHUM HID device.
The sensor possesses a collection of sensor values which are
made available through the
.Xr envstat 8
interface.
The humidity data unit is
.Dq %RH
and the temperature data unit is
.Dq degC .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr uhidev 4 ,
.Xr envstat 8
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was originally written by
.An Yojiro UO Aq Mt yuo@nui.org .
.Nx
porting was done by
.An Antoine Reilles Aq Mt tonio@NetBSD.org .
.Sh BUGS
The TEMPer and TEMperHUM have various versions which have the
same VID/PID and they need different data processing.
Currently only two types are supported.
