NetBSD/src/share/man/man4/uts.4
.\" $NetBSD: uts.4,v 1.1.10.2 2012/09/28 10:58:15 sborrill Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Pierre Pronchery.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 16, 2012
.Dt UTS 4
.Os
.Sh NAME
.Nm uts
.Nd USB generic touchscreens
.Sh SYNOPSIS
.Cd "uts*     at uhidev? reportid ?"
.Cd "wsmouse* at uts?"
.Sh DESCRIPTION
The
.Nm
driver provides support for USB touchscreens, otherwise known as Touch
Digitizer devices.
Access to panel events is through the
.Xr wsmouse 4
driver.
.Sh SEE ALSO
.Xr uhidev 4 ,
.Xr wsmouse 4
.Sh HISTORY
The
.Nm
driver was written by Pierre Pronchery for
.Nx .
The
.Nm
driver appeared in
.Nx 6.0 .
.Sh BUGS
.Nm
currently does not support calibration.
Also, not all
.Nx Ns -supplied
X servers support the absolute position events it generates.
