NetBSD/src/share/man/man4/uyurex.4
.\"	$NetBSD: uyurex.4,v 1.5.18.1 2019/09/02 16:39:20 martin Exp $
.\"	$OpenBSD: uyurex.4,v 1.2 2010/03/01 09:36:24 jmc Exp $
.\"
.\" Copyright (c) 2010 Yojiro UO <yuo@nui.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd March 11, 2010
.Dt UYUREX 4
.Os
.Sh NAME
.Nm uyurex
.Nd YUREX USB twitch/jiggle of knee sensor
.Sh SYNOPSIS
.Cd "uyurex* at uhidev? reportid ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Maywa-denki & KAYAC YUREX device.
The device has a sensor to count user's leg twitch and it
possesses a collection of sensor values which are
made available through the
.Xr envstat 8
command.
The counter unit for twitch is "BBU" (BinBo-YUsuri or
Bounding Body from Unconsciousness) and the unit for BBU speed
is "mBBU/sec" (milli BBU per second).
.Sh SEE ALSO
.Xr envsys 4 ,
.Xr intro 4 ,
.Xr uhidev 4 ,
.Xr envstat 8 ,
.Xr sysmon_envsys 9
.Rs
.%T The YUREX Web Page
.%U http://bbu.kayac.com/en/about/
.Re
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Yojiro UO Aq Mt yuo@nui.org .
