NetBSD/src/share/man/man4/valz.4
.\" $NetBSD: valz.4,v 1.2 2015/10/14 08:32:24 wiz Exp $
.\"
.\" Copyright (c) 2004 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 12, 2015
.Dt VALZ 4
.Os
.Sh NAME
.Nm valz
.Nd Toshiba Programmable I/O controller for Dynabook series
.Sh SYNOPSIS
.Cd "valz* at acpi?"
.Sh DESCRIPTION
Toshiba Dynabook series computers provide HCI/SCI I/O controllers
that handle various interface devices.
This special I/O controller is accessed by the
.Dq GHCI
ACPI method.
The
.Nm
driver provides some support for it.
.Pp
The
.Nm
driver handles the following hot-keys:
.Pp
.Bl -tag -compact -offset indent -width "Fn+Tab"
.It Fn+F9
Toggle internal touchpad and trackpoint.
.It Fn+Tab
Toggle LCD backlight.
.El
.Pp
The
.Nm
driver has only been tested on the Dynabook R63/PS and some Dynabook
models from 2013 or later.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr vald 4
.Sh HISTORY
The
.Nm
driver appeared in
.Nx 8.0 .
.Sh BUGS
Not all HCI/SCI functions are implemented.
