NetBSD/src/share/man/man4/vga.4
.\" $NetBSD: vga.4,v 1.2 2000/05/13 15:22:19 mycroft Exp $
.Dd March 20, 1999
.Os
.Dt VGA 4
.Sh NAME
.Nm vga
.Nd VGA graphics driver for wscons
.Sh SYNOPSIS
.Cd "vga0 at isa?"
.Cd "vga* at pci?"
.Cd "wsdisplay* at vga? console ?"
.Sh DESCRIPTION
This driver handles
.Tn VGA
graphics hardware within the
.Xr wscons 4
console framework. It doesn't provide direct device
driver entry points but makes its functions available via
the internal
.Xr wsdisplay 4
interface.
.Pp
The
.Nm
driver supports multiple virtual screens on one physical
display. The screens allocated on one display can be of different
.Dq types ,
where a type refers to various display properties. The type is
determined at the time the virtual screen is created and can't
be changed later. Screens are either created at kernel startup
(then the default type is used) or later with help of the
.Xr wsconscfg 8
utility.
.Pp
Currently, the following screen types are supported:
.Bl -hang
.It 80x25
This is the standard
.Tn VGA
text mode with 80 columns and 25 rows. 16 different colors
can be displayed at the same time. Characters are 8 x 16
Pixels large, and a font consists of 256 characters. A builtin
font of this size is always present on a
.Tn VGA
card. It's also possible to use a downloaded font instead.
.It 80x25bf
is a modified version of the previous. It only allows 8
colors to be displayed. In exchange, it can access two
fonts at the same time, so that 512 different characters
can be displayed.
.It 80x50
A text mode with 80 colums and 50 rows. Similar to the
standard mode, 16 colors and 256 characters are available.
Characters are 8 x 8 pixels large. For this mode to be useful,
a font of that character size must be downloaded.
.It 80x50bf
is analogously to
.Dq 80x25bf
a version with 512 displayable characters but 8 colors only.
.El
.Pp
The
.Nm
driver can display fonts of the original
.Tn IBM
type and ISO-8859-1 encoded fonts. As an experimental feature, the
.Dq higher half
fonts of the NetBSD/i386
.Xr pcvt 4
driver distribution can be used too if the kernel option
.Dq WSCONS_SUPPORT_PCVTFONTS
was set at compile time. This is only useful with the
.Dq *bf
screen types; a font containing the
.Tn ASCII
range of characters must be available too on this screen.
.Sh BUGS
Only a subset of the possible text modes is supported.
.Pp
.Tn VGA
cards are supposed to emulate an
.Tn MDA
if a monochrome display is connected. In this case, the
device will naturally not support colors at all, but
offer the capability to display underlined characters instead.
The
.Dq 80x25bf
and
.Dq 80x50bf
screen types will not be available. This mode of operation
is not tested.
.Sh SEE ALSO
.Xr isa 4 ,
.Xr pci 4 ,
.Xr wscons 4 ,
.Xr wsconscfg 8 ,
.Xr wsfontload 8
