NetBSD/src/share/man/man4/vio9p.4
.\" $NetBSD: vio9p.4,v 1.1 2019/10/28 02:56:40 ozaki-r Exp $
.\"
.\" Copyright (c) 2019 Internet Initiative Japan, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 24, 2019
.Dt VIO9P 4
.Os
.Sh NAME
.Nm vio9p
.Nd VirtIO 9p front-end driver
.Sh SYNOPSIS
.Cd "vio9p* at virtio?"
.Sh DESCRIPTION
In conjunction with
.Xr mount_9p 8 , the
.Nm
driver enables a NetBSD system running as a VM guest to mount an exported filesystem
by the host via virtio-9p.
It exports a 9p end-point of virtio-9p via a character device file for
.Xr mount_9p 8 .
.Pp
Each exported filesystem is assigned a character device and accesible via
.Pa /dev/vio9p0 ,
.Pa /dev/vio9p1
and so on, respectively in exporting order by the host.
.Sh FILES
.Bl -tag -width XdevXvio9pX -compact
.It Pa /dev/vio9p?
.El
.Sh EXAMPLES
The following command mounts a first exported filesystem by the host at
.Pa /mnt/9p :
.Bd -literal -offset indent
# mount_9p -cu /dev/vio9p0 /mnt/9p
.Ed
.Sh SEE ALSO
.Xr mount_9p 8 ,
.Xr virtio 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 10.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Ryota Ozaki Aq Mt ozaki-r@iij.ad.jp .
