NetBSD/src/share/man/man4/vioif.4
.\"	$NetBSD: vioif.4,v 1.2 2011/11/26 22:36:14 wiz Exp $
.\"
.\" Copyright (C) 2011 Minoura Makoto.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 26, 2011
.Dt VIOIF 4
.Os
.Sh NAME
.Nm vioif
.Nd VirtIO NIC driver
.Sh SYNOPSIS
.Cd "virtio* at pci? dev ? function ?"
.Cd "vioif*  at virtio?"
.Sh DESCRIPTION
.Xr virtio 4
defines an interface for efficient, standard, and extensible I/O between the
hypervisor and the virtual machine.
The
.Nm
driver supports virtio-compliant virtual network interface cards.
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr virtio 4 ,
.Xr ifconfig 8
.Rs
.%A Rusty Russell, IBM Corporation
.%T Virtio PCI Card Specification
.%O http://ozlabs.org/~rusty/virtio-spec/
.Re
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 6.0 .
.Sh BUGS
No offloading support.
