NetBSD/src/share/man/man4/viomb.4
.\"	$NetBSD: viomb.4,v 1.1 2011/11/26 15:04:45 minoura Exp $
.\"
.\" Copyright (C) 2011 Minoura Makoto.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd
.Dt VIOMB 4
.Os
.Sh NAME
.Nm viomb
.Nd VirtIO memory ballooning driver
.Sh SYNOPSIS
.Cd "virtio* at pci? dev ? function ?"
.Cd "viomb*  at virtio?"
.Sh DESCRIPTION
VirtIO defines an interface for efficient, standard and extensible I/O between
the hypervisor and the virtual machine. The
.Nm
driver supports the virtio-compliant memory ballooning device.
.Pp
Memory ballooning works as follows:
.Pp
.Bl -enum -compact
.It
The host operator requests a guest to return some amount of memory to the host
(via e.g. Qemu monitor balloon command).
.It
The hypervisor sends the request via VirtIO memory ballooning device.
.It
The guest
.Nm
driver requests allocation of that amount of physical memory from the
.Nx
memory management system.
.It
The
.Nm
device tells the hypervisor the guest physical memory address of the
allocated memory via VirtIO memory ballooning device.
.El
.Pp
The sysctl node hw.viomb.npages shows the requested number of memory pages
to return to the hypervisor, while hw.viomb.actual shows the actual
number of memory pages that is already returned to the hypervisor.
.Sh SEE ALSO
.Xr virtio 4 ,
.Xr sysctl 8
.Pp
.Rs
.%A Rusty Russell, IBM Corporation
.%T Virtio PCI Card Specification
.%O http://ozlabs.org/~rusty/virtio-spec/
.Re
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 6.0 .
.Sh BUG
The userland interface should be same as the Xen ballooning device.
