NetBSD/src/share/man/man4/vioscsi.4
.\" $NetBSD: vioscsi.4,v 1.1 2017/05/16 23:21:53 jdolecek Exp $
.\"
.\" Copyright (c) 2017 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 17, 2017
.Dt VIOSCSI 4
.Os
.Sh NAME
.Nm vioscsi
.Nd VirtIO SCSI adapter
.Sh SYNOPSIS
.Cd "vioscsi* at virtio?"
.Cd "scsibus* at vioscsi?"
.Sh DESCRIPTION
.Nm
driver provides support for
.Xr virtio 4
SCSI adapters.
.Sh SEE ALSO
.Xr virtio 4 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.5 .
It first appeared in
.Nx 7.1 ,
with further stabilization in
.Nx 8.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Matthew Dempsky Aq Mt matthew@dempsky.org .
.Nx
port done by
.An Christos Zoulas .
Further stabilization done by
.An Jaromir Dolecek Aq Mt jdolecek@NetBSD.org .
.Sh CAVEATS
.Nm
driver limits probe to 1 channel, 16 targets, and 1024 LUNs to reduce boot time.
