NetBSD/src/share/man/man4/virtio.4
.\"	$NetBSD: virtio.4,v 1.3 2011/11/26 15:04:45 minoura Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 5, 2011
.Dt VIRTIO 4
.Os
.Sh NAME
.Nm virtio
.Nd Para-virtualized I/O in a virtual machine
.Sh SYNOPSIS
.Cd "virtio* at pci? dev ? function ?"
.Cd "ld* at virtio?"
.Cd "vioif* at virtio?"
.Cd "viomb* at virtio?"
.Sh DESCRIPTION
.Nm
defines an interface for efficient, standard and extensible I/O between the
hypervisor and the virtual machine.
The
.Nm
device driver represents an emulated PCI device that the hypervisor makes
available to the virtual machine.
.Pp
.Nm
driver itself provides the core infrastructure to communicate
with the hypervisor (called virtqueues) and supports the following devices:
.Bl -tag -width xxxxx
.It Nm ld
A Disk device.
.It Nm vioif
An Ethernet device.
.It Nm viomb
A pseudo-device to release memory back to the hypervisor.
.El
.Sh SEE ALSO
.Xr pci 4 ,
.Xr viomb 4 ,
.Xr ld 4 ,
.Xr vioif 4
.Pp
.Rs
.%A Rusty Russell, IBM Corporation
.%T Virtio PCI Card Specification
.%O http://ozlabs.org/~rusty/virtio-spec/
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 6.0 .
