NetBSD/src/share/man/man4/virtio.4
.\"	$NetBSD: virtio.4,v 1.11.2.1 2026/09/22 10:40:45 martin Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 29, 2026
.Dt VIRTIO 4
.Os
.Sh NAME
.Nm virtio
.Nd Para-virtualized I/O in a virtual machine
.Sh SYNOPSIS
.Ss Virtio Over MMIO
.Cd "virtio* at acpi?"
.Cd "virtio* at fdt?"
.Cd "virtio* at pv?"
.Ss Virtio Over PCI Bus
.Cd "virtio* at pci? dev ? function ?"
.Ss Virtio devices
.Cd "ld* at virtio?"
.Cd "vio9p* at virtio?"
.Cd "viocon* at virtio?"
.Cd "vioif* at virtio?"
.Cd "viogpu* at virtio?"
.Cd "viomb* at virtio?"
.Cd "viornd* at virtio?"
.Cd "vioscsi* at virtio?"
.Sh DESCRIPTION
The
.Nm
driver implements the VirtIO interface for efficient, standard and extensible
I/O between the hypervisor and the virtual machine.
.Pp
It supports VirtIO devices exposed over
.Xr pci 4
or over the MMIO transport.
.Pp
The MMIO transport can be used, for example, in embedded systems and microVMs.
Devices may be discovered via
.Xr acpi 4
or fdt, or specified through kernel command-line parameters using
.Xr pv 4 .
.Pp
The
.Nm
driver provides the core infrastructure to communicate with the hypervisor
and supports the following devices:
.Pp
.Bl -tag -width Xr -compact
.It Xr ld 4
A disk device.
.It Xr vio9p 4
A 9P front-end device.
.It Xr viocon 4
A console device.
.It Xr vioif 4
An Ethernet device.
.It Xr viogpu 4
A GPU device.
.It Xr viomb 4
A pseudo-device to release memory back to the hypervisor.
.It Xr viornd 4
An entropy source.
.It Xr vioscsi 4
A SCSI adapter.
.El
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr ld 4 ,
.Xr pci 4 ,
.Xr pv 4 ,
.Xr vio9p 4 ,
.Xr viocon 4 ,
.Xr viogpu 4 ,
.Xr vioif 4 ,
.Xr viomb 4 ,
.Xr viornd 4 ,
.Xr vioscsi 4
.Pp
.Rs
.%A Rusty Russell, IBM Corporation
.%T Virtio PCI Card Specification
.%U http://ozlabs.org/~rusty/virtio-spec/
.Re
.Rs
.%T Virtual I/O Device (VIRTIO) Version 1.2
.%U https://docs.oasis-open.org/virtio/virtio/v1.2/virtio-v1.2.html
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 6.0 .
Support for attachment via
.Xr acpi 4
and via fdt was added in
.Nx 9.0 .
Support for attachment via
.Xr pv 4
was added in
.Nx 11.0 .
