NetBSD/src/share/man/man4/vlan.4
.\"	$NetBSD: vlan.4,v 1.2 2000/09/28 10:23:57 ad Exp $
.\"
.\" Copyright (c) 2000 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe of Zembu Labs, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 27, 2000
.Dt VLAN 4
.Os
.Sh NAME
.Nm vlan
.Nd 802.1Q Virtual LAN network device
.Sh SYNOPSIS
.Cd "pseudo-device vlan"
.Sh DESCRIPTION
The
.Nm
interface provides support for 802.1Q Virtual LANs.  This allows the
trunking of more than one network on a single network interface.
This is particularly useful on routers or on hosts which must be
connected to many different networks.
.Pp
To use a
.Nm vlan
interface, the administrator must first create the interface and then
specify the VLAN tag and physical interface associated with the VLAN.
This can be done by using the
.Xr ifconfig 8
.Sq create ,
.Sq vlan ,
and
.Sq vlanif
subcommands, or
.Dv SIOCSIFCREATE
and
.Dv SIOCSIFVLAN
ioctls.
.Sh SEE ALSO
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
first appeared in
.Nx 1.5.
.Sh BUGS
The
.Nm
interfaces do not currently inherit changes made to the physical
interfaces's MTU.
.Pp
Promiscuous mode does not currently work on
.Nm
interfaces.
.Pp
Certian types of Ethernet interface have the ability to insert and/or
extract VLAN tags using hardware.  This ability is not yet exploited.
.Sh AUTHOR
The
.Nm
driver was integrated by
.An Andrew Doran
.Aq ad@netbsd.org
and
.An Jason R. Thorpe
.Aq thorpej@zembu.com .
It was derived from a VLAN implementation that appeared in
.Fx
and
.Ox .
