NetBSD/src/share/man/man4/voodoofb.4
.\"	$NetBSD: voodoofb.4,v 1.1 2012/07/13 16:19:42 rkujawa Exp $
.\"
.\" Copyright (c) 2012 Radoslaw Kujawa 
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 13, 2012
.Dt VOODOOFB 4
.Os
.Sh NAME
.Nm voodoofb
.Nd 3Dfx Voodoo 3 framebuffer driver
.Sh SYNOPSIS
.Cd "voodoofb* at pci?"
.Cd "wsdisplay* at voodoofb?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the 3Dfx Voodoo 3 series of graphics cards
and provides interface for machine independent
.Xr wscons 4
driver.
.Pp
Currently
.Nm
depends on the firmware to do low level initialization of the card
(e.g. program video RAM controller). However, it is capable of changing
the resolution and uses DDC2 to pick appropriate video mode.
.Pp
2D graphics engine is used to accelerate all drawing operations.
Direct access to video memory is not required by the
.Nm .
.Sh SEE ALSO
.Xr genfb 4 ,
.Xr wsdisplay 4
.Sh AUTHORS
The
.Nm
driver was written by Michael Lorenz. This man page was written by
Radoslaw Kujawa. 
