NetBSD/src/share/man/man4/vpo.4
.\" $NetBSD: vpo.4,v 1.2 2004/01/23 19:36:23 wiz Exp $
.\"
.\" Copyright (c) 1998, 1999, Nicolas Souchu
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/vpo.4,v 1.9.2.3 2001/08/17 13:08:40 ru Exp $
.\"
.Dd December 29, 2003
.Dt VPO 4
.Os
.Sh NAME
.Nm vpo
.Nd parallel to SCSI interface driver
.Sh SYNOPSIS
.Cd "vpo* at ppbus?"
.Cd "scsibus* at vpo?"
.Sh DESCRIPTION
The primary purpose of the
.Nm
driver is to provide access to the Adaptec AIC-7110 SCSI controller
built in the Iomega ZIP drive.
But it should also work with the Iomega Jaz Traveller
parallel to SCSI interface.
.Pp
The driver has been extended to the ZIP+ drive which is based on the
Iomega Matchmaker Parallel to SCSI interface.
.Pp
The driver should let you use a printer connected to the drive while
transferring data.
.Pp
DOS and
.Nx
filesystems are supported.
When mounting a DOS filesystem or formating a
.Fx
filesystem, check the slice of the disk with the
.Xr fdisk 8
utility.
.Pp
In order to unixify a ZIP disk, put the following in /etc/disktab:
.Bd -literal
zip|zip 100:\\
        :ty=removable:se#512:nc#96:nt#64:ns#32:\\
        :pa#196608:oa#0:ba#4096:fa#512:\\
        :pb#196608:ob#0:bb#4096:fb#512:\\
        :pc#196608:oc#0:bc#4096:fc#512:
.Ed
.Pp
and use
.Xr disklabel 8 .
.Sh SEE ALSO
.Xr atppc 4 ,
.Xr lpt 4 ,
.Xr ppbus 4 ,
.Xr scsi 4 ,
.Xr sd 4
.Sh HISTORY
The
.Nm
manual page first appeared in
.Fx 3.0 .
.Sh AUTHORS
This manual page is based the
.Fx
.Nm vpo
and was updated for the
.Nx
port by
.An Gary Thorpe .
.Sh BUGS
During boot, the driver firstly try to detect a classic ZIP, then
a ZIP+.
The ZIP+ detection is intrusive and may send erroneous characters
to your printer if the drive is not connected to your parallel
port.
.Pp
If you have trouble with your driver, your parallel chip set may
not run properly at the detected mode (NIBBLE, PS2 or EPP).
Tune the
.Xr atppc 4
boot flags to force other modes.
