NetBSD/src/share/man/man4/vte.4
.\"     $NetBSD: vte.4,v 1.2 2011/01/27 09:46:59 wiz Exp $
.\" Copyright (c) 2010 Pyun YongHyeon
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" FreeBSD: src/share/man/man4/vte.4,v 1.2 2010/12/31 21:52:51 yongari Exp
.\"
.Dd January 23, 2011
.Dt VTE 4
.Os
.Sh NAME
.Nm vte
.Nd Vortex86 RDC R6040 Fast Ethernet driver
.Sh SYNOPSIS
.Cd "vte* at pci? dev ? function ?"
.Pp
Configuration of PHYs is necessary.
See
.Xr rdcphy 4 .
.Sh DESCRIPTION
The
.Nm
device driver provides support for RDC R6040 Fast Ethernet controller
which is commonly found on Vortex86 System On a Chip (SoC).
.Pp
The RDC R6040 has integrated 10/100 PHY for 10/100Mbps support in full
or half-duplex.
The controller supports interrupt moderation mechanism, a 64-bit multicast
hash filter, VLAN over-size frame and four station addresses.
The
.Nm
device driver uses three station addresses out of four as perfect
multicast filter.
.Sh SYSCTL VARIABLES
The following variables are available
.Bl -tag -width "xxxxxx"
.It Va hw.vte.vte<x>.int_rxct
Maximum number of packets to fire RX completion interrupt.
The accepted range is 0 (disable interrupt moderation) to 15, the default is 0.
.It Va hw.vte.vte<x>.int_txct
Maximum number of packets to fire TX completion interrupt.
The accepted range is 0 (disable interrupt moderation) to 15, the default is 0.
.El
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr mii 4 ,
.Xr netintro 4 ,
.Xr vlan 4 ,
.Xr ifconfig 8
.Rs
.%T "DM&P Electronics Inc. Vortex86"
.%U http://www.dmp.com.tw
.Re
.Sh HISTORY
The
.Nm
driver was written for
.Fx
by
.An Pyun YongHyeon
.Aq yongari@FreeBSD.org
and ported to
.Nx
by
.An Manuel Bouyer
.Aq bouyer@NetBSD.org .
The
.Nm
device driver first appeared in
.Nx 6.0 .
