NetBSD/src/share/man/man4/wd.4
.\"	$NetBSD: wd.4,v 1.2 1998/12/02 11:05:59 bouyer Exp $
.\"
.\"
.\" Copyright (c) 1994 James A. Jegers
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 15, 1998
.Dt WD 4 
.Os NetBSD 
.Sh NAME
.Nm wd 
.Nd WD100x compatible hard disk driver
.Sh SYNOPSIS
.Cd "wd* at wdc? channel ? drive ? flags 0x0000"
.Cd "wd* at pciide? channel ? drive ? flags 0x0000"
.Sh DESCRIPTION
The
.Nm wd 
driver supports hard disk which emulate the Western
Digital WD100x.  This includes standard MFM, RLL, ESDI, IDE and EIDE
drives.
.Pp
The flags are used only with controllers with mode settings support (like
some PCIIDE controllers). The first 4 bytes of the flags define the PIO mode
to use, the second DMA mode and the third UltraDMA mode. For each group of 4
bytes, the 3 lower define the mode to use, and the last one must be 1 for the
setting to be used. For DMA and UDMA, 0xf means 'disable'. For example, 0x0fac
means 'use PIO mode 4 DMA mode 2, disable UltraDMA'. 0x0000 means "use whatever
the drive claims to support.
.Sh SEE ALSO
.Xr intro 4
.Xr wdc 4
.Xr pciide 4
.Xr scsi 4
