NetBSD/src/share/man/man4/wdc.4
.\"	$NetBSD: wdc.4,v 1.4 1999/05/19 14:44:02 bouyer Exp $
.\"
.\" Copyright (c) 1998 Manuel Bouyer.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"

.Dd October 15, 1998
.Dt WDC 4
.Os
.Sh NAME
.Nm wdc
.Nd WD100x compatible hard disk controllers driver
.Sh SYNOPSIS
.Ss ISA and ISA plug'n'play controllers
.Cd "wdc0 at isa? port 0x1f0 irq 14 flags 0x00"
.Cd "wdc1 at isa? port 0x170 irq 15 flags 0x00"
.Cd "wdc* at isapnp?"
.Ss PCMCIA controllers
.Cd "wdc* at pcmcia? function ?"
.Ss arm32
.Cd "wdc0 at pioc? offset 0x01f0 irq 9"
.Ss atari
.Cd "wdc0 at mainbus0"
.Sh DESCRIPTION
The
.Nm wdc
driver provides the basic functions for the
.Nm wd
and
.Nm atapi
drivers. This driver supports IDE and EIDE controllers, as well as MFM, RLL
and ESDI on the ISA bus. PCI IDE controllers in legaty mode are also supported,
but the
.Xr pciide 4
driver may provide more functionalities.

For the ISA front-end, the 0x01 flag enables the 32 bits I/O negociation in
the driver. This is known to cause problems with some motherboards.
.Sh SEE ALSO
.Xr intro 4
.Xr wd 4
.Xr scsi 4
.Xr pciide 4
