NetBSD/src/share/man/man4/wscons.4
.\" $NetBSD: wscons.4,v 1.4 1999/02/03 21:27:02 augustss Exp $
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"

.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 26, 1998
.Dt WSCONS 4
.Os
.Sh NAME
.Nm wscons
.Nd console access
.Sh SYNOPSIS
.Cd "options WSEMUL_SUN"
.Cd "options WSEMUL_VT100"
.Cd "options WS_KERNEL_FG=WSCOL_XXX"
.Cd "options WSDISPLAY_COMPAT_PCVT"
.Cd "options WSDISPLAY_COMPAT_SYSCONS"
.Cd "options WSDISPLAY_COMPAT_USL"
.Cd "options WSDISPLAY_COMPAT_RAWKBD"
.Cd "options PCKBD_LAYOUT=XXX"

.Cd "pckbc0     at isa?"
.Cd "pckbd*     at pckbc?"
.Cd "pms*       at pckbc?"
.Cd "vga0       at isa?"
.Cd "vga*       at pci?"
.Cd "pcdisplay0 at isa?"
.Cd "wsdisplay* at vga? console ?"
.Cd "wsdisplay* at pcdisplay? console ?"
.Cd "lms0       at isa? port 0x23c irq 5"
.Cd "mms0       at isa? port 0x23c irq 5"
.Cd "wskbd*     at pckbd? console ?"
.Cd "wskbd*     at ukbd? console ?"
.Cd "wsmouse*   at pms?"
.Cd "wsmouse*   at lms?"
.Cd "wsmouse*   at mms?"
.Cd "wsmouse*   at ums?"
.Pp
.Sh DESCRIPTION
The
.Nm
driver provides support for machine independent access to the console.
.Sh BUGS
This man page is extremely incomplete.
.Sh SEE ALSO
.Xr isa 4 ,
.Xr pci 4 ,
.Xr ukbd 4 ,
.Xr lms 4 ,
.Xr mms 4 ,
.Xr pms 4 ,
.Xr ums 4 ,
.Xr wsconscfg 8 ,
.Xr wsconsctl 8 ,
.Xr wsfontload 8
