NetBSD/src/share/man/man4/wsdisplay.4
.\" $NetBSD: wsdisplay.4,v 1.9 2001/09/11 23:18:56 wiz Exp $
.Dd March 20, 1999
.Os
.Dt WSDISPLAY 4
.Sh NAME
.Nm wsdisplay
.Nd generic display device support in wscons
.Sh SYNOPSIS
.Cd wsdisplay* at ega? console ?
(EGA display on ISA)
.Cd wsdisplay* at vga? console ?
(VGA display on ISA or PCI)
.Cd wsdisplay* at pcdisplay? console ?
(generic PC (ISA) display)
.Cd wsdisplay* at tga? console ?
(DEC TGA display, alpha only)
.Cd wsdisplay* at pfb? console ?
(PCI framebuffer, bebox only)
.Cd wsdisplay0 at ofb? console ?
(Open Firmware framebuffer, macppc only)
.Cd wsdisplay* at nextdisplay? console ?
(NeXT display)
.Cd wsdisplay0 at smg0
(VAXstation small monochrome display)
.Cd options WSDISPLAY_DEFAULTSCREENS=N
.Sh DESCRIPTION
The
.Nm
driver is an abstraction layer for display devices within the
.Xr wscons 4
framework. It attaches to the hardware specific display device
driver and and makes it available as text terminal or graphics
interface.
.Pp
A display device can have the ability to display characters on it
(without help of an X server), either directly by hardware or through
software putting pixel data into the display memory.
Such displays are called
.Dq emulating ,
the
.Nm
driver will connect a terminal emulation module and provide a
tty-like software interface. In contrary, non-emulating displays can only
be used by special programs like X servers.
.Pp
The
.Em console
locator in the configuration line refers to the device's use as output
part of the operating system console. A device specification containing
a positive value here will only match if the device is in use as system
console. (The console device selection in early system startup is not
influenced.) This way, the console device can be connected to a known
wsdisplay device instance. (Naturally, only
.Dq emulating
display devices are usable as console.)
.Pp
The logical unit of an independent contents displayed on a display
(sometimes referred to as
.Dq virtual terminal
) is called a
.Dq screen
here. If the underlying device driver supports it, multiple screens can
be used on one display. (As of this writing, only the
.Xr vga 4
and the
.Tn VAX
.Dq smg
display drivers provide this ability.)
Screens have different minor device numbers and separate tty instances.
One screen possesses the
.Dq focus ,
this means it is displayed on the display and its tty device will get
the keyboard input. (In some cases - if no screen is set up or if a screen
was just deleted - it is possible that no focus is present at all.)
The focus can be switched by either special keyboard input (typically
CTRL-ALT-Fn) or an ioctl command issued by a user program.
Screens are set up or deleted through the
.Pa /dev/ttyEcfg
control device (preferably using the
.Xr wsconscfg 8
utility). Alternatively, the compile-time option
.Cd WSDISPLAY_DEFAULTSCREENS=N
will set up N screens of the display driver's default type and using
the system's default terminal emulator at autoconfiguration time.
.Sh FILES
.Bl -item
.It
.Pa /dev/ttyE*
Terminal devices (per screen).
.It
.Pa /dev/ttyEcfg
Control device.
.It
.Pa /usr/include/dev/wscons/wsconsio.h
.El
.Sh SEE ALSO
.Xr ega 4 ,
.Xr pcdisplay 4 ,
.Xr tty 4 ,
.Xr vga 4 ,
.Xr wscons 4 ,
.Xr wsconscfg 8 ,
.Xr wsconsctl 8 ,
.Xr wsfontload 8
.Sh BUGS
The
.Nm
code currently limits the number of screens on one display to 8.
.Pp
The terms
.Dq wscons
and
.Dq wsdisplay
are not cleanly distinguished in the code and in manual pages.
.Pp
.Dq non-emulating
display devices are not tested.
