NetBSD/src/share/man/man4/wskbd.4
.\" $NetBSD: wskbd.4,v 1.8 2001/09/11 23:18:56 wiz Exp $
.Dd March 20, 1999
.Os
.Dt WSKBD 4
.Sh NAME
.Nm wskbd
.Nd generic keyboard support in wscons
.Sh SYNOPSIS
.Cd "wskbd* at pckbd? console ? mux 1"
(standard PC keyboard)
.Cd "wskbd* at ukbd? console ? mux 1"
(USB keyboard)
.Cd "wskbd* at lkkbd? console ? mux 1"
(DEC LK200/400 serial keyboard)
.Cd "wskbd0 at akbd? console ? mux 1"
(Apple ADB keyboard)
.Cd "wskbd0 at nextkbd? console ? mux 1"
(NeXT keyboard)
.Cd "wskbd* at vrkiu? console ? mux 1"
(NEC VR4000 series HPC keyboard)
.Cd "wskbd* at skbd? console ? mux 1"
(keyboard of misc hpcmips handheld devices)
.Sh DESCRIPTION
The
.Nm
driver handles common tasks for keyboards within the
.Xr wscons 4
framework. It is attached to the hardware specific keyboard drivers and
provides their connection to
.Dq wsdisplay
devices and a character device interface.
.Pp
The common keyboard support consists of:
.Bl -bullet
.It
Mapping from keycodes (defined by the specific keyboard driver) to
keysyms (hardware independent, defined in
.Pa /usr/include/dev/wscons/wsksymdef.h ) .
.It
Handling of
.Dq compose
sequences. Characters commonly not present as separate key on keyboards
can be generated after either a special
.Dq compose
key is pressed or a
.Dq dead accent
character is used.
.It
Certain translations, like turning an
.Dq ALT
modifier into an
.Dq ESC
prefix.
.It
Automatic key repetition
.Pq Dq typematic .
.It
Parameter handling for
.Dq keyboard bells .
.It
Generation of
.Dq keyboard events
for use by X servers.
.El
.Pp
The
.Nm
driver provides a number of ioctl functions to control key maps
and other parameters. These functions are accessible though the
associated
.Dq wsdisplay
device as well. A complete list is in
.Pa /usr/include/dev/wscons/wsconsio.h .
The
.Xr wsconsctl 8
utility allows to access key maps and other variables.
.Pp
The
.Em console
locator in the configuration line refers to the device's use as input
part of the operating system console. A device specification containing
a positive value here will only match if the device is in use as system
console. (The console device selection in early system startup is not
influenced.) This way, the console device can be connected to a known
wskbd device instance.
.Sh FILES
.Bl -item
.It
.Pa /dev/wskbd*
.It
.Pa /usr/include/dev/wscons/wsksymdef.h
.It
.Pa /usr/include/dev/wscons/wsconsio.h .
.El
.Sh SEE ALSO
.Xr pckbd 4 ,
.Xr ukbd 4 ,
.Xr wscons 4 ,
.Xr wsmux 4 ,
.Xr wsconsctl 8
