NetBSD/src/share/man/man4/wsmouse.4
.\" $NetBSD: wsmouse.4,v 1.7 2002/04/16 11:49:54 wiz Exp $
.Dd April 16, 2002
.Os
.Dt WSMOUSE 4
.Sh NAME
.Nm wsmouse
.Nd generic mouse support in wscons
.Sh SYNOPSIS
.Cd "wsmouse*   at pms? mux 0"
(PS/2 mouse, including ``Intellimouse''-compatible wheel mice)
.Cd "wsmouse*   at ums? mux 0"
(USB mouse)
.Cd "wsmouse*   at lms? mux 0"
(Logitech bus mouse, i386 only)
.Cd "wsmouse*   at mms? mux 0"
(Microsoft InPort mouse, i386 only)
.Cd "wsmouse0   at ams? mux 0"
(Apple ADB mouse)
.Sh DESCRIPTION
The
.Nm
driver is an abstraction layer for mice within the
.Xr wscons 4
framework. It is attached to the hardware specific keyboard drivers and
provides a character device interface. For use with X servers,
.Dq mouse events
can be generated.
.Pp
The
.Nm
driver provides a number of ioctl functions to control
various parameters. A complete list is in
.Pa /usr/include/dev/wscons/wsconsio.h .
The
.Xr wsconsctl 8
utility gives access to these variables.
.Sh FILES
.Bl -item
.It
.Pa /dev/wsmouse*
.It
.Pa /usr/include/dev/wscons/wsconsio.h .
.El
.Sh SEE ALSO
.Xr lms 4 ,
.Xr mms 4 ,
.Xr pms 4 ,
.Xr ums 4 ,
.Xr wscons 4 ,
.Xr wsmux 4 ,
.Xr wsconsctl 8
