NetBSD/src/share/man/man4/wwanc.4
.\" $NetBSD: wwanc.4,v 1.6 2020/07/27 14:17:47 jdolecek Exp $
.\"
.\" Copyright (c) 2020 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 27, 2020
.Dt WWANC 4
.Os
.Sh NAME
.Nm wwanc
.Nd PCI LTE modem
.Sh SYNOPSIS
.Cd "wwanc*  at pci? dev ? function ?"
.Cd "wwan*   at wwanc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for Fibocom L850-GL / Intel XMM7360.
.Pp
The device establishes connections via cellular networks such as
GPRS, UMTS, and LTE.
They appear as a regular point-to-point network interface,
transporting raw IP frames.
.Pp
The SIM card needs to be unlocked, the
.Nm
driver provides no means to provide a password for the SIM.
.Sh HARDWARE
The following devices should work:
.Pp
.Bl -tag -width Ds -offset indent -compact
.It Intel XMM7360
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr ifconfig.if 5 ,
.Xr ifconfig 8 ,
.Xr MAKEDEV 8 ,
.Lk https://github.com/xmm7360/xmm7360-pci "Linux driver repository"
.Sh HISTORY
The
.Nm
device driver first appeared
.Nx 10.0 .
.Sh AUTHORS
.An -nosplit
Development of the Linux and
.Ox
driver was supported by genua GmbH.
The
.Nm
driver was written by
.An James Wah Aq Mt james@laird-wah.net
for Linux, it was ported to
.Ox
and
.Nx
by
.An Jaromir Dolecek Aq Mt jdolecek@NetBSD.org
for Moritz Systems Technology Company Sp. z o.o.
.Sh CAVEATS
The
.Nm
driver IPv6 support is untested.
.Pp
Network initialization requires a Python script published in the Linux
driver repository, available as package
.Pa pkgsrc/net/py-xmm7360 .
The script requires the management device nodes to be created via:
.Bd -literal -offset indent
cd /dev && ./MAKEDEV xmm0
.Ed
