NetBSD/src/share/man/man4/xbd.4
.\"	$NetBSD: xbd.4,v 1.2.12.1 2014/08/20 00:02:35 tls Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jean-Yves Migeon <jym@NetBSD.org>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 8, 2011
.Dt XBD 4 xen
.Os
.Sh NAME
.Nm xbd
.Nd Xen frontend paravirtualized block device interface
.Sh SYNOPSIS
.Cd "xbd* at xenbus?"
.Sh DESCRIPTION
The
.Nm
interface forms the frontend part of the paravirtualized drivers
used by
.Tn Xen
guest domains to have a block device interface.
.Pp
From a guest point of view,
.Nm
is similar to a hard disk, and can be treated in the very same way
regarding partitioning, file systems creation and usage, and mounting.
By default, a
.Nx
guest domain will assume that
.Dq xbd0a
serves as the root file system.
.Pp
When the host is
.Nx ,
the
.Nm
interface is backed by a
.Xr xbdback 4
interface.
In the XenStore,
.Nm xbd
and
.Nm xbdback
are identified by
.Dq vbd
(virtual block device)
entries.
.Sh DIAGNOSTICS
.Bl -diag
.It "xbd%d: using event channel %d"
Specifies the event channel used by this
.Nm
interface.
.It "xbd%d: %s MB, %d bytes/sect x %u sectors"
Gives the total size of the
.Nm
block device, its sector size and total number of sectors.
.It "xbd%d: WARNING: cache flush not supported by backend"
The backend driver associated with this
.Nm
device does not support cache flushing operation.
This can be problematic for file system operations that require
cache sync to avoid data loss or corruption.
.El
.Sh SEE ALSO
.Xr xbdback 4 ,
.Xr xenbus 4 ,
.Xr dkctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 3.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Manuel Bouyer Aq Mt bouyer@NetBSD.org .
