NetBSD/src/share/man/man4/xenbus.4
.\"	$NetBSD: xenbus.4,v 1.1.12.1 2014/08/20 00:02:35 tls Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jean-Yves Migeon <jym@NetBSD.org>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 8, 2011
.Dt XENBUS 4 xen
.Os
.Sh NAME
.Nm xenbus
.Nd Xen bus abstraction for paravirtualized drivers
.Sh SYNOPSIS
.Cd "xenbus* at hypervisor?"
.Sh DESCRIPTION
The
.Nm
interface offers an abstraction layer used for communications
between domains.
.Nm
is mainly used by split paravirtualized drivers, so backend and frontend
devices can exchange configuration information, properties, and
statistics.
.Pp
.Nm
is not used for data transfer (network frames, blocks,
PCI commands, ...). This functionality is implemented by each paravirtualized
driver independently, typically via shared memory pages and an event
channel that serves as a virtual interrupt, for signaling.
.Pp
The
.Nm
abstraction offers guests the possibility to read and write information
directly from and to XenStore, a centralized database accessible to
all domains.
For this reason, it also has an event channel associated to it, so that
domains can post messages to the XenStore facility.
.Sh DIAGNOSTICS
.Bl -diag
.It "xenbus0: using event channel %d"
The event channel associated to the
.Nm
interface, for communication with the XenStore database.
.El
.Sh SEE ALSO
.Xr pciback 4 ,
.Xr xbd 4 ,
.Xr xbdback 4 ,
.Xr xennet 4 ,
.Xr xpci 4 ,
.Xr xvif 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 3.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Manuel Bouyer Aq Mt bouyer@NetBSD.org .
