NetBSD/src/share/man/man4/xennet.4
.\"	$NetBSD: xennet.4,v 1.5 2020/04/05 19:03:30 jdolecek Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jean-Yves Migeon <jym@NetBSD.org>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 5, 2020
.Dt XENNET 4 xen
.Os
.Sh NAME
.Nm xennet
.Nd Xen frontend paravirtualized network interface
.Sh SYNOPSIS
.Cd "xennet* at xenbus?"
.Sh DESCRIPTION
The
.Nm
interface forms the frontend part of the paravirtualized drivers
used by
.Tn Xen
guest domains to have network connectivity.
.Pp
When the host domain is
.Nx ,
the endpoint of the
.Nm
interface is a
.Xr xvif 4
interface.
In the XenStore,
.Nm xvif
and
.Nm xennet
are identified by
.Dq vif
(virtual interface)
entries.
.Pp
Conceptually, frontends and backends drivers are
similar to two Ethernet cards connected via a crossover cable.
.Pp
.Nm xennet
interfaces can pass VLAN tagged packets.
.Sh DIAGNOSTICS
.Bl -diag
.It "xennet%d: can't read mac address, err %d"
The MAC address for this interface could not be read from XenStore.
.It "xennet%d: %s is not a valid mac address"
The MAC address specified in the configuration file of the newly
created guest domain is invalid.
.It "xennet%d: using event channel %d"
The
.Tn Xen
event channel (virtual interrupt) ID
associated to this
.Nm .
.It "xennet%d: using RX copy mode"
The
.Nm
and its associated endpoint use copy mode for communication: packets
are copied from one domain's memory to another.
.El
.Sh SEE ALSO
.Xr bridge 4 ,
.Xr ifmedia 4 ,
.Xr xenbus 4 ,
.Xr xvif 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 3.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Manuel Bouyer Aq Mt bouyer@NetBSD.org
and
.An Christian Limpach Aq Mt chris@pin.lu .
