NetBSD/src/share/man/man4/xmd.4
.\" $NetBSD: xmd.4,v 1.1.2.4 2010/11/06 15:26:16 uebayasi Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 28, 2010
.Dt XMD 4
.Os
.Sh NAME
.Nm xmd
.Nd XIP memory disk
.Sh SYNOPSIS
.Cd "pseudo-device xmd" Op Ar count
.Sh DESCRIPTION
The
.Nm
driver enables use of system or user memory as a disk, which can be
mounted as XIP (eXecute-In-Place), so that filesystem data are read
without consuming intermediate page cache buffers.
.Pp
Memory for the disk is allocated within the kernel and set with
.Xr mdsetimage 8
before the
.Nm
device may be used as a disk.
.Nm
disks should be mounted as read-only to enable XIP.
.Sh EXAMPLES
.Bl -enum
.It
Prepare a kernel compiled with the
.Xr xip 4
option:
.Bd -literal -offset indent
options XIP
pseudo-device xmd 1
options XMD_ROOT_SIZE XXX
.Ed
.It
Prepare an
.Xr ffs 4
image, typically created by
.Xr makefs 8 :
.Bd -literal -offset indent
% cd /
% makefs /tmp/xmd.fs bin
.Ed
.It
Embed the
.Xr ffs 4
image into the kernel image:
.Bd -literal -offset indent
% mdsetimage -I _xmd_root_image -S _xmd_root_size /tmp/netbsd.xmd /tmp/xmd.fs
.Ed
.It
Run the kernel, prepare device file entry:
.Bd -literal -offset indent
% mknod /dev/xmd0a b XXX XXX
.Ed
.It
Mount the
.Xr xmd
disk partition as XIP:
.Bd -literal -offset indent
% mount -o ro,xip /dev/xmd0a /xmd
.Ed
.It
Execute a program and see if it works as expected:
.Bd -literal -offset indent
% time -l /xmd/date
Fri Oct 15 09:08:57 GMT 2010
        0.02 real         0.00 user         0.00 sys
         0  maximum resident set size
         0  average shared memory size
         0  average unshared data size
         0  average unshared stack size
        72  page reclaims
         0  page faults
         0  swaps
         0  block input operations
         0  block output operations
         2  messages sent
         2  messages received
         0  signals received
         2  voluntary context switches
         1  involuntary context switches
%
.Ed
.Pp
Note the "page faults" counter shows that no I/O paging activity
was executed during the process's lifetime.
.El
.Sh SEE ALSO
.Xr md 4 ,
.Xr options 4 ,
.Xr mdsetimage 8
.Sh BUGS
.Pp
Due to the design of XIP, device pages in a physical segment must
be contiguous.
This leads to a restriction that the page array in the
.Nm
driver must be also contiguous.
It is highly expectable that the
.Nm
kernel module will not work.
.Pp
Only one instace can be compiled in one kernel.
You can add more by modifying the source code (src/sys/dev/xmd.c)
directly, but there's no good user interface to configure it.
