NetBSD/src/share/man/man4/xpci.4
.\"	$NetBSD: xpci.4,v 1.1.12.1 2014/08/20 00:02:35 tls Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jean-Yves Migeon <jym@NetBSD.org>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 8, 2011
.Dt XPCI 4 xen
.Os
.Sh NAME
.Nm xpci
.Nd Xen frontend paravirtualized PCI pass-through driver
.Sh SYNOPSIS
.Cd "xpci* at xenbus?"
.Cd "pci* at xpci?"
.Sh DESCRIPTION
The
.Nm
driver is the frontend part of the PCI pass-through functionality
that can be used by
.Tn Xen
guest domains to communicate with PCI devices.
.Pp
From a guest point of view,
.Nm
is similar to a
.Xr pci 4
bus, except that the guest talks with the PCI backend driver
instead of the real physical device directly.
.Pp
When the host domain is
.Nx ,
the
.Nm
driver is backed by a
.Xr pciback 4
driver within the dom0.
.Sh SEE ALSO
.Xr pci 4 ,
.Xr pciback 4 ,
.Xr xenbus 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 5.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Manuel Bouyer Aq Mt bouyer@NetBSD.org .
.Sh SECURITY CONSIDERATIONS
As PCI passthrough offers the possibility for guest domains
to send arbitrary PCI commands to a physical device, this has
direct impact on the overall stability and security of the system.
For example, in case of erroneous or malicious commands, the device
could overwrite physical memory portions, via DMA.
