NetBSD/src/share/man/man4/xvif.4
.\"	$NetBSD: xvif.4,v 1.2 2011/01/11 10:47:45 wiz Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jean-Yves Migeon <jym@NetBSD.org>.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 8, 2011
.Dt XVIF 4 xen
.Os
.Sh NAME
.Nm xvif
.Nd Xen backend paravirtualized network interface
.Sh SYNOPSIS
.Cd pseudo-device xvif
.Sh DESCRIPTION
The
.Nm
interface forms the backend part of the paravirtualized drivers
used by
.Tn Xen
domains to offer network connectivity.
.Pp
When the guest domain is
.Nx ,
the endpoint of the
.Nm
interface is a
.Xr xennet 4
interface.
In the XenStore,
.Nm xvif
and
.Nm xennet
are identified by
.Dq vif
(virtual interface)
entries.
.Pp
All
.Nm
interfaces follow the
.Dq xvifX.Y
naming convention, where
.Sq X
represents the guest domain identifier, and
.Sq Y
an arbitrary identifier; most of the time, it is the
frontend interface identifier, e.g.
.Dq xennetY .
.Pp
For convenience, the MAC address of an
.Nm
interface is chosen by incrementing the third byte of the
MAC address of the frontend device.
.Pp
Conceptually, frontends and backends drivers are
similar to two Ethernet cards connected via a crossover cable.
.Sh DIAGNOSTICS
.Bl -diag
.It "xvif%d.%d: can't read %s/mac: %d"
The MAC address for this interface could not be read from XenStore.
.It "xvif%d.%d: %s is not a valid mac address"
The MAC address specified in the configuration file of the newly
created guest domain is invalid.
.It "xvif%d.%d: Ethernet address %s"
MAC address of the
.Nm
interface.
.El
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr xennet 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Manuel Bouyer Aq bouyer@NetBSD.org .
