NetBSD/src/usr.sbin/amd/amq/amq.8
.\"
.\" Copyright (c) 1990 Jan-Simon Pendry
.\" Copyright (c) 1990 Imperial College of Science, Technology & Medicine
.\" Copyright (c) 1990 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Jan-Simon Pendry at Imperial College, London.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by the University of
.\"      California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	%W% (Berkeley) %G%
.\"
.\" $Id: amq.8,v 1.1.1.2 1997/07/24 21:22:55 christos Exp $
.\"
.TH AMQ 8 "25 April 1989"
.SH NAME
amq \- automounter query tool
.SH SYNOPSIS
.B amq
[
.BI \-h " hostname"
] [
.BI \-M " mountmap entry"
] [
.B \-f
] [
.B \-m
] [
.B \-s
] [
.B \-u
] [
.B \-v
]
[
.I directory
] .\|.\|.
.SH DESCRIPTION
.B Amq
provides a simple way of determining the current state of
.B amd
program.
Communication is by
.SM RPC.
Three modes of operation are supported by the current protocol.
By default a list of mount points and auto-mounted filesystems
is output.
An alternative host can be specified using the
.I \-h
option.
.LP
If directory names are given, as output by default,
then per-filesystem information is displayed.
.SH OPTIONS
The
.I \-h
option specifies an alternate host to query.
By default the local host is used.  In an
.SM HP-UX
cluster, the root server is queried by default, since
that is the system on which the automounter is normally run.
.LP
The
.I \-f
option asks the automounter to flush the internal caches.
The
.I \-m
option asks the automounter to provide a list of mounted filesystems,
including the number of references to each filesystem and any error
which occured while mounting.
The
.I \-s
option asks the automounter to provide system-wide mount statistics.
.LP
The
.I \-u
option asks the automounter to unmount the named filesystems
instead of providing information about them.  Unmounts are requested,
not forced.  They merely cause the mounted filesystem to timeout,
which will be picked up by
.BR amd 's
main scheduler thus causing the normal timeout action to be taken.
.LP
The
.I \-v
option asks the automounter for its version information.  This is a
subset of the information output by
.BR amd 's
.I -v
option.
.LP
The
.I \-M
option passes a mount map entry to
.B amd
and waits for it to be evaluated, possible causing a mount.
.SH FILES
.PD 0
.TP 20
.B amq.x
.SM RPC
protocol description.
.SH CAVEATS
.B Amq
uses a Sun registered
.SM RPC
program number (300019 decimal) which may not
be in the /etc/rpc database.
.SH "SEE ALSO"
.BR amd (8)
.SH AUTHOR
Jan-Simon Pendry <jsp@doc.ic.ac.uk>, Department of Computing, Imperial College, London, UK.
