NetBSD/src/usr.bin/mkubootimage/mkubootimage.1
.\"	$NetBSD: mkubootimage.1,v 1.18 2024/05/21 22:10:21 gutteridge Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jeremy C. Reed
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 21, 2024
.Dt MKUBOOTIMAGE 1
.Os
.Sh NAME
.Nm mkubootimage
.Nd create U-Boot loader image
.Sh SYNOPSIS
.Nm
.Op Fl hu
.Fl A No ( arm Ns | Ns arm64 Ns | Ns i386 Ns | Ns mips Ns | Ns mips64 Ns | Ns or1k Ns | Ns powerpc Ns | Ns riscv Ns | Ns sh )
.Fl a Ar address
.Op Fl C Po bz2 Ns | Ns gz Ns | Ns lzma Ns | Ns lzo Ns | Ns none Pc
.Op Fl E Ar address
.Op Fl e Ar address
.Op Fl f Po arm64 Ns | Ns uimg Pc
.Op Fl m Ar magic
.Fl n Ar image
.Op Fl O Po freebsd Ns | Ns linux Ns | Ns netbsd Ns | Ns openbsd Pc
.Fl T No ( fs Ns | Ns kernel Ns | Ns kernel_noload Ns | Ns ramdisk Ns | Ns script Ns | Ns standalone )
.Op Fl t Ar epoch
.Ar source destination
.\"
.Sh DESCRIPTION
The
.Nm
utility is used to create an image for Das U-Boot, the
.Qq Universal Boot Loader .
.Pp
The arguments are as follows:
.Bl -tag -width indent
.It Fl A No ( arm Ns | Ns arm64 Ns | Ns i386 Ns | Ns mips Ns | Ns mips64 Ns | Ns or1k Ns | Ns powerpc Ns | Ns riscv Ns | Ns sh )
Defines the architecture.
This is required for
.Qq uimg
format images.
.It Fl a Ar address
Sets the image load address.
This is an integer between 0 and
.Dv UINT32_MAX .
This is required for all
.Qq uimg
image types except for script, ramdisk, and kernel_noload.
.It Fl C No ( bz2 Ns | Ns gz Ns | Ns lzma Ns | Ns lzo Ns | Ns none )
Defines the compression.
The default is
.Qq none .
.It Fl E Ar address
Define the entry point.
This is an integer between 0 and
.Dv UINT32_MAX .
This option is the same as
.Fl e
but it inverts the bytes to convert the 32 bit integer
from little to big endian (or vice versa).
If
.Fl E
or
.Fl e
are not set, the entry point defaults to the
image load address
.Pq Fl a .
.It Fl e Ar address
Define the entry point.
This is an integer between 0 and
.Dv UINT32_MAX .
If
.Fl E
or
.Fl e
are not set, the entry point defaults to the
image load address
.Pq Fl a .
.It Fl f No ( arm64 Ns | Ns uimg )
Defines the output image format type.
The default is
.Qq uimg .
.It Fl h
Display the usage and exit.
.It Fl m Ar magic
Set the magic used for
.Qq uimg
format images.
This is an integer between 0 and
.Dv UINT32_MAX .
The default is
.Qq 0x27051956 .
.It Fl n Ar image
Defines the image name.
This is required.
.It Fl O No ( freebsd Ns | Ns linux Ns | Ns netbsd Ns | Ns openbsd )
Defines the operating system type.
The default OS name is
.Qq netbsd .
.It Fl T No ( fs Ns | Ns kernel Ns | Ns kernel_noload Ns | Ns ramdisk Ns | Ns script Ns | Ns standalone )
Defines the image type.
This is required for
.Qq uimg
format images.
.It Fl t Ar epoch
Use given epoch timestamp as image creation time.
(This is only used for legacy U-Boot images.)
.It Fl u
Update the header in an existing file instead of creating a new one.
.El
.Pp
The required
.Ar source
argument is the filename of the kernel that is read.
The required
.Ar destination
argument is the filename of the image file that is created.
.\"
.Sh EXIT STATUS
.Nm
returns 1 on failure to read the kernel,
generate a header, or create the image.
.\"
.Sh EXAMPLES
Before the image is written, the header is displayed to standard out;
for example:
.Bd -literal -offset 0
 image type:  uimg
 magic:       0x27051956
 time:        Tue May 21 18:05:09 2024
 size:        137
 load addr:   0x00000000
 entry point: 0x00000000
 data crc:    0xface05f2
 os:          2 (netbsd)
 arch:        2 (arm)
 type:        6 (script)
 comp:        0 (none)
 name:        NetBSD/armv7 boot
 header crc:  0x2164b567
.\" .Sh FILES
.Sh SEE ALSO
.Qq Das U-Boot - the Universal Boot Loader
.Pa http://www.denx.de/wiki/U-Boot/
.\"
.\" .Sh STANDARDS
.\"
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 6.0 .
.\"
.Sh AUTHORS
.An -nosplit
The
.Nm
utility was originally written by
.An Jared McNeill .
This manual page was written by
.An Jeremy C. Reed .
.\" .Sh CAVEATS
.\" .Sh BUGS
.\" .Sh SECURITY CONSIDERATIONS
