NetBSD/src/share/man/man8/man8.x68k/poffd.8
.\"	$NetBSD: poffd.8,v 1.2 1998/01/09 08:04:46 perry Exp $
.\"
.\" Copyright (c) 1995 MINOURA Makoto.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"    This product includes software developed by Minoura Makoto.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 29, 1995
.Os
.Dt POFFD 8
.Sh NAME
.Nm poffd
.Nd "X68k shutdown deamon"
.Sh SYNOPSIS
.Nm poffd
.Op Ar shutdown-program
.Sh DESCRIPTION
.Nm Poffd
looks at the power switch of x68k.
When the switch is turned off,
.Nm poffd
executes
.Ar shutdown-program
.Po
using
.Pa /bin/sh -c
.Pc .

If the system is started by x68k's RTC timer,
.Ar shutdown-program
is executed when the system's shut down time (predefined using
other utility, SX-Window Control Pannel and
.Xr rtcalarm 8
for example) arrives.

The argument
.Ar shutdown-program
may contain the character `%'. It is substituted with a number
which indicates the way how the system was started:
.Bl -item -compact -offset indent
.It
0: Front power switch
.It
1: External (I/O slot) power signal
.It
2: RTC alarm
.El
This is useful when choosing the shutdown message.

If the argument
.Ar shutdown-program
is omitted, `/sbin/shutdown -r +1' is executed instead.
.Sh SEE ALSO
.Xr pow 4 ,
.Xr shutdown 8 , 
.Xr rtcalarm 8
.Sh AUTHOR
.Nm Poffd
was written by MINOURA Makoto <minoura@flab.fujitsu.co.jp>.
.Sh SPECIAL THANKS
Liam Hahne Minn <hahne@sail.t.u-tokyo.ac.jp>.
.Sh BUGS
Many, probably.
