NetBSD/src/share/man/man4/man4.amiga/a1k2cp.4
.\" $NetBSD: a1k2cp.4,v 1.4.8.1 2017/03/20 06:57:04 pgoyette Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt A1K2CP 4 amiga
.Os
.Sh NAME
.Nm a1k2cp
.Nd Amiga 1200 on-board clockport driver
.Sh SYNOPSIS
.Cd "a1k2cp0 at mainbus0"
.Cd "clockport* at a1k2cp0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the spare I/O pins present on Amiga 1200 on-board
clockport.
.Sh HARDWARE
The
.Nm
driver supports the following clockports:
.Bl -tag -offset indent
.It Amiga 1200 on-board clockport header (0xD90001)
.El
.Sh SEE ALSO
.Xr amiga/clockport 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq Mt radoslaw.kujawa@gmail.com .
.Sh CAVEATS
Even if connected to clockport header, Real Time Clock modules are
supported by the
.Xr a2kbbc
and
.Xr a34kbbc
drivers.
.Pp
Only one clockport is supported, even if clockport expander is present.
This is a driver limitation.
