NetBSD/src/share/man/man4/man4.amiga/amidisplaycc.4
.\" $NetBSD: amidisplaycc.4,v 1.6 2002/03/13 19:46:01 jandberg Exp $
.Dd February 4, 2002
.Dt AMIDISPLAYCC 4 amiga
.Sh NAME
.Nm amidisplaycc
.Nd wscons interface to amiga custom chips drivers
.Sh SYNOPSIS
.Cd amidisplaycc0 at mainbus0
.Cd wsdisplay0 at amidisplaycc0
.Sh DESCRIPTION
This device acts as an adapter between the
.Xr wscons 4
framework and the Amiga custom chip driver functions.
It exports the internal
.Xr wsdisplay 4
interface and contains the necessary rendering functions to
operate a text terminal with virtual screens. It uses the
Amiga abstract graphic driver functions for the low-level
display management.
.Pp
Currently it does not support running X. You can still run
X the old way, but be warned, you cannot switch screens while
in X and when quitting it, it seems to hang. Switching a screen
then will bring up the text console. As always, we apologise for
the inconvenience.
.Pp
What it does support is hilite (bold), underline, reverse and
foreground/background colors.
.Pp
The number of virtual screens is limited only by
the available chip memory. 
Each virtual screen can have a different display mode.
A display mode defines the following things: height and width
in pixels, number of colors, and the size of the font. 
The predefined modes are listed below.
.Bl -bullet -offset indent -compact
.It
80x50 - display size 640x400 with 8 colors, font size 8x8
.It
80x40 - display size 640x400 with 8 colors, font size 8x10
.It
80x25 - display size 640x400 with 8 colors, font size 8x16
.It
80x24 - display size 640x384 with 8 colors, font size 8x16
.El
.Pp
Fonts of width 8 are supported. Fonts can be compiled into the kernel
by specifying "options FONT_[fontname]" in the configuration file,
or loaded with the
.Xr wsfontload 8
utility runtime. 
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsdisplay 4 ,
.Xr wsfont 4 ,
.Xr wsfontload 8

