NetBSD/src/share/man/man4/man4.amiga/amidisplaycc.4
.\" $NetBSD: amidisplaycc.4,v 1.4 2001/06/13 23:38:29 wiz Exp $
.Dd September 3, 2000
.Dt AMIDISPLAYCC 4 amiga
.Sh NAME
.Nm amidisplaycc
.Nd wscons interface to amiga custom chips drivers
.\"
.Sh SYNOPSIS
.Cd amidisplaycc0 at mainbus0
.Cd wsdisplay0 at amidisplaycc0
.\"
.Sh DESCRIPTION
This device acts as an adapter between the
.Xr wscons 4
framework and the Amiga custom chip driver functions.
It exports the internal
.Xr wsdisplay 4
interface and contains the necessary rendering functions to
operate a text terminal with virtual screens. It uses the
Amiga abstract graphic driver functions for the low-level
display management.
.Pp
Currently it does not support running X. You can still run
X the old way, but be warned, you cannot switch screens while
in X and when quitting it, it seems to hang. Switching a screen
then will bring up the text console. As always, we apologise for
the inconvenience.
.Pp
What it does support is hilite (bold), underline, reverse and
foreground/background colors.
.Pp
The number of virtual screens is limited only by
the available chip memory. Each virtual screen can have a
different display mode. The available display modes are listed
below. Other modes can easily be added to the kernel. The default
mode is 640x400x1.
.Pp
640x200x1, 640x200x2, 640x200x3, 640x200x4,
.Pp
640x400x1, 640x400x2, 640x400x3, 640x400x4,
.Pp
640x480x1, 640x480x2, 640x480x3, 640x480x4,
.Pp
Palette is the default palette compiled in the kernel, and currently
cannot be changed runtime.
.Pp
Also, the font is the 8x8 font compiled into the kernel, and cannot
be changed runtime.
.\"
.Sh SEE ALSO
.Xr wscons 4
.Xr wsdisplay 4
