NetBSD/src/share/man/man4/man4.amiga/bah.4
.\"	$NetBSD: bah.4,v 1.1 1995/03/01 11:42:41 chopps Exp $
.\"
.\" Copyright (c) 1995 Ignatios Souvatzis
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Ignatios Souvatzis
.\"      for the NetBSD project.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"

.\" The following requests are required for all man pages.
.Dd February 5, 1995
.Os NetBSD 1.0
.Dt BAH 4 amiga
.Sh NAME
.Nm bah
.Nd ARCnet driver for SMC COM90C26 based boards
.Sh SYNOPSIS
.Cd "bah* at zbus0"
.Sh DESCRIPTION
The 
.Nm
interface provides access to the 2.5 Mb/s ARCnet network via the
.Tn SMC
COM90C26
ARCnet chip set.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl .
The
.Nm
interface does not employ the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network. Instead, it uses the least significant 8 bits of the IP address
as hardware address, as described in
.Xr RFC 1051
as one option.
.Sh HARDWARE
The
.Nm
interface supports the following Zorro II expansion cards:
.Bl -tag -width "AMERISTAR" -offset indent
.It Em A2060
Commodore's arcnet card, manufacturer\ 514, product\ 9
.It Em AMERISTAR
Ameristar's arcnet card, manufacturer\ 1053, product\ 9
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifconfig 8 ,
.Xr inet 4 ,
.Xr intro 4 ,
.Xr RFC1051 
,
.Xr RFC1201
.Sh STANDARDS
RFC 1051 without ARP, using direct mapping of lower 8 IP address bits instead.
.Sh HISTORY
The
.Tn Amiga
.Nm
interface first appeared in
.Nx 1.0a
.Sh AUTHOR
Ignatios Souvatzis
