NetBSD/src/share/man/man4/man4.amiga/bppcsc.4
.\" $NetBSD: bppcsc.4,v 1.3 2011/01/14 11:14:02 phx Exp $
.Dd January 8, 2011
.Dt BPPCSC 4 amiga
.Os
.Sh NAME
.Nm bppcsc
.Nd BlizzardPPC 603e+ SCSI host adapter device driver
.Sh SYNOPSIS
.Cd "bppcsc0 at zbus0"
.Cd "scsibus* at bppcsc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the SCSI controller present on Blizzard
PPC 603e+ cards.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -width "BLIZZARDPPC" -offset indent
.It Em BLIZZARDPPC
Phase5 BlizzardPPC 603e+ on-board SCSI, manufacturer 8512,
product 110, serial number starting with "I"
.El
.Sh SEE ALSO
.Xr scsibus 4 ,
.Xr wesc 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq radoslaw.kujawa@gmail.com .
It was heavily based on the
.Xr wesc 4
driver and uses the siop machine-dependent backend, both written
by
.An Michael L. Hitch .
