NetBSD/src/share/man/man4/man4.amiga/bppcsc.4
.\" $NetBSD: bppcsc.4,v 1.9 2017/02/18 22:39:00 wiz Exp $
.\"
.\" Copyright (c) 2011 Radoslaw Kujawa
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt BPPCSC 4 amiga
.Os
.Sh NAME
.Nm bppcsc
.Nd BlizzardPPC 603e+ SCSI host adapter device driver
.Sh SYNOPSIS
.Cd "bppcsc0 at p5bus0"
.Cd "scsibus* at bppcsc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the SCSI controller present on Blizzard
PPC 603e+ cards.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -width "BLIZZARDPPC" -offset indent
.It Em BLIZZARDPPC
Phase5 BlizzardPPC 603e+ on-board SCSI, manufacturer 8512,
product 110, serial number starting with "I"
.El
.Sh SEE ALSO
.Xr amiga/wesc 4 ,
.Xr scsibus 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq Mt radoslaw.kujawa@gmail.com .
It was heavily based on the
.Xr amiga/wesc 4
driver and uses the siop machine-dependent backend, both written
by
.An Michael L. Hitch .
