NetBSD/src/share/man/man4/man4.amiga/clockport.4
.\" $NetBSD: clockport.4,v 1.4 2012/05/16 08:08:39 wiz Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 15, 2012
.Dt CLOCKPORT 4 amiga
.Os
.Sh NAME
.Nm clockport
.Nd introduction to clockport bus support and drivers
.Sh SYNOPSIS
.Cd "clockport* at a1k2cp0"
.Cd "clockport* at gencp?"
.Sh DESCRIPTION
Clockport is a general purpose non-autoconfiguring expansion bus, originally
present on the Amiga 1200, as a part of P9 memory connector.
.Sh SUPPORTED DEVICES
The
.Nx
includes the following clockport drivers:
.Bl -tag -offset indent
.It Xr com 4
Individual Computers SilverSurfer 16C550-based serial port.
.El
.Sh SEE ALSO
.Xr a1k2cp 4
.\" .Xr gencp 4
.Sh HISTORY
The
.Nm
subsystem appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
subsystem was written by
.An Radoslaw Kujawa Aq radoslaw.kujawa@gmail.com .
.Sh CAVEATS
Clockport performance is very low, even by Amiga standards.
.Pp
Probing the hardware on clockport might be unreliable.
