NetBSD/src/share/man/man4/man4.amiga/efa.4
.\" $NetBSD: efa.4,v 1.6.2.1 2014/08/20 00:02:35 tls Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 13, 2012
.Dt EFA 4 amiga
.Os
.Sh NAME
.Nm efa
.Nd ELBOX FastATA 1200 IDE disk controller driver
.Sh SYNOPSIS
.Cd "efa0 at mainbus0"
.\".Cd "options EFA_32BIT_IO"
.\".Cd "options EFA_NO_INTR"
.Sh DESCRIPTION
The
.Nm
driver provides support for the FastATA 1200 family of IDE controllers and
provides the interface with the hardware for the
.Xr ata 4
driver.
PIO modes 0, 3, 4 and 5 are supported.
.\".Pp
.\"The following kernel configuration options are available:
.\".Bl -ohang
.\".It Cd options EFA_32BIT_IO
.\"Use 32-bit data port.
.\".It Cd options EFA_NO_INTR
.\"Disable hardware interrupt support.
.\".El
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -width "ELBOX FastATA 1200 Mk-IV" -offset indent
.It Em ELBOX FastATA 1200 Mk-III
.It Em ELBOX FastATA 1200 Mk-IV
.It Em ELBOX FastATA 1200 Mk-IV CF/SATA
.El
.Sh SEE ALSO
.Xr ata 4 ,
.Xr wdc 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq Mt radoslaw.kujawa@gmail.com .
.Sh CAVEATS
Older versions of FastATA 1200 are NOT supported:
.Bl -tag -width "ELBOX FastATA 1200 Mk-II" -offset indent
.It Em ELBOX FastATA 1200 Mk-I
.It Em ELBOX FastATA 1200 Lite
.It Em ELBOX FastATA 1200 GOLD
.It Em ELBOX FastATA 1200 Mk-II
.El
.Pp
These devices do not generate hardware interrupts and need to be driven in
non-standard polling mode.
Code needed to support it is present in driver but does not work correctly.
.Pp
Some of the above devices were also marketed under PowerFlyer and Winner brands.
.Pp
The onboard Gayle IDE controller can not be used when FastATA is installed and
therefore, the
.Nm
driver will not coexist with
.Xr wdc 4
driver attached to
.Xr mainbus 4 .
Both
.Nm
and
.Xr wdc 4
can be enabled in the same kernel, but only one will attach (depending on the
return value of probe function in the
.Nm
driver).
.Pp
DMA modes are not supported, this is a hardware limitation.
.Sh BUGS
Performance is worse than with official AmigaOS driver from ELBOX.
.Pp
Disks partitioned in split mode, which is specific to official AmigaOS FastATA
driver, are not recognized in
.Nx .
