NetBSD/src/share/man/man4/man4.amiga/em4k.4
.\" $NetBSD: em4k.4,v 1.2 2013/01/29 22:01:28 wiz Exp $
.\"
.\" Copyright (c) 2013 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd 29 January, 2013
.Dt EM4K 4 amiga
.Os
.Sh NAME
.Nm em4k
.Nd ELBOX Mediator 4000 PCI bridge driver
.Sh SYNOPSIS
.Cd "em4k0 at zbus0"
.Cd "emmem0 at zbus0"
.Cd "pci* at empb0"
.Cd "options PCI_NETBSD_CONFIGURE"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI bus present on Mediator 4000 bridge and associated
PCI/Zorro daughterboards.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -offset indent
.It ELBOX Mediator PCI 4000D
.It ELBOX Mediator PCI 4000Di
.It ELBOX Mediator PCI 4000T
.It ELBOX Mediator PCI 3000D
.It ELBOX Mediator PCI 3000T
.El
MK-II editions are also supported.
.Sh SEE ALSO
.Xr empb 4 ,
.Xr mppb 4 ,
.Xr p5pb 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq radoslaw.kujawa@gmail.com .
It was developed using information obtained through reverse engineering
by
.An Frank Wille
and
.An Radoslaw Kujawa .
The authors have no access to official
documentation (which is only available under NDA).
.Sh BUGS
DMA to host memory is not supported.
It is unclear if the hardware supports DMA to host memory at all.
It is possible to implement DMA through bounce buffers in graphics card memory,
but this needs further research.
