NetBSD/src/share/man/man4/man4.amiga/empb.4
.\" $NetBSD: empb.4,v 1.1 2012/06/04 20:16:57 rkujawa Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 4, 2012
.Dt EMPB 4 amiga
.Os
.Sh NAME
.Nm empb
.Nd ELBOX Mediator 1200 PCI bridge driver 
.Sh SYNOPSIS
.Cd "empb0 at zbus0"
.Cd "emmem0 at zbus0"
.Cd "pci* at empb0"
.Cd "options PCI_NETBSD_CONFIGURE"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI bus present on Mediator 1200 bridge for
Amiga 1200.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -offset indent
.It ELBOX Mediator 1200 
.It ELBOX Mediator 1200 LT2 
.It ELBOX Mediator 1200 LT4 
.It ELBOX Mediator 1200 SX 
.It ELBOX Mediator 1200 TX 
.El
.Sh SEE ALSO
.Xr mppb 4 ,
.Xr p5pb 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq radoslaw.kujawa@gmail.com .
It was developed using information obtained through reverse engineering
by Frank Wille and Radoslaw Kujawa. The authors have no access to official
documentation (which is only available under NDA).
.Sh CAVEATS
Mediator 4000 and ZIV models are not supported, but support could easily be
added if the developers had access to this hardware.
.Sh BUGS
DMA to host memory is not supported.
This is a hardware limitation.
It is possible to implement DMA through bounce buffers in graphics card memory,
but this needs further research.
.Pp
PCI memory space access is buggy, this is a driver problem.
