NetBSD/src/share/man/man4/man4.amiga/grfrt.4
.\"	$NetBSD: grfrt.4,v 1.6.50.1 2017/04/21 16:53:16 bouyer Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt GRFRT 4 amiga
.Os
.Sh NAME
.Nm grfrt
.Nd 8-bit color graphics driver
.Sh SYNOPSIS
.Cd "grfrt0 at zbus0"
.Cd "grf1 at grfrt0"
.Cd "ite1 at grf1"
.Sh DESCRIPTION
The
.Nm
device driver supports graphics boards with the NCR 77C22E+ chipset.
It supports the minimal ioctl's needed to run X11.
.Sh HARDWARE
The
.Nm
interface supports the following ZorroII expansion card:
.Bl -tag -width "xxxxxxxxx" -offset indent
.It Em Retina Z2
A Zorro II only card. From Macro System, manufacturer 18260,
product 6.
.El
.Sh FILES
.Bl -tag -width "xxxxxxxxxx" -compact
.It Pa /dev/grf1
graphics interface special file
.It Pa /dev/ttye1
console interface special file for the internal terminal emulator
.El
.Sh SEE ALSO
.Xr amiga/console 4 ,
.Xr amiga/ite 4 ,
.Xr amiga/grfconfig 8
.Sh HISTORY
The
.Nm
interface first appeared in
.Nx 1.0 .
.Sh BUGS
.Nm
does not allow setting graphics modes with
.Xr amiga/grfconfig 8 .
