NetBSD/src/share/man/man4/man4.amiga/le.4
.\"	$NetBSD: le.4,v 1.3 1997/03/28 00:27:59 veego Exp $
.\"
.\" Copyright (c) 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This software was developed by the Computer Systems Engineering group
.\" at Lawrence Berkeley Laboratory under DARPA contract BG 91-66 and
.\" contributed to Berkeley.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	from: Header: le.4,v 1.2 92/10/13 05:31:33 leres Exp
.\"	from: @(#)le.4	8.1 (Berkeley) 6/9/93
.\"
.Dd August 30, 1994
.Dt LE 4 amiga
.Os NetBSD
.Sh NAME
.Nm le
.Nd Ethernet driver for AMD7990(LANCE) and AMD 79C960  based boards 
.Sh SYNOPSIS
.Cd "le* at zbus0"
.Sh DESCRIPTION
The 
.Nm
interface provides access to the 10 Mb/s Ethernet network via the
.Tn AMD
7990 and 79C960
.Tn LANCE
Ethernet chip set.
.Sh HARDWARE
The
.Nm
interface supports the following Zorro II expansion cards:
.Bl -tag -width "AMERISTAR" -offset indent
.It Em A2065
Commodore's ethernet card, manufacturer\ 514, product\ 112
.It Em AMERISTAR
Ameristar's ethernet card, manufacturer\ 1053, product\ 1
.It Em ARIADNE
Village Tronic's ethernet card, manufacturer\ 2167, product\ 201
.El
.Sh MEDIA SELECTION
The A2065 and Ameristar ethernet cards supports only manual media selection.
.Pp
The Ariadne card supports a software media selection for it's two
different connectors:
.Pp
.Bl -tag -width xxxxxxxxxxxxxx
.It 10Base2/BNC
also known as thinwire-ethernet
.It 10BaseT/UTP
also known as twisted pair
.El
.Pp
The Ariadne card uses an autoselect between UTP and BNC, so it uses UTP when an
active UTP line is connected or otherwise BNC.
To control this choice, use the following flag combinations with
.Xr ifconfig 8
or in your /etc/hostname.le? file.
.Pp
.Bl -tag -width xxxxxxxxxxxxxx
.It \ media auto
Use the autoselect between UTP and BNC (default).
.It \ media BNC
Use the BNC port.
.It \ media UTP
Use the UTP port.
.El
.Pp
.Sh HISTORY
The
.Tn Amiga
.Nm
interface first appeared in
.Nx 0.9a
.Pp
The Ariadne ethernet card first appeared with the
.Tn Amiga
ae interface in
.Nx 1.0a
and was converted to the
.Tn Amiga
.Nm
interface in
.Nx 1.2d
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr inet 4 ,
.Xr intro 4
