NetBSD/src/share/man/man4/man4.amiga/mntva.4
.\" $NetBSD: mntva.4,v 1.2.2.2 2016/11/04 14:48:56 pgoyette Exp $
.\"
.\" Copyright (c) 2016 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 3, 2016
.Dt MNTVA 4 amiga
.Os
.Sh NAME
.Nm mntva
.Nd MNTMN VA2000 graphics card driver
.Sh SYNOPSIS
.Cd "mntva* at zbus0"
.Cd "options MNTVA_CONSOLE"
.Sh DESCRIPTION
The
.Nm
driver provides support for the MNTMN VA2000 graphics card and provides an
interface for the machine independent
.Xr wscons 4
driver.
.Pp
The VA2000 integrated blitter engine is used to accelerate some of the text mode
drawing operations, like copying rows and columns.
.Pp
The X11 server is supported via the
.Xr wsfb 4
driver.
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 8.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Lukas F. Hartmann Aq Mt lukas@mnt.mn
and
.An Radoslaw Kujawa Aq Mt radoslaw.kujawa@gmail.com .
.Sh CAVEATS
There is no way to detect whether the card is used as a console.
Therefore, the user has to explicitely set the
.Dv MNTVA_CONSOLE
option in the kernel config file.
.Pp
Currently, the video mode is hard-coded to 1280x720 at 16 bpp.
.Sh BUGS
None known.
