NetBSD/src/share/man/man4/man4.amiga/mppb.4
.\" $NetBSD: mppb.4,v 1.2.2.2 2012/05/23 10:07:35 yamt Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 3, 2011
.Dt MPPB 4 amiga
.Os
.Sh NAME
.Nm mppb
.Nd Prometheus PCI bridge driver
.Sh SYNOPSIS
.Cd "mppb* at zbus0"
.Cd "pci* at mppb?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI bus present on Prometheus Zorro III to PCI
bridge card.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -width "PROMETHEUS" -offset indent
.It Em PROMETHEUS
Matay Prometheus. Manufacturer 44359, product 1.
.El
.Sh DIAGNOSTICS
.Bl -diag
.It Unable to allocate space in parent map.
The kernel has run out of virtual memory space.
.El
.Sh SEE ALSO
.Xr pci 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq radoslaw.kujawa@gmail.com .
.Sh BUGS
The hardware does not support DMA to host memory.
.Pp
The Prometheus does not support repeating of PCI transactions, instead if the
PCI card demands a retry of transaction, it returns value 0xFFFFFFFF.
This is currently not handled by the
.Nm
driver and will confuse some PCI card drivers.
.Pp
The system may run out of kernel virtual memory space if Prometheus is present.
This is due to fact that m68k-specific
.Xr pmap 9
code places User Page Table base address at statically defined address
0x10000000, which does not leave enough kernel space to fit a 512MB board, such
as the Prometheus.
It is possible to work around this problem, by moving User Page Table base
to higher address.
