NetBSD/src/share/man/man4/man4.amiga/p5pb.4
.\" $NetBSD: p5pb.4,v 1.13.12.1 2017/04/21 16:53:16 bouyer Exp $
.\"
.\" Copyright (c) 2011, 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt P5PB 4 amiga
.Os
.Sh NAME
.Nm p5pb
.Nd Phase5 PCI bridge driver
.Sh SYNOPSIS
.Cd "p5pb0 at p5bus0"
.Cd "pci* at p5pb?"
.Cd "genfb* at pci?"
.Cd "voodoofb* at pci?"
.Cd "options P5PB_DEBUG"
.Cd "options P5PB_CONSOLE"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI bus present on various devices equipped with
the Phase5 PCI bridge.
.Pp
The
.Dv P5PB_CONSOLE
option activates the necessary support for the console on CyberVisionPPC and
BlizzardVisionPPC, allowing the attachment of the
.Xr genfb 4
driver.
3Dfx Voodoo 3 boards installed in G-REX are also supported as console by
this option in conjuction with the
.Xr voodoofb 4
driver.
.Pp
Additional, excessive debugging output is enabled by the
.Dv P5PB_DEBUG
option.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -offset indent
.It Phase5 BlizzardVisionPPC graphics card
.It Phase5 CyberVisionPPC graphics card
.It DCE Computer G-REX 1200
.It DCE Computer G-REX 4000
.El
.Sh SEE ALSO
.Xr amiga/cv3dpb 4 ,
.Xr amiga/p5membar 4 ,
.Xr genfb 4 ,
.Xr pci 4
.\" .Xr pm2fb 4
.Pp
.Lk http://wiki.netbsd.org/users/rkujawa/g-rex/ "Programming the G-REX PCI bridge"
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq Mt radoslaw.kujawa@gmail.com .
.Sh CAVEATS
The
.Nx
developers don't have access to G-REX hardware or documentation.
Support for this device is based on best wishes.
.Pp
Support for
.Xr genfb 4
framebuffer on CVPPC/BVPPC needs more testing.
.Sh BUGS
DMA to host memory is not supported.
This is a driver limitation.
