NetBSD/src/share/man/man4/man4.amiga/p5pb.4
.\" $NetBSD: p5pb.4,v 1.6 2012/01/11 10:15:36 wiz Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 10, 2012
.Dt P5PB 4 amiga
.Os
.Sh NAME
.Nm p5pb
.Nd Phase5 PCI bridge driver
.Sh SYNOPSIS
.Cd "p5pb0 at p5bus0"
.Cd "pci* at p5pb?"
.Cd "genfb* at pci?"
.Cd "options P5PB_OLD_FIRMWARE"
.Cd "options P5PB_GENFB"
.Cd "options P5PB_DEBUG"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI bus present on various devices equipped with
the Phase5 PCI bridge.
.Pp
Processor boards running firmware revision older than 44.69 need a kernel
configured with the
.Dv P5PB_OLD_FIRMWARE
option.
.Pp
The
.Nm
driver provides necessary support for CyberVisionPPC and BlizzardVisionPPC,
allowing attachment of
.Xr genfb 4
driver.
Owners of these cards should enable the
.Dv P5PB_GENFB
option.
.Pp
Additional, excessive debugging output is enabled by the
.Dv P5PB_DEBUG
option.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -offset indent
.It Phase5 BlizzardVisionPPC graphics card.
.It Phase5 CyberVisionPPC graphics card.
.It DCE Computer G-REX 1200 (experimental, first slot only).
.It DCE Computer G-REX 4000 (experimental, first slot only).
.El
.Sh SEE ALSO
.Xr genfb 4 ,
.\" .Xr pm2fb 4
.\" .Xr cv3dpb 4 ,
.Xr p5membar 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq radoslaw.kujawa@gmail.com .
.Sh CAVEATS
The
.Nx
developers don't have access to G-REX hardware or documentation.
Support for this device is based on best wishes.
.Pp
Support for
.Xr genfb 4
framebuffer on CVPPC/BVPPC needs more testing.
.Sh BUGS
The current version of this driver depends on PCI bus setup and
enumeration done by the firmware.
.Pp
DMA to host memory is not supported.
This is a driver limitation.
.Pp
The
.Dv P5PB_OLD_FIRMWARE
option should only be enabled if PCI hardware is present.
Otherwise a kernel panic might occur due to bus error.
