NetBSD/src/share/man/man4/man4.amiga/p5pb.4
.\" $NetBSD: p5pb.4,v 1.2 2011/08/04 20:40:52 wiz Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 26, 2011
.Dt P5PB 4 amiga
.Os
.Sh NAME
.Nm p5pb
.Nd Phase5 PCI bridge driver
.Sh SYNOPSIS
.Cd "p5pb0 at zbus0"
.Cd "pci* at p5pb?"
.Cd "genfb* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI bus present on BlizzardVisionPPC and
CyberVisionPPC graphics cards.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -width "BLIZZARDVISIONPPC" -offset indent
.It Em BLIZZARDVISIONPPC
Phase5 BlizzardVisionPPC graphics card.
.It Em CYBERVISIONPPC
Phase5 CyberVisionPPC graphics card.
.El
.Sh SEE ALSO
.Xr genfb 4 ,
.Xr pci 4
.\" .Xr pm2fb 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 6.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa Aq radoslaw.kujawa@gmail.com .
.Sh BUGS
Current version of this driver depends on PCI bus setup and enumeration
done by the firmware.
.Pp
The driver will not attach at all, if there is no AutoConfig entry
for CVPPC/BVPPC card (Zorro product ID 110).
Some firmware revisions are known not to create this entry.
.Pp
It is not (yet) possible to use the CVPPC/BVPPC as a console.
