NetBSD/src/share/man/man4/man4.amiga/xsh.4
.\" $NetBSD: xsh.4,v 1.5.8.2 2014/08/20 00:02:35 tls Exp $
.\"
.\" Copyright (c) 2013 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 11, 2013
.Dt XSH 4 amiga
.Os
.Sh NAME
.Nm xsh
.Nd Individual Computers X-Surf 100 driver
.Sh SYNOPSIS
.Cd "xsh* at zbus0"
.Cd "ne* at xshbus?"
.Cd "ukphy* at mii? phy ?"
.Sh DESCRIPTION
The
.Nm
driver provides support for ethernet interface present on the Individual
Computers X-Surf 100 card.
It acts as a bus attachment layer for the machine idependent
.Xr ne 4
driver, which supports the AX88796 chip.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -offset indent
.It Individual Computers X-Surf 100
.El
.Sh SEE ALSO
.Xr mii 4 ,
.Xr ne 4
.Pp
.Lk http://wiki.icomp.de/wiki/X-Surf-100 "X-Surf 100 on Individual Computers wiki"
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa
.Aq radoslaw.kujawa@gmail.com .
.Sh CAVEATS
The planned USB module is not supported (yet).
