NetBSD/src/share/man/man4/man4.amiga/xsurf.4
.\" $NetBSD: xsurf.4,v 1.2.4.1 2012/11/20 03:00:51 tls Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 9, 2012
.Dt XSURF 4 amiga
.Os
.Sh NAME
.Nm xsurf
.Nd Individual Computers X-Surf driver
.Sh SYNOPSIS
.Cd "xsurf* at zbus0"
.Cd "ne* at xsurfbus?"
.Cd "gencp* at xsurfbus?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Individual Computers X-Surf ethernet card.
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -offset indent
.It Individual Computers X-Surf
.It E3B Deneb (fake X-Surf board, firmware v11, clockport only)
.El
.Sh SEE ALSO
.Xr clockport 4 ,
.\" .Xr gencp 4 ,
.Xr ne 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa
.Aq radoslaw.kujawa@gmail.com .
The
.Xr ne 4
attachment code was split from Ariadne II driver, written by Bernd Ernesti and
extended by Ignatios Souvatzis.
.Sh CAVEATS
IDE controller present on X-Surf cards is not supported.
Support for clockports remains largely untested.
