NetBSD/src/share/man/man4/man4.amiga/z3rambd.4
.\" $NetBSD: z3rambd.4,v 1.1 2012/11/26 00:36:01 rkujawa Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Radoslaw Kujawa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 26, 2012
.Dt Z3RAMBD 4 amiga
.Os
.Sh NAME
.Nm z3rambd 
.Nd Zorro III RAM block device driver
.Sh SYNOPSIS
.Cd "z3rambd* at zbus0"
.Cd "altmem* at z3rambd?"
.Sh DESCRIPTION
The
.Nm
driver provides support using Zorro III RAM boards as block devices (e.g. for
swap).
.Sh HARDWARE
The
.Nm
driver supports the following hardware:
.Bl -tag -offset indent
.It AmigaKit ZorRAM
.El
.Sh SEE ALSO
.Xr altmem 4 ,
.Xr boot 8
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Radoslaw Kujawa
.Aq radoslaw.kujawa@gmail.com .
.Sh CAVEATS
Currently it is up to user to ensure that given memory board is not used by
the kernel as normal RAM.
It is usually safe to pass
.Ic -n0
and
.Ic -p
parameters to boot loader.
.Pp
If the kernel is compiled wihtout
.Nm
driver, it is possible to use Zorro III
memory boards as normal RAM in some configurations.
However, this might have severe performance consequences.
It is advised to use Zorro III memory boards as swap where possible.
