NetBSD/src/share/man/man4/man4.amiga/zz9k.4
.\" $NetBSD: zz9k.4,v 1.1 2023/05/03 13:49:30 phx Exp $
.\"
.\" Copyright (c) 2016 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Alain Runa.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 2, 2023
.Dt ZZ9K 4 amiga
.Os
.Sh NAME
.Nm zz9k
.Nd MNT ZZ9000 graphics card driver
.Sh SYNOPSIS
.Cd "zz9k*	at zbus?"
.Cd "zzfb*	at zz9k?"
.Cd "options	ZZFB_CONSOLE"
.Cd "zz*	at zz9k?"
.Cd "zzax*	at zz9k?"
.Cd "zzusb*	at zz9k?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the MNT ZZ9000 graphics card and ethernet interface.
Each driver can be individually enabled or disabled. However all ZZ9000 drivers
depend on the zz9k* as the root to work.
.Pp
The zzfb*
.Xr wscons 4
driver implements blitter accelerated support for the boot console. Support
for an unaccelerated X11 framebuffer is also available via the
.Xr wsfb 4
driver.
.Pp
The zz* driver implements the ZZ9000 ethernet interface.
.Pp
There is also provision for for adding ZZ9000AX audio card support as zzax* and
the USB port support as zzusb* at a later time. None of these are functional
yet.
.Sh SEE ALSO
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
device first appeared in
.Nx 10.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Alain Runa Aq Mt alain74@gmx.net
and was inspired by the original ZZ9000 drivers for AmigaOS. 
.Sh CAVEATS
For the ZZ9000 to assume the boot console, the user has to explicitly set the
.Dv FBZZ_CONSOLE
option in the kernel config file.
.Pp
Currently, the video mode is hard-coded to 1280x720 at 8 bpp for the console
emulation and 16 bpp for the framebuffer used by X11. Resolutions and color
depths can be individually changed in the zz9k_fb.c source code. Please follow
the source code comments.
.Pp
zz* ethernet driver is considered experimental. As the MAC address is not
stored permanently in the card, it will use it's default address. This should
not impose any problem unless two ZZ9000 will be used in the same LAN. Please
configure the desired link address for the zz0 interface in rc.conf or in the
/etc/ifconfig.zz0 file, to avoid a MAC address collision.
.Pp
zzax* audio card driver is not functional yet. Only a basic skeleton source code
is available for a possible later implementation.
.Pp
zzusb* USB driver is not functional yet. Only a basic skeleton source code is
available for a possible later implementation.
.Sh BUGS
None known.
