NetBSD/src/sbin/fsirand/fsirand.8
.\"	$NetBSD: fsirand.8,v 1.2 1997/09/14 14:58:53 lukem Exp $
.\"
.\" Copyright (c) 1997 Christos Zoulas
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Christos Zoulas.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 7, 1997
.Dt FSIRAND 8 
.Os
.Sh NAME
.Nm fsirand 
.Nd install random inode generation numbers in a filesystem
.Sh SYNOPSIS
.Nm
.Op Fl x Ar constant
.Op Fl p
.Ar special
.Sh DESCRIPTION
.Nm
writes random inode generation numbers for all the inodes on device
.Ar special .
These random numbers make the NFS filehandles less predictable, increasing
security of exported filesystems.
.Pp
.Nm
should be run on a clean and unmounted filesystem.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl x Ar constant
Exclusive-or the given constant with the random number used in the generation
process.
.It Fl p
Print the current inode generation numbers; the filesystem is not modified.
.El
.Pp
.Nm
exits zero on success, non-zero on failure.
.Sh BUGS
The current implementation does not use a good random number generator,
so the randomization can be predicted.
.Sh SEE ALSO
.Xr fsck_ffs 8 ,
.Xr newfs 8 
