NetBSD/src/usr.bin/midiplay/midiplay.1
.\" $NetBSD: midiplay.1,v 1.1 1998/08/12 21:39:12 augustss Exp $
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Author: Lennart Augustsson
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd Aug 12, 1998
.Dt MIDIPLAY 1
.Os
.Sh NAME
.Nm midiplay
.Nd play MIDI files
.Sh SYNOPSIS
.Nm
.Op Fl d Ar devno
.Op Fl f Ar file
.Op Fl l
.Op Fl m
.Op Fl t Ar tempo
.Op Fl v
.Op Fl x
.Op Ar file ...
.Sh DESCRIPTION
The 
.Nm
command plays MIDI files using the sequencer device.
If no file name is given it will play from standard input, otherwise
it will play the named files.
.Pp
The
.Fl d
flag gives the number of the MIDI device used for output (as listed
by the
.Fl l
flag).
.Pp
The
.Fl f
flag can be used to name the sequencer device.
.Pp
The
.Fl l
flag is used to list the possible devices without playing anything.
.Pp
The
.Fl m
flag will show MIDI file meta events (copyright, lyrics, etc).
.Pp
The
.Fl t
flag can be used to change the tempo of the playing.
.Pp
The 
.Fl v
flag makes the program verbose.
.Pp
The
.Fl x
file will play a small sample sound.
.Sh FILES
.Bl -tag -width /dev/music
.It Pa /dev/music
MIDI sequencer device
.El
.\".Sh ENVIRONMENT
.\".Bl -tag -width MIDIDEVICE
.\".It Pa AUDIOCTLDEVICE
.\"the audio control device to use.
.\".El
.Sh SEE ALSO
.Xr midi 4
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 1.4 .
.Sh BUGS
It may take a long while before playing stops when
.Nm
is interrupted since the sequencer and MIDI buffers will still
be emptied.
