NetBSD/src/sbin/modload/modload.8
.\" $NetBSD: modload.8,v 1.30 2009/05/19 22:35:41 wiz Exp $
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"          This product includes software developed for the
.\"          NetBSD Project.  See http://www.NetBSD.org/ for
.\"          information about NetBSD.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" <<Id: LICENSE,v 1.2 2000/06/14 15:57:33 cgd Exp>>
.\"
.Dd May 19, 2009
.Dt MODLOAD 8
.Os
.Sh NAME
.Nm modload
.Nd load a kernel module
.Sh SYNOPSIS
.Nm
.Op Fl f
.Op Fl b Ar name=val
.Op Fl i Ar name=val
.Op Fl s Ar name=val
.Ar module
.Nm
.Fl p
.Op Fl b Ar name=val
.Op Fl i Ar name=val
.Op Fl s Ar name=val
.Sh DESCRIPTION
The
.Nm
utility loads a kernel module specified by the
.Ar module
paramamter into the running system.
.Pp
The current working directory is first searched for the module object file.
If not found there, the default system module areas are searched.
.Pp
The options to
.Nm
are as follows:
.Bl -tag -width xbxnamexvalx
.It Fl b Ar name=val
Pass the module a boolean property with the name
.Ar name .
.Ar val
may be either
.Dv true
or
.Dv false .
.It Fl f
When a module is loaded, the kernel checks if the module is compatible
with the running kernel and will refuse to load modules that are
potentially incompatible.
This option disables compatibility checks.
.Em Note :
an incompatible module can cause system instability, including data
loss or corruption.
.It Fl i Ar name=val
Pass the module an integer property with the name
.Ar name
and integral value
.Ar val .
.It Fl p
Output a property list suitable for loading along with a module.
When using this option, you do not need to specify a module.
.It Fl s Ar name=val
Pass the module a string property with the name
.Ar name
and string value
.Ar val .
.El
.Sh DIAGNOSTICS
The
.Nm
utility exits with a status of 0 on success
and with a nonzero status if an error occurs.
.Sh SEE ALSO
.Xr modstat 8 ,
.Xr modunload 8
.Sh HISTORY
The
.Nm
command was designed to be similar in functionality
to the corresponding command in
.Tn "SunOS 4.1.3" .
