NetBSD/src/share/man/man4/man4.mvme68k/clock.4
.\" $NetBSD: clock.4,v 1.3.50.1 2017/04/21 16:53:17 bouyer Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Steve C. Woodford.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 17, 2017
.Dt CLOCK 4 mvme68k
.Os
.Sh NAME
.Nm clock
.Nd Clock driver for Motorola MVME68K Single Board Computers
.Sh SYNOPSIS
.Cd "clock0 at pcc? ipl 5"
.Cd "clock0 at pcctwo? ipl 5"
.Sh DESCRIPTION
The
.Nm
driver uses the counter/timer facilities of the MVME147's
.Nm pcc
driver or the MVME167/MVME177's
.Nm pcctwo
driver to provide two independent hardware clocks for use by the
.Nx
kernel.
.Pp
Both clock interrupts are set to 100Hz, with one used to provide
the master kernel stats clock tick. The other is used for profiling
purposes.
.Sh SEE ALSO
.Xr mvme68k/intro 4 ,
.Xr mvme68k/pcc 4 ,
.Xr mvme68k/pcctwo 4
