NetBSD/src/usr.bin/vi/recover/virecover.8
.\" $NetBSD: virecover.8,v 1.1 2006/10/08 14:19:18 elad Exp $
.\"
.\" Copyright (c) 2006 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jeremy C. Reed.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 7, 2006
.Dt VIRECOVER 8
.Os
.Sh NAME
.Nm virecover
.Nd report recovered vi edit sessions
.Sh SYNOPSIS
.Em /usr/libexec/virecover
.Sh DESCRIPTION
The
.Nm
utility sends emails to users who have
.Xr vi 1
recovery files.
.Pp
This email gives the name of the file that was
saved for recovery and instructions for recovering
most, if not all, of the changes to the file
(by using the
.Fl r
option with
.Xr vi 1 ).
.Pp
If the backup files have the execute bit set or are zero length,
then they have not been modified, so
.Nm
deletes them to clean up.
.Nm
also removes recovery files that are corrupted, zero length
or do not have a corresponding backup file.
.Sh FILES
.Bl -tag -width "/var/tmp/vi.recover/recover.*" -compact
.It Pa /var/tmp/vi.recover/recover.*
.Xr vi 1
recovery files
.It Pa /var/tmp/vi.recover/vi.*
.Xr vi 1
editor backup files
.El
.Sh SEE ALSO
.Xr vi 1
.Sh HISTORY
The
.Xr vi 1
recovery was originally done at boot time in
.Xr rc 8 .
This script, previously known as
.Nm recover.script ,
is from nvi and was added to
.Nx
in 2006.
.Sh AUTHORS
.An Jeremy C. Reed Aq reed@reedmedia.net
