NetBSD/src/usr.sbin/nvmmctl/nvmmctl.8
.\"	$NetBSD: nvmmctl.8,v 1.3 2020/09/05 07:22:26 maxv Exp $
.\"
.\" Copyright (c) 2019-2020 Maxime Villard, m00nbsd.net
.\" All rights reserved.
.\"
.\" This code is part of the NVMM hypervisor.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 27, 2019
.Dt NVMMCTL 8
.Os
.Sh NAME
.Nm nvmmctl
.Nd program to control virtual machines
.Sh SYNOPSIS
.Nm nvmmctl
.Ar command
.Op Ar arguments
.Sh DESCRIPTION
The
.Nm
command can be used to control and inspect the state of virtual machines in the
system.
.Pp
The first argument,
.Ar command ,
specifies the action to take.
Valid commands are:
.Bl -tag -width XXXXXXXX
.It identify
Display the capabilities of the system.
.It list
Display information on each virtual machine registered in the system.
.El
.Sh SEE ALSO
.Xr libnvmm 3 ,
.Xr nvmm 4
.Sh AUTHORS
The
.Nm
tool was written by
.An Maxime Villard .
