NetBSD/src/share/man/man8/hpcboot.8
.\"	$NetBSD: hpcboot.8,v 1.1 2004/04/03 03:08:35 uwe Exp $
.\"
.\" Copyright (c) 2004 Valeriy E. Ushakov
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Neither the name of the author nor the names of any
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 3, 2004
.Dt HPCBOOT 8
.Os
.Sh NAME
.Nm hpcboot
.Nd load and boot kernel from Windows\ CE
.Sh SYNOPSIS
.Nm hpcboot.exe
.Sh DESCRIPTION
.Nm
is a program that runs on Windows\ CE.
It loads and executes the specified
.Nx
kernel.
.Nm
supports hpcarm, hpcmips, and hpcsh ports.
.\" FIXME: document elements of the hpcboot GUI.
.Sh SEE ALSO
.Xr kloader 4
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 1.6 .
.Sh BUGS
.Nm
reads the entire kernel image at once,
and requires enough free area on the main memory.
