NetBSD/src/share/man/man8/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/MAKEDEV.tmpl and
.\" *** src/share/man/man8/MAKEDEV.8.template
.\" ***
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\" $NetBSD: MAKEDEV.8,v 1.1 2003/10/24 20:26:57 jdolecek Exp $
.\"
.\" Copyright (c) 2001, 2003 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 24, 2003
.Dt MAKEDEV 8
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm
.Ar special Op Ar ...
.Pp
.Nm
.Ar device Op Ar ...
.Sh DESCRIPTION
.Nm
is used to create system and device special files.
As arguments it takes the names of known devices, like
.Ar sd0 ,
or of special targets, like
.Pa all
or
.Pa std ,
which create a collection of device special files.
.Pp
The script is in
.Pa /dev/MAKEDEV
and must be called from the
.Pa /dev
directory.
For the creation of the devices,
.Xr mknod 8
is used, which can only be used for creating devices by the
super-user.
.Pp
The special targets supported on
.Nx
are:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
Makes all known devices, including local devices. Tries to make the 'standard' number of each type.
.It Ar init
A set of devices that is used for MFS /dev by init. May be equal to ``all''.
.It Ar floppy
Devices to be put on install floppies
.It Ar ramdisk
Devices to be put into INSTALL kernel ramdisks.
.It Ar std
Standard devices
.It Ar local
Configuration specific devices
.It Ar usbs
Make USB devices
.It Ar isdns
Make ISDN devices
.El
.Pp
Please note that any hash marks
.Pq Dq #
in the following list of supported device targets must be replaced by
digits when calling
.Nm :
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes :
. Bl -tag -width 0123456789 -compact
. It Ar st#
SCSI tapes, see
.Xr \&st 4
. It Ar wt#
QIC-interfaced (e.g. not SCSI) 3M cartridge tape, see
.Xr \&wt 4
. It Ar ht#
MASSBUS TM03 and TU??
. It Ar mt#
MSCP tapes (e.g. TU81, TK50)
. It Ar tm#
UNIBUS TM11 and TE10 emulations (e.g. Emulex TC-11)
. It Ar ts#
UNIBUS TS11
. It Ar ut#
UNIBUS TU45 emulations (e.g. si 9700)
. It Ar uu#
TU58 cassettes on DL11 controller
. El
.It Disks :
. Bl -tag -width 0123456789 -compact
. It Ar ccd#
Concatenated disk devices, see
.Xr \&ccd 4
. It Ar cd#
SCSI or ATAPI CD-ROM, see
.Xr \&cd 4
. It Ar cgd#
Cryptographic disk devices, see
.Xr \&cgd 4
. It Ar raid#
RAIDframe disk devices, see
.Xr \&raid 4
. It Ar sd#
SCSI disks, see
.Xr \&sd 4
. It Ar wd#
``winchester'' disk drives (ST506,IDE,ESDI,RLL,...), see
.Xr \&wd 4
. It Ar bmd#
Nereid bank memory disks
. It Ar ed#
IBM PS/2 ESDI disk devices
. It Ar fd#
``floppy'' disk drives (3 1/2``, 5 1/4'')
. It Ar gdrom#
Dreamcast ``gigadisc'' CD-ROM drive
. It Ar hk#
UNIBUS RK06 and RK07
. It Ar hp#
MASSBUS RM??
. It Ar ld#
Logical disk devices (e.g., hardware RAID), see
.Xr \&ld 4
. It Ar mcd#
Mitsumi CD-ROM, see
.Xr \&mcd 4
. It Ar md#
Memory pseudo-disk devices, see
.Xr \&md 4
. It Ar ofdisk#
OpenFirmware disk devices
. It Ar ra#
MSCP disks (RA??, RD??)
. It Ar rb#
730 IDC w/ RB80 and/or RB02
. It Ar rd#
HDC9224 RD disks on VS2000
. It Ar rl#
UNIBUS RL02
. It Ar rx#
MSCP floppy disk (RX33/50/...)
. It Ar up#
Other UNIBUS devices (e.g. on Emulex SC-21V controller)
. It Ar vnd#
``file'' pseudo-disks, see
.Xr \&vnd 4
. It Ar xd#
Xylogic 753/7053 disks
. It Ar xy#
Xylogic 450/451 disks
. El
.It Pointing devices :
. Bl -tag -width 0123456789 -compact
. It Ar wsmouse#
wscons mouse events, see
.Xr \&wsmouse 4
. It Ar lms#
Logitech bus mouse
. It Ar mms#
Microsoft bus mouse
. It Ar qms#
``quadrature mouse''
. It Ar pms#
PS/2 mouse
. It Ar mouse
Mouse (provides events, for X11)
. El
.It Keyboard devices :
. Bl -tag -width 0123456789 -compact
. It Ar wskbd#
wscons keyboard events, see
.Xr \&wskbd 4
. It Ar kbd
Raw keyboard (provides events, for X11)
. It Ar kbdctl
Keyboard control
. El
.It Terminals/Console ports :
. Bl -tag -width 0123456789 -compact
. It Ar tty[01]#
Standard serial ports, see
.Xr \&tty 4
. It Ar tty0#
SB1250 (``sbscn'') serial ports (sbmips), see
.Xr \&tty 4
. It Ar ttyE#
wscons - Workstation console (``wscons'') glass-tty emulators
. It Ar ttyCZ?
Cyclades-Z multiport serial boards. Each ``unit'' makes 64 ports.
. It Ar ttyCY?
Cyclom-Y multiport serial boards. Each ``unit'' makes 32 ports.
. It Ar ttye#
ITE bitmapped consoles
. It Ar ttyv0
pccons
. It Ar ttyC?
NS16550 (``com'') serial ports
. It Ar ttyS#
SA1110 serial port (hpcarm)
. It Ar ttyTX?
TX39 internal serial ports (hpcmips)
. It Ar ttyB?
DEC 3000 ZS8530 (``scc'') serial ports (alpha)
. It Ar ttyA#
Mfc serial ports (amiga)
. It Ar ttyB#
Msc serial ports (amiga)
. It Ar ttyC#
Com style serial ports (DraCo, HyperCom) (amiga) On the DraCo, units 0 and 1 are the built-in ``modem'' and ``mouse'' ports, if configured.
. It Ar ttyA0
8530 Channel A (formerly ser02) (atari)
. It Ar ttyA1
8530 Channel B (formerly mdm02) (atari)
. It Ar ttyB0
UART on first 68901 (formerly mdm01) (atari)
. It Ar ixpcom
IXP12x0 COM ports
. It Ar dca#
HP200/300 single port serial interface
. It Ar dcm#
HP200/300 4 port serial mux interface
. It Ar apci#
HP400 4 port serial mux interface
. It Ar ttya
'ttya' system console (luna68k)
. It Ar ttyb
Second system serial port (luna68k)
. It Ar tty#
Onboard serial ports (mvme68k) On the mvme147 these are: ttyZ1, ttyZ2 and ttyZ3. On the mvme167, and '177: ttyC1, ttyC2 and ttyC3. Note that tty[CZ]0 is grabbed by the console device so is not created by default, see
.Xr \&tty 4
. It Ar dc#
PMAX 4 channel serial interface (kbd, mouse, modem, printer)
. It Ar scc#
82530 serial interface (pmax), see
.Xr \&scc 4
. It Ar ttyZ#
Zilog 8530 (``zstty'') serial ports
. It Ar tty[abcd]
Built-in serial ports (sparc)
. It Ar tty#
Z88530 serial controllers (sparc64), see
.Xr \&tty 4
. It Ar ttyh#
SAB82532 serial controllers (sparc64)
. It Ar tty[a-j]
Built-in serial ports (sun2, sun3)
. It Ar ttyC?
pccons (arc)
. It Ar dz#
UNIBUS DZ11 and DZ32 (vax)
. It Ar dh#
UNIBUS DH11 and emulations (e.g. Able DMAX, Emulex CS-11) (vax)
. It Ar dmf#
UNIBUS DMF32 (vax)
. It Ar dhu#
UNIBUS DHU11 (vax)
. It Ar dmz#
UNIBUS DMZ32 (vax)
. It Ar dl#
UNIBUS DL11 (vax)
. El
.It Terminal multiplexors :
. Bl -tag -width 0123456789 -compact
. It Ar apci#
HP400 4 port serial mux interface
. It Ar dc#
4 channel serial interface (keyboard, mouse, modem, printer)
. It Ar dca#
HP200/300 single port serial interface
. It Ar dcm#
HP200/300 4 port serial mux interface
. It Ar dh#
UNIBUS DH11 and emulations (e.g. Able DMAX, Emulex CS-11)
. It Ar dhu#
UNIBUS DHU11
. It Ar dl#
UNIBUS DL11
. It Ar dmf#
UNIBUS DMF32
. It Ar dmz#
UNIBUS DMZ32
. It Ar dz#
UNIBUS DZ11 and DZ32
. It Ar scc#
82530 serial interface, see
.Xr \&scc 4
. El
.It Call units :
. Bl -tag -width 0123456789 -compact
. It Ar dn#
UNIBUS DN11 and emulations (e.g. Able Quadracall)
. El
.It Pseudo terminals :
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 62 master and slave pseudo terminals, see
.Xr \&pty 4
. It Ar opty
First 16 ptys, to save inodes on install media
. It Ar ipty
First 2 ptys, for install media use only
. El
.It Printers :
. Bl -tag -width 0123456789 -compact
. It Ar arcpp#
Archimedes parallel port
. It Ar lpt#
Stock lp
. It Ar lpa#
Interruptless lp
. It Ar par#
Amiga motherboard parallel port
. El
.It USB devices :
. Bl -tag -width 0123456789 -compact
. It Ar usb#
USB control devices, see
.Xr \&usb 4
. It Ar uhid#
USB generic HID devices, see
.Xr \&uhid 4
. It Ar ulpt#
USB printer devices, see
.Xr \&ulpt 4
. It Ar ugen#
USB generic devices, see
.Xr \&ugen 4
. It Ar urio#
USB Diamond Rio 500 devices, see
.Xr \&urio 4
. It Ar uscanner#
USB scanners, see
.Xr \&uscanner 4
. It Ar ttyU#
USB modems
. El
.It ISDN devices :
. Bl -tag -width 0123456789 -compact
. It Ar isdn
Communication between userland isdnd and kernel, see
.Xr \&isdn 4
. It Ar isdnctl
Control device, see
.Xr \&isdnctl 4
. It Ar isdnbchan#
Raw b-channel access, see
.Xr \&isdnbchan 4
. It Ar isdntel#
Telephony device, see
.Xr \&isdntel 4
. It Ar isdnteld#
Telephony dialout device
. It Ar isdntrc#
Trace device, see
.Xr \&isdntrc 4
. El
.It Video devices :
. Bl -tag -width 0123456789 -compact
. It Ar bwtwo#
Monochromatic frame buffer
. It Ar cgtwo#
8-bit color frame buffer
. It Ar cgthree#
8-bit color frame buffer
. It Ar cgfour#
8-bit color frame buffer
. It Ar cgsix#
Accelerated 8-bit color frame buffer
. It Ar cgeight#
24-bit color frame buffer
. It Ar etvme
Tseng et-compatible cards on VME
. It Ar ik#
UNIBUS interface to Ikonas frame buffer
. It Ar leo
Circad Leonardo VME-bus true color
. It Ar ps#
UNIBUS interface to Picture System 2
. It Ar qv#
QVSS (MicroVAX) display
. It Ar tcx#
Accelerated 8/24-bit color frame buffer
. El
.It Maple bus devices :
. Bl -tag -width 0123456789 -compact
. It Ar maple
Maple bus control devices
. It Ar mlcd#
Maple bus LCD devices
. It Ar mmem#
Maple bus storage devices
. El
.It Special purpose devices :
. Bl -tag -width 0123456789 -compact
. It Ar ad#
UNIBUS interface to Data Translation A/D converter
. It Ar agp#
AGP GART devices, see
.Xr \&agp 4
. It Ar altq
ALTQ control interface
. It Ar apm
Power management device
. It Ar audio#
Audio devices, see
.Xr \&audio 4
. It Ar beep
PC speaker
. It Ar bell#
OPM bell device (x86k)
. It Ar bktr
Brooktree 848/849/878/879 based TV cards, see
.Xr \&bktr 4
. It Ar bpf#
Packet filter, see
.Xr \&bpf 4
. It Ar cfs#
Coda file system device
. It Ar ch#
SCSI media changer, see
.Xr \&ch 4
. It Ar cir#
Consumer IR, see
.Xr \&cir 4
. It Ar clockctl
Clock control for non root users, see
.Xr \&clockctl 4
. It Ar crypto
Hardware crypto access driver
. It Ar dmoverio
Hardware-assisted data movers, see
.Xr \&dmoverio 4
. It Ar dpt#
DPT/Adaptec EATA RAID management interface, see
.Xr \&dpt 4
. It Ar dpti#
DPT/Adaptec I2O RAID management interface, see
.Xr \&dpti 4
. It Ar fb#
Generic framebuffer pseudo-device
. It Ar fd
File descriptors, see
.Xr \&fd 4
. It Ar grf#
Graphics frame buffer device
. It Ar hil
HP300 HIL input devices
. It Ar icp
ICP-Vortex/Intel RAID control interface, see
.Xr \&icp 4
. It Ar iic#
IIC bus device
. It Ar iop#
I2O IOP control interface, see
.Xr \&iop 4
. It Ar ipl
IP Filter
. It Ar irframe#
IrDA physical frame, see
.Xr \&irframe 4
. It Ar ite#
Terminal emulator interface to HP300 graphics devices
. It Ar joy#
Joystick device, see
.Xr \&joy 4
. It Ar kttcp
Kernel ttcp helper device, see
.Xr \&kttcp 4
. It Ar lkm
Loadable kernel modules interface, see
.Xr \&lkm 4
. It Ar magma#
Magma multiport serial/parallel cards
. It Ar midi#
MIDI, see
.Xr \&midi 4
. It Ar mlx#
Mylex DAC960 control interface, see
.Xr \&mlx 4
. It Ar mly#
Mylex AcceleRAID/eXtremeRAID control interface, see
.Xr \&mly 4
. It Ar np#
UNIBUS Ethernet co-processor interface, for downloading.
. It Ar nsmb#
SMB requester, see
.Xr \&nsmb 4
. It Ar openfirm
OpenFirmware accessor
. It Ar pci#
PCI bus access devices, see
.Xr \&pci 4
. It Ar pf
PF packet filter
. It Ar pow#
Power management device (x86k)
. It Ar px#
PixelStamp Xserver access, see
.Xr \&px 4
. It Ar radio#
Radio devices, see
.Xr \&radio 4
. It Ar random
Random number generator, see
.Xr \&rnd 4
. It Ar rtc#
Atari RealTimeClock
. It Ar satlink#
PlanetConnect satellite receiver driver
. It Ar scsibus#
SCSI busses, see
.Xr \&scsi 4 ,
.Xr \&scsictl 8
. It Ar se#
SCSI Ethernet, see
.Xr \&se 4
. It Ar ses#
SES/SAF-TE SCSI Devices, see
.Xr \&ses 4
. It Ar speaker
PC speaker, see
.Xr \&speaker 4
. It Ar sram
Battery backuped memory (x86k)
. It Ar ss#
SCSI scanner, see
.Xr \&ss 4
. It Ar stic#
PixelStamp interface chip
. It Ar sysmon
System Monitoring hardware
. It Ar systrace
Syscall tracer, see
.Xr \&systrace 4
. It Ar tun#
Network tunnel driver, see
.Xr \&tun 4
. It Ar twe
3ware Escalade control interface, see
.Xr \&twe 4
. It Ar uk#
Unknown SCSI device, see
.Xr \&uk 4
. It Ar veriexec
Verified executable fingerprint loader
. It Ar vmegen#
Generic VME access
. It Ar view#
Generic interface to graphic displays (Amiga)
. It Ar wsfont#
Console font control, see
.Xr \&wsfont 4
. It Ar wsmux#
wscons event multiplexor, see
.Xr \&wsmux 4
. El
.El
.Sh FILES
.Bl -tag -width "/dev/MAKEDEV.local" -compact
.It Pa /dev
special device files directory
.It Pa /dev/MAKEDEV
script described in this man page
.It Pa /dev/MAKEDEV.local
script for site specific devices
.El
.Sh DIAGNOSTICS
If the script reports an error that is difficult to understand,
you can get more debugging output by using
.Dl Ic sh Fl x Ar MAKEDEV Ar argument .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
.Sh NOTES
This man page is generated automatically from the same sources
as
.Pa /dev/MAKEDEV ,
in which the device files are not always sorted, which may result
in an unusual (non-alphabetical) order. Not all devices listed
in this manpage are supported on all platforms.
