NetBSD/src/share/man/man8/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/MAKEDEV.tmpl and
.\" *** src/share/man/man8/MAKEDEV.8.template
.\" ***
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\" $NetBSD: MAKEDEV.8,v 1.23.4.2 2008/01/09 01:39:14 matt Exp $
.\"
.\" Copyright (c) 2001, 2003 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 31, 2007
.Dt MAKEDEV 8
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm
.Op Fl fMs
.Op Fl m Ar mknod
.Op Fl p Ar pax
.Bro Ar special | device Brc Op Ar ...
.Sh DESCRIPTION
.Nm
is used to create system and device special files.
As arguments it takes the names of known devices, like
.Ar sd0 ,
or of special targets, like
.Pa all
or
.Pa std ,
which create a collection of device special files,
or
.Pa local ,
which invokes
.Xr MAKEDEV.local 8
with the
.Pa all
argument.
.Pp
The script is in
.Pa /dev/MAKEDEV
and must be called from the
.Pa /dev
directory.
For the creation of the devices,
.Xr mknod 8
is used, which can only be used for creating devices by the
super-user.
The
.Xr mknod 8
used can be overridden by the
.Fl m
flag.
.Pp
Supported options are:
.Bl -tag -width XmXmknodXX
.It Fl f
Force permissions to be updated on existing devices.
This works only if
.Xr mknod 8
is used; it is not compatible with the
.Fl p
or
.Fl s
options.
.It Fl M
Create a memory file system, union mounted over the current directory,
to contain the device special files.
The memory file system is created using either
.Xr mount_tmpfs 8
or
.Xr mount_mfs 8 .
.Pp
If the
.Fl M
flag is specified more than once, then
.Nm
assumes that it is being invoked from
.Xr init 1
to populate a memory file system for
.Pa /dev .
In this case,
.Nm
will also redirect its output to the system console.
.It Fl m Ar mknod
Name of
.Xr mknod 8
program.
[Usually, $TOOL_MKNOD or mknod.]
.It Fl p Ar pax
Name of
.Xr pax 1
program.
[Usually, $TOOL_PAX or mknod.]
If this is specified, then instead of creating device nodes
one by one using
.Xr mknod 8 ,
.Nm
will create device nodes all at once using
.Xr pax 1 .
This is more efficient when many device nodes are involved.
.It Fl s
Generate
.Xr mtree 8
specfile instead of creating devices.
.El
.Pp
The
.Fl m , Fl p ,
and
.Fl s
flags are mutually exclusive.
If none of these flags is specified, then
.Nm
will use the
.Xr pax 1
command if it appears to be usable, falling back to the
.Xr mknod 8
command if necessary.
.Pp
The special targets supported on
.Nx
are:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
Makes all known devices, including local devices. Tries to make the 'standard' number of each type.
.It Ar init
A set of devices that is used for MFS /dev by init. May be equal to ``all''.
.It Ar floppy
Devices to be put on install floppies
.It Ar ramdisk
Devices to be put into INSTALL kernel ramdisks.
.It Ar std
Standard devices
.It Ar local
Configuration specific devices
.It Ar wscons
Make wscons devices
.It Ar usbs
Make USB devices
.It Ar isdns
Make ISDN devices
.El
.Pp
Please note that any hash marks
.Pq Dq #
in the following list of supported device targets must be replaced by
digits when calling
.Nm :
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes :
. Bl -tag -width 0123456789 -compact
. It Ar st#
SCSI tapes, see
.Xr \&st 4
. It Ar wt#
QIC-interfaced (e.g. not SCSI) 3M cartridge tape, see
.Xr \&wt 4
. It Ar ht#
MASSBUS TM03 and TU??, see
.Xr \&vax/ht 4
. It Ar mt#
MSCP tapes (e.g. TU81, TK50), see
.Xr \&vax/mt 4
. It Ar tm#
UNIBUS TM11 and TE10 emulations (e.g. Emulex TC-11), see
.Xr \&vax/tm 4
. It Ar ts#
UNIBUS TS11, see
.Xr \&vax/ts 4
. It Ar ut#
UNIBUS TU45 emulations (e.g. si 9700), see
.Xr \&vax/ut 4
. It Ar uu#
TU58 cassettes on DL11 controller, see
.Xr \&vax/uu 4
. El
.It Disks :
. Bl -tag -width 0123456789 -compact
. It Ar ccd#
Concatenated disk devices, see
.Xr \&ccd 4
. It Ar cd#
SCSI or ATAPI CD-ROM, see
.Xr \&cd 4
. It Ar cgd#
Cryptographic disk devices, see
.Xr \&cgd 4
. It Ar raid#
RAIDframe disk devices, see
.Xr \&raid 4
. It Ar sd#
SCSI disks, see
.Xr \&sd 4
. It Ar wd#
``winchester'' disk drives (ST506,IDE,ESDI,RLL,...), see
.Xr \&wd 4
. It Ar bmd#
Nereid bank memory disks, see
.Xr \&x68k/bmd 4
. It Ar ed#
IBM PS/2 ESDI disk devices, see
.Xr \&edc 4
. It Ar fd#
``floppy'' disk drives (3 1/2", 5 1/4"), see
.Xr \&amiga/fdc 4 ,
.Xr \&i386/fdc 4 ,
.Xr \&sparc64/fdc 4
. It Ar fss#
Files system snapshot devices, see
.Xr \&fss 4
. It Ar gdrom#
Dreamcast ``gigadisc'' CD-ROM drive, see
.Xr \&dreamcast/gdrom 4
. It Ar hk#
UNIBUS RK06 and RK07, see
.Xr \&vax/hk 4
. It Ar hp#
MASSBUS RM??, see
.Xr \&vax/hp 4
. It Ar ld#
Logical disk devices (e.g., hardware RAID), see
.Xr \&ld 4
. It Ar mcd#
Mitsumi CD-ROM, see
.Xr \&mcd 4
. It Ar md#
Memory pseudo-disk devices, see
.Xr \&md 4
. It Ar ofdisk#
OpenFirmware disk devices
. It Ar ra#
MSCP disks (RA??, RD??)
. It Ar rb#
730 IDC w/ RB80 and/or RB02
. It Ar rd#
HDC9224 RD disks on VS2000, see
.Xr \&hp300/rd 4
. It Ar rl#
UNIBUS RL02, see
.Xr \&vax/rl 4
. It Ar rx#
MSCP floppy disk (RX33/50/...)
. It Ar up#
Other UNIBUS devices (e.g. on Emulex SC-21V controller), see
.Xr \&vax/up 4
. It Ar vnd#
``file'' pseudo-disks, see
.Xr \&vnd 4
. It Ar xbd#
Xen virtual disks
. It Ar xd#
Xylogic 753/7053 disks, see
.Xr \&sparc/xd 4
. It Ar xy#
Xylogic 450/451 disks, see
.Xr \&sparc/xy 4
. El
.It Pointing devices :
. Bl -tag -width 0123456789 -compact
. It Ar wsmouse#
wscons mouse events, see
.Xr \&wsmouse 4
. It Ar lms#
Logitech bus mouse, see
.Xr \&i386/lms 4
. It Ar mms#
Microsoft bus mouse, see
.Xr \&dreamcast/mms 4 ,
.Xr \&i386/mms 4
. It Ar qms#
``quadrature mouse'', see
.Xr \&acorn32/qms 4
. It Ar pms#
PS/2 mouse
. It Ar mouse
Mouse (provides events, for X11)
. El
.It Keyboard devices :
. Bl -tag -width 0123456789 -compact
. It Ar wskbd#
wscons keyboard events, see
.Xr \&wskbd 4
. It Ar kbd
Raw keyboard (provides events, for X11), see
.Xr \&sparc/kbd 4 ,
.Xr \&sun2/kbd 4 ,
.Xr \&sun3/kbd 4
. It Ar kbdctl
Keyboard control
. El
.It Terminals/Console ports :
. Bl -tag -width 0123456789 -compact
. It Ar tty[01]#
Standard serial ports, see
.Xr \&tty 4
. It Ar tty0#
SB1250 (``sbscn'') serial ports (sbmips), see
.Xr \&tty 4
. It Ar ttyE#
wscons - Workstation console (``wscons'') glass-tty emulators
. It Ar ttyCZ?
Cyclades-Z multiport serial boards. Each ``unit'' makes 64 ports., see
.Xr \&cz 4
. It Ar ttyCY?
Cyclom-Y multiport serial boards. Each ``unit'' makes 32 ports., see
.Xr \&cy 4
. It Ar ttye#
ITE bitmapped consoles, see
.Xr \&amiga/ite 4 ,
.Xr \&hp300/ite 4
. It Ar ttyv0
pccons
. It Ar ttyC?
NS16550 (``com'') serial ports
. It Ar ttyS#
SA1110 serial port (hpcarm)
. It Ar ttyTX?
TX39 internal serial ports (hpcmips)
. It Ar ttyB?
DEC 3000 ZS8530 (``scc'') serial ports (alpha), see
.Xr \&scc 4
. It Ar ttyA#
Mfc serial ports (amiga)
. It Ar ttyB#
Msc serial ports (amiga)
. It Ar ttyC#
Com style serial ports (DraCo, HyperCom) (amiga) On the DraCo, units 0 and 1 are the built-in ``modem'' and ``mouse'' ports, if configured.
. It Ar ttyA0
8530 Channel A (formerly ser02) (atari)
. It Ar ttyA1
8530 Channel B (formerly mdm02) (atari)
. It Ar ttyB0
UART on first 68901 (formerly mdm01) (atari)
. It Ar ixpcom
IXP12x0 COM ports
. It Ar epcom
EP93xx COM ports
. It Ar ttyM?
HP200/300 4 port serial mux interface (hp300)
. It Ar ttya
``ttya'' system console (luna68k)
. It Ar ttyb
Second system serial port (luna68k)
. It Ar tty#
Onboard serial ports (mvme68k) On the mvme147 these are: ttyZ1, ttyZ2 and ttyZ3. On the mvme167, and '177: ttyC1, ttyC2 and ttyC3. Note that tty[CZ]0 is grabbed by the console device so is not created by default, see
.Xr \&tty 4
. It Ar dc#
PMAX 4 channel serial interface (kbd, mouse, modem, printer)
. It Ar scc#
82530 serial interface (pmax), see
.Xr \&scc 4
. It Ar ttyZ#
Zilog 8530 (``zstty'') serial ports, see
.Xr \&zstty 4
. It Ar tty[abcd]
Built-in serial ports (sparc)
. It Ar tty#
Z88530 serial controllers (sparc64), see
.Xr \&tty 4
. It Ar ttyh#
SAB82532 serial controllers (sparc64), see
.Xr \&sparc64/sab 4
. It Ar tty[a-j]
Built-in serial ports (sun2, sun3)
. It Ar ttyC?
pccons (arc)
. It Ar dz#
UNIBUS DZ11 and DZ32 (vax), see
.Xr \&vax/dz 4
. It Ar dh#
UNIBUS DH11 and emulations (e.g. Able DMAX, Emulex CS-11) (vax), see
.Xr \&vax/dh 4
. It Ar dmf#
UNIBUS DMF32 (vax), see
.Xr \&vax/dmf 4
. It Ar dhu#
UNIBUS DHU11 (vax), see
.Xr \&vax/dhu 4
. It Ar dmz#
UNIBUS DMZ32 (vax), see
.Xr \&vax/dmz 4
. It Ar dl#
UNIBUS DL11 (vax), see
.Xr \&vax/dl 4
. It Ar xencons
Xen virtual console
. El
.It Terminal multiplexors :
. Bl -tag -width 0123456789 -compact
. It Ar dc#
4 channel serial interface (keyboard, mouse, modem, printer)
. It Ar dh#
UNIBUS DH11 and emulations (e.g. Able DMAX, Emulex CS-11), see
.Xr \&vax/dh 4
. It Ar dhu#
UNIBUS DHU11, see
.Xr \&vax/dhu 4
. It Ar dl#
UNIBUS DL11, see
.Xr \&vax/dl 4
. It Ar dmf#
UNIBUS DMF32, see
.Xr \&vax/dmf 4
. It Ar dmz#
UNIBUS DMZ32, see
.Xr \&vax/dmz 4
. It Ar dz#
UNIBUS DZ11 and DZ32, see
.Xr \&vax/dz 4
. It Ar scc#
82530 serial interface, see
.Xr \&scc 4
. El
.It Call units :
. Bl -tag -width 0123456789 -compact
. It Ar dn#
UNIBUS DN11 and emulations (e.g. Able Quadracall), see
.Xr \&vax/dn 4
. El
.It Pseudo terminals :
. Bl -tag -width 0123456789 -compact
. It Ar ptm
Pty multiplexor device., see
.Xr \&ptm 4
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr \&pty 4
. It Ar opty
First 16 ptys, to save inodes on install media
. It Ar ipty
First 2 ptys, for install media use only
. El
.It Printers :
. Bl -tag -width 0123456789 -compact
. It Ar arcpp#
Archimedes parallel port
. It Ar lpt#
Stock lp, see
.Xr \&lpt 4 ,
.Xr \&acorn32/lpt 4 ,
.Xr \&i386/lpt 4 ,
.Xr \&mvme68k/lpt 4 ,
.Xr \&pc532/lpt 4
. It Ar lpa#
Interruptless lp
. It Ar par#
Amiga motherboard parallel port
. El
.It USB devices :
. Bl -tag -width 0123456789 -compact
. It Ar usb#
USB control devices, see
.Xr \&usb 4
. It Ar uhid#
USB generic HID devices, see
.Xr \&uhid 4
. It Ar ulpt#
USB printer devices, see
.Xr \&ulpt 4
. It Ar ugen#
USB generic devices, see
.Xr \&ugen 4
. It Ar urio#
USB Diamond Rio 500 devices, see
.Xr \&urio 4
. It Ar uscanner#
USB scanners, see
.Xr \&uscanner 4
. It Ar ttyU#
USB modems, see
.Xr \&ucom 4
. It Ar ttyY#
USB serial adapters
. El
.It ISDN devices :
. Bl -tag -width 0123456789 -compact
. It Ar isdn
Communication between userland isdnd and kernel, see
.Xr \&isdn 4
. It Ar isdnctl
Control device, see
.Xr \&isdnctl 4
. It Ar isdnbchan#
Raw b-channel access, see
.Xr \&isdnbchan 4
. It Ar isdntel#
Telephony device, see
.Xr \&isdntel 4
. It Ar isdnteld#
Telephony dialout device
. It Ar isdntrc#
Trace device, see
.Xr \&isdntrc 4
. El
.It Video devices :
. Bl -tag -width 0123456789 -compact
. It Ar bwtwo#
Monochromatic frame buffer, see
.Xr \&sparc/bwtwo 4 ,
.Xr \&sun2/bwtwo 4 ,
.Xr \&sun3/bwtwo 4
. It Ar cgtwo#
8-bit color frame buffer, see
.Xr \&sparc/cgtwo 4 ,
.Xr \&sun3/cgtwo 4
. It Ar cgthree#
8-bit color frame buffer, see
.Xr \&sparc/cgthree 4
. It Ar cgfour#
8-bit color frame buffer, see
.Xr \&sparc/cgfour 4 ,
.Xr \&sun3/cgfour 4
. It Ar cgsix#
Accelerated 8-bit color frame buffer, see
.Xr \&sparc/cgsix 4
. It Ar cgeight#
24-bit color frame buffer, see
.Xr \&sparc/cgeight 4
. It Ar etvme
Tseng et-compatible cards on VME (atari)
. It Ar ik#
UNIBUS interface to Ikonas frame buffer, see
.Xr \&vax/ik 4
. It Ar leo
Circad Leonardo VME-bus true color (atari)
. It Ar ps#
UNIBUS interface to Picture System 2, see
.Xr \&vax/ps 4
. It Ar qv#
QVSS (MicroVAX) display
. It Ar tcx#
Accelerated 8/24-bit color frame buffer, see
.Xr \&sparc/tcx 4
. El
.It Maple bus devices :
. Bl -tag -width 0123456789 -compact
. It Ar maple
Maple bus control devices, see
.Xr \&dreamcast/maple 4
. It Ar mlcd#
Maple bus LCD devices, see
.Xr \&dreamcast/mlcd 4
. It Ar mmem#
Maple bus storage devices, see
.Xr \&dreamcast/mmem 4
. El
.It IEEE1394 bus devices :
. Bl -tag -width 0123456789 -compact
. It Ar fw#
IEEE1394 bus generic node access devices
. It Ar fwmem#
IEEE1394 bus physical memory of the remote node access devices
. El
.It Special purpose devices :
. Bl -tag -width 0123456789 -compact
. It Ar ad#
UNIBUS interface to Data Translation A/D converter, see
.Xr \&vax/ad 4
. It Ar agp#
AGP GART devices, see
.Xr \&agp 4
. It Ar altq
ALTQ control interface
. It Ar amr#
AMI MegaRaid control device, see
.Xr \&amr 4
. It Ar apm
Power management device, see
.Xr \&i386/apm 4
. It Ar audio#
Audio devices, see
.Xr \&audio 4
. It Ar bell#
OPM bell device (x68k)
. It Ar bktr
Brooktree 848/849/878/879 based TV cards, see
.Xr \&bktr 4
. It Ar bpf
Packet filter, see
.Xr \&bpf 4
. It Ar bthub
Bluetooth Device Hub control interface, see
.Xr \&bthub 4
. It Ar cfs#
Coda file system device
. It Ar ch#
SCSI media changer, see
.Xr \&ch 4
. It Ar cir#
Consumer IR, see
.Xr \&cir 4
. It Ar clockctl
Clock control for non root users, see
.Xr \&clockctl 4
. It Ar cpuctl
CPU control
. It Ar crypto
Hardware crypto access driver, see
.Xr \&crypto 4
. It Ar dmoverio
Hardware-assisted data movers, see
.Xr \&dmoverio 4
. It Ar dpt#
DPT/Adaptec EATA RAID management interface, see
.Xr \&dpt 4
. It Ar dpti#
DPT/Adaptec I2O RAID management interface, see
.Xr \&dpti 4
. It Ar fb#
PMAX generic framebuffer pseudo-device
. It Ar fd
File descriptors
. It Ar grf#
Graphics frame buffer device, see
.Xr \&amiga/grf 4 ,
.Xr \&hp300/grf 4
. It Ar hil
HP300 HIL input devices, see
.Xr \&hp300/hil 4
. It Ar icp
ICP-Vortex/Intel RAID control interface, see
.Xr \&icp 4
. It Ar iic#
IIC bus device
. It Ar io
X86 IOPL access for COMPAT_10, COMPAT_FREEBSD, see
.Xr \&hp700/io 4 ,
.Xr \&i386/io 4
. It Ar iop#
I2O IOP control interface, see
.Xr \&iop 4
. It Ar ipl
IP Filter
. It Ar irframe#
IrDA physical frame, see
.Xr \&irframe 4
. It Ar ite#
Terminal emulator interface to HP300 graphics devices, see
.Xr \&amiga/ite 4 ,
.Xr \&hp300/ite 4
. It Ar joy#
Joystick device, see
.Xr \&joy 4
. It Ar kttcp
Kernel ttcp helper device, see
.Xr \&kttcp 4
. It Ar lkm
Loadable kernel modules interface, see
.Xr \&lkm 4
. It Ar lockstat
Kernel locking statistics
. It Ar magma#
Magma multiport serial/parallel cards, see
.Xr \&sparc/magma 4
. It Ar midi#
MIDI, see
.Xr \&midi 4
. It Ar mlx#
Mylex DAC960 control interface, see
.Xr \&mlx 4
. It Ar mly#
Mylex AcceleRAID/eXtremeRAID control interface, see
.Xr \&mly 4
. It Ar np#
UNIBUS Ethernet co-processor interface, for downloading., see
.Xr \&vax/np 4
. It Ar nsmb#
SMB requester, see
.Xr \&nsmb 4
. It Ar openfirm
OpenFirmware accessor
. It Ar pad#
Pseudo-audio device driver, see
.Xr \&pad 4
. It Ar pci#
PCI bus access devices, see
.Xr \&pci 4
. It Ar pf
PF packet filter
. It Ar pow#
Power management device (x68k), see
.Xr \&x68k/pow 4
. It Ar putter
Pass-to-Userspace Transporter
. It Ar px#
PixelStamp Xserver access, see
.Xr \&px 4
. It Ar radio#
Radio devices, see
.Xr \&radio 4
. It Ar random
Random number generator, see
.Xr \&rnd 4
. It Ar rtc#
RealTimeClock, see
.Xr \&atari/rtc 4 ,
.Xr \&evbppc/rtc 4 ,
.Xr \&hp300/rtc 4
. It Ar satlink#
PlanetConnect satellite receiver driver
. It Ar scsibus#
SCSI busses, see
.Xr \&scsi 4
. It Ar se#
SCSI Ethernet, see
.Xr \&se 4
. It Ar ses#
SES/SAF-TE SCSI Devices, see
.Xr \&ses 4
. It Ar speaker
PC speaker, see
.Xr \&speaker 4
. It Ar sram
Battery backuped memory (x68k)
. It Ar ss#
SCSI scanner, see
.Xr \&ss 4
. It Ar stic#
PixelStamp interface chip
. It Ar sysmon
System Monitoring hardware, see
.Xr \&envsys 4
. It Ar tap#
Virtual Ethernet device, see
.Xr \&tap 4
. It Ar tun#
Network tunnel driver, see
.Xr \&tun 4
. It Ar twa
3ware Apache control interface, see
.Xr \&twa 4
. It Ar twe
3ware Escalade control interface, see
.Xr \&twe 4
. It Ar uk#
Unknown SCSI device, see
.Xr \&uk 4
. It Ar veriexec
Verified executable fingerprint loader, see
.Xr \&veriexec 4
. It Ar vmegen#
Generic VME access
. It Ar view#
Generic interface to graphic displays (Amiga)
. It Ar wsfont#
Console font control, see
.Xr \&wsfont 4
. It Ar wsmux#
wscons event multiplexor, see
.Xr \&wsmux 4
. It Ar xenevt
Xen event interface
. El
.El
.Sh ENVIRONMENT
The following environment variables affect the execution of
.Nm :
.Pp
.Bl -tag -width indent
.It Ev MAKEDEV_AS_LIBRARY
If this is set, then
.Nm
will define several shell functions and then return,
ignoring all its command line options and arguments.
This is used to enable
.Xr MAKEDEV.local 8
to use the shell functions defined in
.Nm .
.El
.Sh FILES
.Bl -tag -width "/dev/MAKEDEV.local" -compact
.It Pa /dev
special device files directory
.It Pa /dev/MAKEDEV
script described in this man page
.It Pa /dev/MAKEDEV.local
script for site-specific devices
.El
.Sh DIAGNOSTICS
If the script reports an error that is difficult to understand,
you can get more debugging output by using
.Dl Ic sh Fl x Ar MAKEDEV Ar argument .
.Sh SEE ALSO
.Xr config 1 ,
.Xr init 1 ,
.Xr pax 1 ,
.Xr intro 4 ,
.Xr MAKEDEV.local 8 ,
.Xr diskless 8 ,
.Xr mknod 8 ,
.Xr mount_mfs 8 ,
.Xr mount_tmpfs 8 ,
.Xr mtree 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
The ability to be used as a function library was added in
.Nx 5.0 .
.Sh NOTES
Not all devices listed in this manpage are supported on all platforms.
.Pp
This man page is generated automatically from the same sources
as
.Pa /dev/MAKEDEV ,
in which the device files are not always sorted, which may result
in an unusual (non-alphabetical) order.
.Pp
In order to allow a diskless
.Nx
client to obtain its
.Pa /dev
directory from a file server running a foreign operating system,
one of the following techniques may be useful to populate
a directory of device nodes on the foreign server:
.Bl -bullet
.It
If the foreign server is sufficiently similar to
.Nx ,
run
.Nm
in an appropriate directory of the foreign server,
using the
.Fl m
flag to refer to a script that converts from command line
arguments that would be usable with the
.Nx
.Xr mknod 8
command to the equivalent commands for the foreign server.
.It
Run
.Nm
with the
.Fl s
flag to generate an
.Xr mtree 8
specification file; this can be done on any host with a
POSIX-compliant shell and a few widely-available utilities.
Use the
.Xr pax 1
command with the
.Fl w Fl M
flags to convert the
.Xr mtree 8
specification file into an archive
in a format that supports device nodes
(such as
.Ar ustar
format);
this can be done on a
.Nx
host, or can be done in a cross-build environment using
.Sy TOOLDIR Ns Pa /bin/nbpax .
Finally, use apropriate tools on the foreign server
to unpack the archive and create the device nodes.
.El
