NetBSD/src/share/man/man8/MAKEDEV.local.8
.\" $NetBSD: MAKEDEV.local.8,v 1.1 2007/02/26 22:35:04 apb Exp $
.\"
.\" Copyright (c) 2007 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 26, 2007
.Dt MAKEDEV.local 8
.Os
.Sh NAME
.Nm MAKEDEV.local
.Nd create site-specific device special files
.Sh SYNOPSIS
.Nm
.Op Fl fs
.Op Fl m Ar mknod
.Bro Pa all | site-specific-argument Brc Op Ar ...
.Sh DESCRIPTION
.Nm
is used to create site-specific device special files.
Each argument may be the word
.Pa all
or a site-specific argument.
By default, there are no valid site-specific arguments,
and the
.Pa all
argument has no effect;
This may be changed by editing the script.
.Pp
The script is in
.Pa /dev/MAKEDEV.local
and must be called from the
.Pa /dev
directory.
.Pp
If
.Xr MAKEDEV 8
is invoked with the
.Pa all
or
.Pa local
argument, then it will invoke
.Nm
with the
.Pa all
argument.
.Pp
Supported options for
.Nm
are the same as for
.Xr MAKEDEV 8 ,
as follows:
.Bl -tag -width XmXmknodXX
.It Fl f
Force permissions to be updated on existing devices.
.It Fl m Ar mknod
Name of
.Xr mknod 8
program.
[Usually, $TOOL_MKNOD or mknod.]
.It Fl s
Generate
.Xr mtree 8
specfile instead of creating devices.
.El
.Pp
.Sh FILES
.Bl -tag -width "/dev/MAKEDEV.local" -compact
.It Pa /dev
special device files directory
.It Pa /dev/MAKEDEV
script that invokes
.Nm
with the
.Pa all
argument.
.It Pa /dev/MAKEDEV.local
script described in this man page
.El
.Sh SEE ALSO
.Xr config 1 ,
.Xr intro 4 ,
.Xr MAKEDEV 8 ,
.Xr mknod 8
.Sh HISTORY
The
.Nm
command appeared in
