NetBSD/src/share/man/man8/postinstall.8
.\"	$NetBSD: postinstall.8,v 1.1 2005/03/28 15:42:27 wiz Exp $
.\"
.\" Copyright (c) 2005 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 28, 2005
.Dt POSTINSTALL 8
.Os
.Sh NAME
.Nm postinstall
.Nd check and fix installation after system upgrades
.Sh SYNOPSIS
.Nm /etc/postinstall
.Fl a Ar arch
.Fl d Ar destdir
.Fl m Ar machine
.Fl s Ar srcdir
.Ar operation
.Op Ar item Op ...
.Sh DESCRIPTION
The
.Nm
utility performs post-installation checks and/or fixes on a system's
configuration files.
It is especially useful after system upgrades, e.g. after updating
from
.Nx 1.6.2
to
.Nx 2.0 .
If no
.Ar items
are provided, all checks or fixes are applied.
.Pp
Supported options:
.Bl -tag -width XsXsrcdirXXX -offset indent
.It Fl a Ar arch
MACHINE_ARCH.
Defaults to machine of the host operating system.
.It Fl d Ar destdir
Destination directory to check.
Defaults to
.Pa / .
.It Fl m Ar machine
MACHINE.
Defaults to machine of the host operating system.
.It Fl s Ar srcdir
Source directory to compare from.
This may be
.Pa src/etc ,
an extracted copy of
.Dq Pa etc.tgz ,
or the file
.Pa etc.tgz .
In the latter case,
.Pa etc.tgz
is extracted into a temporary directory to be used
as the source directory.
Defaults to
.Pa /usr/src .
.El
.Pp
The
.Ar operation
argument may be one of:
.Bl -tag -width usageXX -offset indent
.It Cm check
Perform post-installation checks on items.
.It Cm diff Op Xr diff 1 options
Similar to
.Cm check ,
but also show the differences between the files.
.It Cm fix
Apply fixes that
.Cm check
determines need to be applied.
.It Cm help
Display a short help.
.It Cm list
List available
.Ar items .
.It Cm usage
Same as
.Cm help .
.El
.Sh EXIT STATUS
The
.Nm
utility exits 0 on success, and \*[Gt]0 if an error occurs
or a problem was found.
