NetBSD/src/share/man/man8/sysinst.8
.\"	$NetBSD: sysinst.8,v 1.3 2011/09/08 19:55:52 wiz Exp $
.\"
.\" Copyright (c) 2007 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 8, 2011
.Dt SYSINST 8
.Os
.Sh NAME
.Nm sysinst
.Nd install or upgrade a NetBSD system
.Sh SYNOPSIS
.Nm
.Op Fl D
.Op Fl f Ar deffile
.Op Fl r Ar releasename
.Sh DESCRIPTION
.Nm
is a menu-based program that may be used to install or upgrade a
.Nx
system.
It
is usually invoked automatically when the system is booted
from appropriate installation media.
.Pp
.Nm
is usually not present on a
.Nx
system that has been fully installed.
.Sh OPTIONS
.Bl -tag
.It Fl D
Switch on debugging.
.It Fl f Ar deffile
Set a file for definitions other than the defaults.
See
.Sx DEFINITION FILE
for its format.
.It Fl r Ar releasename
Set the releasename if it is different to the one compiled.
Currently unused.
.El
.Sh DEFINITION FILE
The definition file is used to set several other names and directories to search
for.
You can specify any of the options in the file.
They are stored as
.Dl option = value
pairs.
In this description, REL and MACH are the release and architecture
respectively, determined by the image sysinst is used on.
.Bl -column -offset indent ".Sy option name" ".Sy default value" ".Sy description"
.It Sy "option name" Ta Sy "default value" Ta Sy "description"
.It release Ta REL Ta Release name (also set by Fl r Ar releasename ) .
.It machine Ta MACH Ta Machine architecture
.It xfer dir Ta /usr/INSTALL Ta Transfer dir
.It ext dir Ta "" Ta Extract dir (will usually be set later on)
.It ftp host Ta "ftp.NetBSD.org" Ta ftp host for fetching files
.It ftp dir Ta "pub/NetBSD/NetBSD-REL" Ta ftp directory for fetching files
.It ftp prefix Ta "/MACH/binary/sets" Ta directory to look for sets.
Not that
this is used for all kinds of fetching (CDs, local FS, ...), not only ftp.
.It ftp user Ta "ftp" Ta ftp user for connecting
.It ftp pass Ta "" Ta ftp password
.It ftp proxy Ta "" Ta ftp proxy
.It nfs host Ta "" Ta nfs host for fetching via nfs
.It nfs dir Ta "/bsd/release" Ta nfs directory for fetching files
.It cd dev Ta "cd0a" Ta name of the CD device for fetching files
.It fd dev Ta "/dev/fd0a" Ta name of floppy for fetching files
.It local dev Ta "" Ta Other device to be mounted for fetching files
.It local fs Ta "ffs" Ta FS-type for local dev
.It local dir Ta "release" Ta Directory to look for in the mounted local fs
.It targetroot mount Ta "/targetroot" Ta Directory to mount target root dir to
.It dist postfix Ta ".tgz" Ta Suffix of set files to be extracted
.It diskname Ta "mydisk" Ta Xr disktab 5 diskname to use for target disk
.El
.Sh SEE ALSO
.Xr release 7 ,
.Xr afterboot 8 ,
.Xr boot 8 ,
.Xr diskless 8 ,
.Em \*[Lt]machine\*[Gt] Ns Pa /INSTALL.*
files on CD-ROM installation media,
.Pa .../NetBSD- Ns Em \*[Lt]rel\*[Gt] Ns Pa / Ns Em \*[Lt]machine\*[Gt] Ns Pa /INSTALL.*
files in
.Nx
releases or snapshots.
.Sh HISTORY
A
.Nm
command appeared in
.Nx 1.3 .
