NetBSD/src/share/man/man8/wizd.8
.\"	$NetBSD: wizd.8,v 1.10 2015/04/17 11:27:37 wiz Exp $
.\"
.\" Copyright (c) 2003, 2014 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 30, 2015
.Dt WIZD 8
.Os
.Sh NAME
.Nm wizd
.Nd automatically correct typographical errors in man pages
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
automatically checks and corrects spelling errors, usage problems
with
.Xr mdoc 7
macros, and other typographical errors in man pages.
.Pp
.Nm
is invoked by any
.Xr cvs 1
commit to a man page.
.Pp
.Nm
also performs periodic sanity checks on the distribution set lists.
E-mail alerts will be triggered if the build installs files that are marked
as obsolete and therefore get automatically removed.
.Sh SIGNALS
.Nm
responds to the following signals:
.Bl -tag -width SIGWIZD
.It Aq Mt wiz@NetBSD.org
Examine a man page for errors.
The man page and particular errors in question may be specified in
standard internet mail format.
.El
.Pp
.Nm
additionally sometimes delivers the following signals to other
committer processes:
.Bl -tag -width SIGWIZD
.It Dv SIGWIZD
An error was detected in a man page.
.El
.Sh SEE ALSO
.Xr cvs 1 ,
.Xr intro 1 ,
.Xr man 1 ,
.Xr mdoc 7
.Sh HISTORY
.Nm
appeared in
.Nx 1.5 .
.Sh CAVEATS
.Nm
is not only copyrighted, but also registered.
.Sh BUGS
Sleeps sometimes.
