NetBSD/src/share/man/man4/man4.acorn32/opms.4
.\" $NetBSD: opms.4,v 1.3 2003/05/01 08:42:07 uebayasi Exp $
.\"
.\" Copyright (c) 1993 Christopher G. Demetriou
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"          This product includes software developed for the
.\"          NetBSD Project.  See http://www.netbsd.org/ for
.\"          information about NetBSD.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" <<Id: LICENSE,v 1.2 2000/06/14 15:57:33 cgd Exp>>
.\"
.Dd April 17, 2003
.Dt OPMS 4 acorn32
.Os
.Sh NAME
.Nm opms
.Nd PS/2 auxiliary port mouse driver
.Sh SYNOPSIS
.Cd opms* at iomd?
.Sh DESCRIPTION
This driver provides an interface to a PS/2 mouse port on ARM7500-
and ARM7500FE-based machines which is backwards-compatible to previous
.Nx Ns /acorn32
versions without
.Xr wscons 4
support.
The
.Nm
driver internally converts the PS/2 mouse output into
.Xr busmouse 4
protocol.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/pms0
first PS/2 mouse device.
.El
.Sh SEE ALSO
.Xr busmouse 4 ,
.Xr pms 4 ,
.Xr qms 4 ,
.Xr wsmouse 4
.Sh BUGS
This driver should be replaced be a
.Xr wsmouse 4 Ns -compatible
one, or even an instance of the machine-independent
.Xr pms 4
driver.
