NetBSD/src/share/man/man4/man4.acorn32/qms.4
.\"	$NetBSD: qms.4,v 1.1 2003/04/17 11:46:10 bjh21 Exp $
.\"
.\" written by Ben Harris, 2003
.\" This file is in the Public Domain
.\"
.Dd April 17, 2003
.Dt QMS 4 acorn32
.Os
.Sh NAME
.Nm qms ,
.Nm wsqms
.Nd Quadrature mouse drivers
.Sh SYNOPSIS
.Cd qms* at iomd?
.Cd wsqms* at iomd?
.Cd wsmouse* at wsqms?
.Sh DESCRIPTION
These drivers provide interfaces to an IOMD quadrature mouse, found on
IOMD20-based systems such as the Acorn Risc PC.
The
.Nm qms
driver provides an interface compatible with the
.Xr busmouse 4
protocol, while the
.Nm wsqms
driver interfaces to the
.Xr wsmouse 4
driver to provide a generic, machine-independent mouse interface.
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/qms0
.Xr busmouse 4 Ns -compatible
interface to
.Nm qms
.El
.Sh SEE ALSO
.Xr busmouse 4 ,
.Xr opms 4 ,
.Xr wsmouse 4
.Sh BUGS
These two drivers should be merged, or the old interface removed entirely.
