NetBSD/src/share/man/man4/man4.acorn32/rpckbd.4
.\" $NetBSD: rpckbd.4,v 1.1 2004/03/20 17:02:34 bjh21 Exp $
.\"
.\" Copyright (c) 2004 Ben Harris
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 20, 2004
.Os
.Dt IOMDKBC 4 acorn32
.Sh NAME
.Nm rpckbd
.Nd ARM IOMD keyboard driver
.Sh SYNOPSIS
.Cd rpckbd* at iomd?
.Cd wskbd* at rpckbd?
.Sh DESCRIPTION
The
.Nm
driver interfaces a PS/2 keyboard attached to a
.Nx Ns /acorn32
system to the machine-independent
.Xr wscons 4
system.  It is deprecated in favor of the
.Xr iomdkbc 4
and
.Xr pckbd 4
drivers, but may still be useful in connection with applications that
don't support the keycodes produced by
.Xr pckbd 4 .
.Sh SEE ALSO
.Xr iomdkbc 4 ,
.Xr pckbd 4
.Sh HISTORY
The
.Nm
driver was introduced in
.Nx 1.6
and deprecated in
.Nx 2.0 .