NetBSD/src/share/man/man4/man4.acorn32/vidcaudio.4
.\" $NetBSD: vidcaudio.4,v 1.5 2009/03/09 17:59:35 joerg Exp $
.\"
.\" Copyright (c) 2003, 2004 Ben Harris
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 18, 2004
.Dt VIDCAUDIO 4 acorn32
.Os
.Sh NAME
.Nm vidcaudio
.Nd VIDC audio device driver
.Sh SYNOPSIS
.Cd "vidcaudio0 at vidc0"
.Cd "audio*     at vidcaudio0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the audio system of the
.Tn ARM VIDC20
and of the video and sound macrocell of the
.Tn ARM7500
and
.Tn ARM7500FE .
.Pp
The driver can work in two modes, either using the internal 8-bit
DACs of the
.Tn VIDC20
and its internal reference clock,
or using the serial sound output of any supported chip
feeding external 16-bit DACs and an external sound clock.
On systems with a
.Tn VIDC20 ,
the choice of mode is based on the
.Ql *Configure SoundSystem
setting under
.Tn RISC \&OS .
.Sh SEE ALSO
.Xr audio 4
.Sh HISTORY
The
.Nm
driver was introduced in
.Nx 1.2 .
The driver was largely rewritten for
.Nx 2.0
because it had bit-rotted so far as to be useless.
.Sh AUTHORS
The first version was written by Melvin Tang-Richardson.
The rewrite was by Ben Harris.
