NetBSD/src/share/man/man9/acct_process.9
.\"	$NetBSD: acct_process.9,v 1.1 2024/08/05 13:02:46 christos Exp $
.\"
.\" Copyright (c) 2024 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Christos Zoulas
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 5, 2024
.Dt ACCT_PROCESS 9
.Os
.Sh NAME
.Nm acct_process 
.Nd populate and write the process accounting record
.Sh SYNOPSIS
.In sys/acct.h
.Ft int
.Fn acct_process "struct lwp *l"
.Sh DESCRIPTION
The
.Nm
function is called when the process exits.
If accounting is turned off, it returns immediately.
If accounting is turned on via
.Xr acct 2 ,
then the 
.Nm
populates the accounting structure described in
.Xr acct 5 ,
then writes the accounting record to the file specified by
.Xr acct 2 .
.Sh RETURN VALUES
.Nm
returns
.Dv 0
on success and the same error codes as
.Xr vn_rdwr 9
on failure.
All three functions return the computed checksum value.
.Sh SEE ALSO
.Xr acct 2 ,
.Xr acct 5 ,
.Xr vn_rdwr 9.
