NetBSD/src/share/man/man9/arp.9
.\"	$NetBSD: arp.9,v 1.2 1997/03/16 19:26:53 is Exp $
.\"
.\" Copyright (c) 1997 Ignatios Souvatzis.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Ignatios Souvatzis
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"

.Dd Mar 3, 1997
.Dt ARP 9
.Os NetBSD
.Sh NAME
.Nm ARP
.Nd externally visible ARP functions
.Sh SYNOPSIS
.Fd #include <netinet/ether.h>
.Ft void
.Fn arp_ifinit "struct ifnet *ifp" "struct ifaddr *ifa"
.Sh DESCRIPTION
The
.Nm 
functions provide the interface between the
.Nm 
module and the network drivers which need
.Nm 
functionality.

.Bl -tag -width "arp_ifinit()"
.It Fn arp_ifinit
Sets up the 
.Nm
specific fields in 
.Fa ifa .
Additionally, it sends out an gratitious ARP request on 
.Fa ifp ,
so that other machines are warned that we have a new address and
duplicate addresses can be detected.
.El

.Sh RETURN VALUES
None.

.\" .Sh ERRORS

.Sh SEE ALSO
.Xr ifattach 9 ,
.Xr ether_ifattach 9 ,
.Xr fddi_ifattach 9 ,
.Xr arc_ifattach 9 .

.br
Plummer, D., "RFC826", An Ethernet Address Resolution Protocol.

.Sh AUTHORS
UB CSRG (original implementation)
.br
Ignatios Souvatzis (support for non-Ethernet)

.\" .Sh BUGS

.Sh STANDARDS

RFC 826

.Sh HISTORY
Rewritten to support other than Ethernet link level addresses in 
.Nx 1.2D .
