NetBSD/src/share/man/man9/bcdtobin.9
.\"     $NetBSD: bcdtobin.9,v 1.1.20.1 2008/06/02 13:21:41 mjf Exp $
.\"
.\" Copyright (c) 2006 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Klaus Klein.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 11, 2006
.Dt BCDTOBIN 9
.Os
.Sh NAME
.Nm bcdtobin ,
.Nm bintobcd
.Nd convert a single byte between (unsigned) packed bcd and binary
.Sh SYNOPSIS
.In sys/systm.h
.Ft unsigned int
.Fn bcdtobin "unsigned int bcd"
.Ft unsigned int
.Fn bintobcd "unsigned int bin"
.Sh DESCRIPTION
The
.Fn bcdtobin
and
.Fn bintobcd
functions
convert a single byte between (unsigned) packed bcd and binary
encodings.
.Sh RETURN VALUES
The
.Fn bcdtobin
function
returns the binary value of its BCD-encoded argument,
.Fa bcd .
The
.Fn bintobcd
function returns the BCD encoding of its binary argument,
.Fa bin .
.\" .Sh SEE ALSO
.\" .Sh STANDARDS
