NetBSD/src/share/man/man9/bcmp.9
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Chris Torek.
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)bcmp.3	8.1 (Berkeley) 6/4/93
.\"	$NetBSD: bcmp.9,v 1.4 2002/02/13 08:18:36 ross Exp $
.\"
.Dd July 7, 2001
.Dt BCMP 9
.Os
.Sh NAME
.Nm bcmp
.Nd compare byte string
.Sh SYNOPSIS
.Fd #include \*[Lt]sys/systm.h\*[Gt]
.Ft int
.Fn bcmp "const void *b1" "const void *b2" "size_t len"
.Sh DESCRIPTION
.Bf -symbolic
The
.Fn bcmp
interface is obsolete.
Do not add new code using it.
It will soon be purged.
Use
.Xr memcmp 9
instead.
(The
.Fn bcmp
function is now a macro for
.Xr memcmp 9 . )
.Ef
.Pp
The
.Fn bcmp
function
compares byte string
.Fa b1
against byte string
.Fa b2 ,
returning zero if they are identical, non-zero otherwise.
Both strings are assumed to be
.Fa len
bytes long.
Zero-length strings are always identical.
.Pp
The strings may overlap.
.Sh SEE ALSO
.Xr memcmp 9
