NetBSD/src/share/man/man9/bpf.9
.\"     $NetBSD: bpf.9,v 1.2 2010/06/08 04:08:37 jruoho Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 8, 2010
.Dt BPF 9
.Os
.Sh NAME
.Nm bpf
.Nd Berkeley Packet Filter kernel interface
.Sh SYNOPSIS
.In sys/mbuf.h
.In net/bpf.h
.Sh DESCRIPTION
.Nm
is called via an operations vector described by the following struct:
.Pp
.Bd -literal
struct bpf_ops {
        void (*bpf_attach)(struct ifnet *, u_int, u_int, struct bpf_if **);
        void (*bpf_detach)(struct ifnet *);
        void (*bpf_change_type)(struct ifnet *, u_int, u_int);

        void (*bpf_tap)(struct bpf_if *, u_char *, u_int);
        void (*bpf_mtap)(struct bpf_if *, struct mbuf *);
        void (*bpf_mtap2)(struct bpf_if *, void *, u_int, struct mbuf *);
        void (*bpf_mtap_af)(struct bpf_if *, uint32_t, struct mbuf *);
        void (*bpf_mtap_et)(struct bpf_if *, uint16_t, struct mbuf *);
        void (*bpf_mtap_sl_in)(struct bpf_if *, u_char *, struct mbuf **);
        void (*bpf_mtap_sl_out)(struct bpf_if *, u_char *, struct mbuf *);
};
.Ed
.Pp
This vector is found from
.Vt struct bpf_ops *
.Va bpf_ops .
It is either a
.Dq stub
implementation or a real implementation, depending on whether
.Nm
is absent or present in the kernel, respectively.
.Sh CODE REFERENCES
This section describes places within the
.Nx
source tree where the implementation can be found.
All pathnames are relative to
.Pa /usr/src .
.Pp
The
.Nm
implementation is located in
.Pa sys/net/bpf.c ,
the stub implementation is in
.Pa sys/net/bpf_stub.c ,
and
.Pa sys/net/bpf.h
describes the interface.
