NetBSD/src/share/man/man9/callout.9
.\"	$NetBSD: callout.9,v 1.35 2026/05/23 22:59:15 riastradh Exp $
.\"
.\" Copyright (c) 2000, 2003, 2009 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jason R. Thorpe.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 12, 2020
.Dt CALLOUT 9
.Os
.Sh NAME
.Nm callout_init ,
.Nm callout_destroy ,
.Nm callout_halt ,
.Nm callout_setfunc ,
.Nm callout_schedule ,
.Nm callout_reset ,
.Nm callout_stop ,
.Nm callout_pending ,
.Nm callout_expired ,
.Nm callout_invoking ,
.Nm callout_ack
.Nd execute a function after a specified length of time
.Sh SYNOPSIS
.In sys/callout.h
.Ft void
.Fn "callout_init" "callout_t *c" "u_int flags"
.Ft void
.Fn "callout_destroy" "callout_t *c"
.Ft void
.Fn "callout_setfunc" "callout_t *c" "void (*func)(void *)" "void *arg"
.Ft void
.Fn "callout_schedule" "callout_t *c" "int ticks"
.Ft void
.Fn "callout_reset" "callout_t *c" "int ticks" \
    "void (*func)(void *)" "void *arg"
.Ft bool
.Fn "callout_stop" "callout_t *c"
.Ft bool
.Fn "callout_halt" "callout_t *c" "void *interlock"
.Ft bool
.Fn "callout_pending" "callout_t *c"
.Ft bool
.Fn "callout_expired" "callout_t *c"
.Ft bool
.Fn "callout_active" "callout_t *c"
.Ft bool
.Fn "callout_invoking" "callout_t *c"
.Ft void
.Fn "callout_ack" "callout_t *c"
.Sh DESCRIPTION
The
.Nm callout
facility provides a mechanism to execute a function at a given time.
The timer is based on the hardclock timer which ticks
.Dv hz
times per second.
The function is called at softclock interrupt level.
.Pp
Clients of the
.Nm callout
facility are responsible for providing pre-allocated
callout structures, or
.Dq handles .
The
.Nm callout
facility replaces the historic
.Ux
functions
.Fn timeout
and
.Fn untimeout .
.Sh FUNCTIONS
.Bl -tag -width Fn
.It Fn callout_init c flags
Initializes the callout handle
.Fa c
for use.
No operations can be performed on the callout before it is initialized.
If the
.Fa flags
argument is
.Dv CALLOUT_MPSAFE ,
the handler will be called without getting the global kernel lock.
In this case it should only use functions that are multiprocessor
safe.
.It Fn callout_destroy c
Destroys the callout, preventing further use.
It is provided as a diagnostic facility intended to catch bugs.
To ensure future compatibility,
.Fn callout_destroy
should always be called when the callout is no longer required (for instance,
when a device is being detached).
The callout should be stopped before
.Fn callout_destroy
is called by calling
.Fn callout_halt .
Note that
.Fn callout_stop
shouldn't be used for this purpose.
.It Fn callout_setfunc c func arg
Sets the function and argument of the callout handle
.Fa c
to
.Fa func
and
.Fa arg
respectively, so that when the timer expires, it will call
.Fo func
.Fa arg
.Fc .
The callout handle must already be initialized.
.It Fn callout_schedule c ticks
Starts the timer associated with the callout handle
.Fa c .
When the timer expires after
.Fa ticks Ns No /hz
seconds, the function previously specified by
.Fn callout_setfunc
will be called.
If the timer associated with the callout handle is already running,
the callout will simply be rescheduled to execute at the newly specified
time.
Once the timer is started, the callout handle is marked as
.Em PENDING .
Once the timer expires,
the handle is marked as
.Em EXPIRED
and
.Em INVOKING ,
and the
.Em PENDING
status is cleared.
.It Fn callout_reset ch ticks func arg
Atomically does
.Fn callout_setfunc ch func arg
and
.Fn callout_schedule ch ticks
together.
The callout handle must already be initialized.
.Pp
If a callout will always be used with the same function and argument,
you should use
.Fn callout_setfunc
in conjunction with
.Fn callout_schedule ;
it is clearer, and slightly more efficient, than using
.Fn callout_reset .
.It Fn callout_stop c
Requests that the timer associated with the callout handle
.Fa c
be stopped.
The
.Em PENDING
and
.Em EXPIRED
status for the callout handle is cleared.
It is safe to call
.Fn callout_stop
on a callout handle that is not pending, so long as it is initialized.
.Fn callout_stop
will return a non-zero value if the callout was
.Em EXPIRED .
.Pp
.Sy WARNING :
.Fn callout_stop
can return while the callout is running on a different CPU or at a
different interrupt priority level on the current CPU.
It can only be said to prevent the callout from firing in the future,
unless explicitly re-scheduled.
To stop a callout and wait for completion, use
.Fn callout_halt .
.It Fn callout_halt c interlock
Acts much like
.Fn callout_stop ,
but waits for the callout to complete if it is currently in-flight.
.Fn callout_halt
may not be called from a hard interrupt handler as it will sleep if the
callout is currently executing.
.Pp
If the callout can take locks (such as
.Xr mutex 9
or
.Xr rwlock 9 ) ,
the caller of
.Fn callout_halt
.Em must not
hold any of those locks; otherwise, the two could deadlock.
To facilitate this,
.Fn callout_halt
can optionally release a single
.Xr mutex 9
specified by the
.Fa interlock
parameter.
If
.Fa interlock
is not
.Dv NULL
and the calling thread must wait for the callout to complete,
.Fa interlock
will be released before waiting and re-acquired before returning.
If no wait is required,
.Fa interlock
will not be released.
However, to avoid race conditions the caller should always assume that
.Fa interlock
has been released and reacquired, and act accordingly.
.It Fn callout_pending c
Tests the
.Em PENDING
status of the callout handle
.Fa c .
A
.Em PENDING
callout is one that has been started and whose function has not yet
been called.
Note that it is possible for a callout's timer to have expired without
its function being called if interrupt level has not dropped low enough
to let softclock interrupts through.
Note that it is only safe to test
.Em PENDING
status when at softclock interrupt level or higher.
.It Fn callout_expired c
Tests to see if the callout's timer has expired.
If this returns true, then either the callout's function has already
been called or is guaranteed to be called, even if
.Fn callout_stop
or
.Fn callout_halt
are later used.
.It Fn callout_active c
Returns true if a timer has been started but not explicitly stopped,
even if it has already fired.
.Fn callout_active foo
is logically the same as
.Fn callout_pending foo
||
.Fn callout_expired foo ;
it is implemented as a separate function for compatibility with
.Fx
and for the special case of
.Fn TCP_TIMER_ISARMED .
Its use is not recommended.
.It Fn callout_invoking c
Tests the
.Em INVOKING
status of the callout handle
.Fa c .
This flag is set just before a callout's function is being called.
.Pp
This is useful in scenarios when concurrent or higher-priority code
which can't sleep stops a callout with
.Fn callout_stop
potentially just before it has expired, and seeks to deallocate storage
which the callout might use.
Since the code can't sleep, it can't use
.Fn callout_halt
to wait for the callout to finish.
Instead, it needs to distinguish three cases:
.Bl -enum -compact
.It
the callout has not yet expired,
.It
the callout has expired but has not yet begun to use the storage,
.It
the callout has expired and is already using the storage.
.El
.Pp
In such scenarios, one technique to prevent references to deallocated
storage would be to test whether any callout functions are in the
.Em INVOKING
state using
.Fn callout_invoking ,
and if so, to mark the data structure and defer storage
deallocation until the callout function is allowed to run.
For this handshake protocol to work, the callout function will
have to use the
.Fn callout_ack
function to clear this flag, typically after taking a lock.
.Bd -literal
mutex_enter(&sc->sc_lock);
if (!callout_stop(ch)) {
	/* 1. callout has not yet expired */
} else if (callout_invoking(ch)) {
	/* 2. callout has expired but not acked */
} else {
	/* 3. callout expired and acked */
}
mutex_exit(&sc->sc_lock);

/* callout function */
static void
driver_intr(void *arg)
{
	struct driver_softc *sc = arg;

	/* 2. callout has expired but not acked */

	mutex_enter(&sc->sc_lock);
	callout_ack(&sc->sc_timeout);
	/* 3. callout expired and acked */
	...
	mutex_exit(&sc->sc_lock);
}
.Ed
.It Fn callout_ack c
Clears the
.Em INVOKING
state in the callout handle
.Fa c .
This is used in situations where it is necessary to protect against
the race condition described under
.Fn callout_invoking .
.El
.Sh CONCURRENCY
The callout facility performs locking internally in order to guarantee the
atomicity of individual operations performed on callouts.
It does not provide life cycle management of user-provided callout data
structures, nor does it ensure that groups of operations (multiple function
calls) are performed atomically.
These aspects of callout management are the responsibility of the user of
the callout facility.
.Pp
Scheduled callouts may be active concurrently in a context different to the
user of the callout facility: on another CPU, or at a different interrupt
priority level or thread on the current CPU.
The callout facility provides only one guarantee in this regard: any given
callout will never have multiple concurrent invocations.
.Sh SEE ALSO
.Xr condvar 9 ,
.Xr hz 9 ,
.Xr mutex 9 ,
.Xr softint 9 ,
.Xr workqueue 9
.Sh HISTORY
The
.Nm callout
facility was implemented by Artur Grabowski and Thomas Nordin, based
on the work of G. Varghese and A. Lauck, described in the paper
Hashed and Hierarchical Timing Wheels: Data Structures for the
Efficient Implementation of a Timer Facility
in the Proceedings of the 11th ACM Annual Symposium on Operating System
Principles, Austin, Texas, November 1987.
It was adapted to the
.Nx
kernel by Jason R. Thorpe.
