NetBSD/src/share/man/man9/chooseproc.9
.\"     $NetBSD: chooseproc.9,v 1.3 2003/04/16 13:35:26 wiz Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 21, 2002
.Dt CHOOSEPROC 9
.Os
.Sh NAME
.Nm chooseproc
.Nd select next process from system run queue
.Sh SYNOPSIS
.In sys/proc.h
.Ft struct proc *
.Fn chooseproc "void"
.Sh DESCRIPTION
The
.Fn chooseproc
function is invoked by the scheduler to select the highest priority
process from the system run queue.
If a process is not available on the system run queue,
.Fn chooseproc
shall go into an
.Dq idle
loop by invoking
.Xr cpu_idle 9 .
The variable
.Va curproc
is set to
.Dv NULL
while
.Fn chooseproc
is idle so that CPU time is not allocated to the outgoing process.
.Pp
The
.Fn chooseproc
function must be called with the scheduler lock held
.Pq see Xr SCHED_LOCK 9
and at the
.Xr splsched 9
interrupt protection level.
.Sh SEE ALSO
.Xr cpu_idle 9 ,
.Xr mi_switch 9 ,
.Xr scheduler 9 ,
.Xr splsched 9
