NetBSD/src/share/man/man9/cpu_startup.9
.\"     $NetBSD: cpu_startup.9,v 1.7.2.2 2010/04/13 12:04:26 jruoho Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 13, 2010
.Dt CPU_STARTUP 9
.Os
.Sh NAME
.Nm cpu_startup
.Nd machine-dependent
.Tn CPU
startup
.Sh SYNOPSIS
.In sys/systm.h
.Ft void
.Fn cpu_startup "void"
.Sh DESCRIPTION
The machine-dependent
.Fn cpu_startup
is invoked early during system bootstrap, after the console
has been set up and immediately after
.Xr uvm 9
has been initialized.
.Pp
The following tasks are performed by
.Fn cpu_startup :
.Bl -bullet -offset indent
.It
print the initial copyright message;
.It
allocate memory and buffers for kernel tables; and
.It
initialize the
.Tn CPU .
.El
.Sh SEE ALSO
.Xr autoconf 9 ,
.Xr uvm 9
