NetBSD/src/share/man/man9/cpu_exit.9
.\"     $NetBSD: cpu_exit.9,v 1.5 2003/02/04 22:38:18 perry Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 24, 2002
.Dt CPU_EXIT 9
.Os
.Sh NAME
.Nm cpu_exit
.Nd machine-dependent process exit
.Sh SYNOPSIS
.Fd #include \*[Lt]sys/systm.h\*[Gt]
.Ft void
.Fn cpu_exit "struct proc *p"
.Sh DESCRIPTION
.Fn cpu_exit
is machine-dependent code invoked by
.Fn exit1
as the last action during process exit to switch to a new context
(possibly the idle context).
.Fn cpu_exit
will clean up machine-dependent process state and invoke
.Fn exit2
to schedule the old process's u-area and stack to be released by the
reaper thread.
.Fn cpu_exit
will then invoke
.Fn cpu_switch
to wait for another process to wake up.
.Pp
Note that
.Fn cpu_exit
should be called at
.Xr splhigh 9 .
.Sh CODE REFERENCES
This section describes places within the
.Nx
source tree where actual code using
.Fn cpu_exit
be found.
All pathnames are relative to
.Pa /usr/src .
.Pp
.Fn exit1
and
.Fn exit2
can be found within the file
.Pa sys/kern/kern_exit.c .
.Sh SEE ALSO
.Xr cpu_switch 9
