NetBSD/src/share/man/man9/cpu_swapout.9
.\"     $NetBSD: cpu_swapout.9,v 1.4.20.1 2008/06/02 13:21:41 mjf Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 20, 2005
.Dt CPU_SWAPOUT 9
.Os
.Sh NAME
.Nm cpu_swapout ,
.Nm cpu_swapin
.Nd machine-dependent swap interface
.Sh SYNOPSIS
.In sys/lwp.h
.In machine/cpu.h
.Ft void
.Fn cpu_swapout "struct lwp *l"
.Ft void
.Fn cpu_swapin "struct lwp *l"
.Sh DESCRIPTION
.Fn cpu_swapout
and
.Fn cpu_swapin
are the machine-dependent interface for swapping processes in and out
of the system.
They perform any machine-specific operations such as
saving and restoring floating point state.
They are invoked by
.Fn uvm_swapout
and
.Fn uvm_swapin
respectively.
.Sh SEE ALSO
.Xr uvm 9
