NetBSD/src/share/man/man9/cpu_dumpconf.9
.\"     $NetBSD: cpu_dumpconf.9,v 1.5.12.2 2007/07/30 22:48:47 alc Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 24, 2002
.Dt CPU_DUMPCONF 9
.Os
.Sh NAME
.Nm cpu_dumpconf ,
.Nm cpu_dump ,
.Nm cpu_dumpsize ,
.Nm dumpsys
.Nd machine-dependent kernel core dumps
.Sh SYNOPSIS
.In sys/types.h
.In sys/systm.h
.Ft void
.Fn cpu_dumpconf "void"
.Ft int
.Fn cpu_dump "int (*dump)(dev_t, daddr_t, void *, size_t)" "daddr_t *blknop"
.Ft int
.Fn cpu_dumpsize "void"
.Ft void
.Fn dumpsys "void"
.Sh DESCRIPTION
.Fn cpu_dumpconf
is the machine-dependent interface invoked during system bootstrap to
determine the dump device and initialize machine-dependent kernel core
dump state.
Internally,
.Fn cpu_dumpconf
will invoke
.Fn cpu_dumpsize
to calculate the size of machine-dependent kernel core dump headers.
.Pp
.Fn dumpsys
is invoked by
.Fn cpu_reboot
to dump kernel physical memory onto the dump device.
.Fn dumpsys
invokes
.Fn cpu_dump
to write the machine-dependent header to the dump device at block number
.Fa *blknop
using the dump device's PIO dump routine specified by the
.Fa dump
argument.
.Pp
.Fn cpu_dumpsize ,
.Fn cpu_dump ,
and
.Fn dumpsys
are parts of the machine-dependent interface, however they are not
exported to machine-independent code.
.Sh SEE ALSO
.Xr cpu_reboot 9
