NetBSD/src/share/man/man9/cpu_idle.9
.\"     $NetBSD: cpu_idle.9,v 1.3 2003/04/16 13:35:26 wiz Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 21, 2002
.Dt CPU_IDLE 9
.Os
.Sh NAME
.Nm cpu_idle
.Nd idle CPU while waiting for work
.Sh SYNOPSIS
.In sys/proc.h
.Ft void
.Fn cpu_idle "void"
.Sh DESCRIPTION
The
.Fn cpu_idle
function is invoked to idle the current CPU while waiting for work to be done.
It is primarily called by the scheduler if no processes are
available on the system run queue.
The
.Fn cpu_idle
function is a machine-dependent implementations in order to permit
low-level CPU control.
.Pp
The
.Fn cpu_idle
function must be called with the scheduler lock held
.P see Xr SCHED_LOCK 9
and at the
.Xr splsched 9
interrupt protection level.
It performs the following operations:
.Bl -bullet
.It
Release the scheduler lock.
.It
Lower the current interrupt priority level to permit interrupts to be
taken that will eventually cause processes to appear again on the
system run queue.
.It
Try to zero some pages for the virtual memory system.
.It
Perform any CPU or system power control.
.It
Wait until a process appears on the system run queue.
.It
Acquire the scheduler lock.
.El
.Pp
For CPUs which don't support an idle operation, the CPU must spin
until a process appears on the system run queue.
Generally, this is done by checking if the
.Va sched_whichqs
variable in the scheduler is not zero.
See
.Xr setrunqueue 9
for further details.
.Sh SEE ALSO
.Xr mi_switch 9 ,
.Xr scheduler 9 ,
.Xr setrunqueue 9 ,
.Xr spl 9 ,
.Xr uvm 9
