NetBSD/src/share/man/man9/CTASSERT.9
.\" $NetBSD: CTASSERT.9,v 1.1 2010/01/25 07:51:17 jruoho Exp $
.\" Copyright (c) 2003 Hiten M. Pandya
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/CTASSERT.9,v 1.3 2008/09/05 15:24:54 emaste Exp $
.\"
.Dd January 24, 2010
.Os
.Dt CTASSERT 9
.Sh NAME
.Nm CTASSERT
.Nd compile time assertion macro
.Sh SYNOPSIS
.Ft void
.Fn CTASSERT expression
.Sh DESCRIPTION
The
.Fn CTASSERT
macro evaluates
.Fa expression
at compile time and causes a compiler error if it is false.
.Pp
The
.Fn CTASSERT
macro is useful for asserting the size or alignment of important
data structures and variables during compilation, which would
otherwise cause the code to fail at run time.
.Sh IMPLEMENTATION NOTES
The
.Fn CTASSERT
macro should not be used in a header file.
It is implemented using a dummy typedef, with a name (based on line number)
that may conflict with a
.Fn CTASSERT
in a source file including that header.
.Sh EXAMPLES
Assert that the size of the
.Vt uuid
structure is 16 bytes.
.Pp
.Dl "CTASSERT(sizeof(struct uuid) == 16);"
.Sh SEE ALSO
.Xr KASSERT 9
.Sh AUTHORS
This manual page was written by
.An Hiten M. Pandya
.Aq hmp@FreeBSD.org .
