NetBSD/src/share/man/man9/hash.9
.\"     $NetBSD: hash.9,v 1.3 2003/04/16 13:35:28 wiz Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Luke Mewburn of Wasabi Systems, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 5, 2001
.Dt HASH 9
.Os
.Sh NAME
.Nm hash ,
.Nm hash32_buf ,
.Nm hash32_str ,
.Nm hash32_strn
.Nd kernel hash functions
.Sh SYNOPSIS
.In sys/types.h
.In sys/hash.h
.Ft uint32_t
.Fn hash32_buf "const void *buf" "size_t len" "uint32_t ihash"
.Ft uint32_t
.Fn hash32_str "const void *buf" "uint32_t ihash"
.Ft uint32_t
.Fn hash32_strn "const void *buf" "size_t len" "uint32_t ihash"
.Sh DESCRIPTION
The
.Nm
functions returns a hash of the given buffer.
.Pp
The
.Fn hash32_buf
function returns a 32 bit hash of
.Fa buf ,
which is
.Fa len
bytes long,
seeded with an initial hash of
.Fa ihash
(which is usually
.Dv HASH32_BUF_INIT ) .
This function may use a different algorithm to
.Fn hash32_str
and
.Fn hash32_strn .
.Pp
The
.Fn hash32_str
function returns a 32 bit hash of
.Fa buf ,
which is
a
.Dv NUL
terminated
.Tn ASCII
string,
seeded with an initial hash of
.Fa ihash
(which is usually
.Dv HASH32_STR_INIT ) .
This function must use the same algorithm as
.Fn hash32_strn ,
so that the same data returns the same hash.
.Pp
The
.Fn hash32_strn
function returns a 32 bit hash of
.Fa buf ,
which is
a
.Dv NUL
terminated
.Tn ASCII
string,
up to a maximum of
.Fa len
bytes,
seeded with an initial hash of
.Fa ihash
(which is usually
.Dv HASH32_STR_INIT ) .
This function must use the same algorithm as
.Fn hash32_str ,
so that the same data returns the same hash.
.Pp
The
.Fa ihash
parameter is provided to allow for incremental hashing by allowing
successive calls to use a previous hash value.
.Sh RETURN VALUES
The
.Fa hash32_*
functions return a 32 bit hash of the provided buffer.
.Sh HISTORY
The kernel hashing API first appeared in
.Nx 1.6 .
