NetBSD/src/share/man/man9/ieee80211_crypto.9
.\" $NetBSD: ieee80211_crypto.9,v 1.3 2006/09/12 11:05:23 pooka Exp $
.\"
.\" Copyright (c) 2004 Bruce M. Simpson <bms@spc.org>
.\" Copyright (c) 2004 Darron Broad <darron@kewl.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/ieee80211_crypto.9,v 1.2 2004/07/07 12:59:39 ru Exp $
.\"
.Dd September 12, 2006
.Dt IEEE80211_CRYPTO 9
.Os
.Sh NAME
.Nm ieee80211_crypto_attach , ieee80211_crypto_detach , ieee80211_crypto_encap
.Nd 802.11 WEP encryption functions
.Sh SYNOPSIS
.Ft void
.Fn ieee80211_crypto_attach "struct ieee80211com *ic"
.Ft void
.Fn ieee80211_crypto_detach "struct ieee80211com *ic"
.Ft struct ieee80211_key *
.Fo ieee80211_crypto_encap
.Fa "struct ieee80211com *ic" "struct ieee80211_node *ni" "struct mbuf *m0"
.Fc
.Sh DESCRIPTION
These functions provide encryption support for 802.11 device drivers.
.Pp
.\"
The
.Fn ieee80211_crypto_attach
function initializes crypto support for the interface
.Fa ic .
The default is null crypto.
.Pp
.\"
The
.Fn ieee80211_crypto_detach
function frees data structures associated with crypto support
for the interface
.Fa ic .
.Pp
.\"
The two above functions are automatically called by the interface
attach and detach routines, respectively.
.Pp
.\"
The
.Fn ieee80211_crypto_encap
function encapsulates the packet supplied in mbuf
.Fa m0 ,
with the crypto headers given the for node
.Fa ni .
Software encryption is possibly performed.
In case of no specified key for
.Fa ni
or multicast traffic, the default key for the interface
.Fa ic
is used for encapsulation.
The key is returned in the case of successful encapsulation,
otherwise
.Dv NULL
is returned.
.\"
.Sh SEE ALSO
.Xr ieee80211 9
.Sh HISTORY
The
.Nm ieee80211
series of functions first appeared in
.Nx 1.5 ,
and were later ported to
.Fx 4.6 .
.Sh AUTHORS
.An -nosplit
This man page was written by
.An Bruce M. Simpson Aq bms@FreeBSD.org
and
.An Darron Broad Aq darron@kewl.org .
