NetBSD/src/share/man/man9/itimerfix.9
.\"	$NetBSD: itimerfix.9,v 1.6 2006/06/17 04:58:15 reed Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Christos Zoulas.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 23, 2001
.Dt ITIMERFIX 9
.Os
.Sh NAME
.Nm itimerfix
.Nd check that a timeval value is valid, and correct
.Sh SYNOPSIS
.In sys/time.h
.Ft int
.Fn itimerfix "struct timeval *tv"
.Sh DESCRIPTION
The
.Nm
function checks that the value in
.Fa tv
is valid (0 \*[Le] tv-\*[Gt]tv_sec \*[Am]\*[Am]  0 \*[Le] tv-\*[Gt]tv_usec \*[Lt] 1000000), and that the
total time represented is at least one
.Em tick ,
or zero.
.Pp
If the total represented time is nonzero and smaller than tick,
it is adjusted to exactly one tick.
.Sh RETURN VALUES
.Nm
returns 0 on success or
.Er EINVAL
if
.Fa tv
is invalid.
.Sh SEE ALSO
.Xr nanosleep 2 ,
.Xr poll 2 ,
.Xr select 2 ,
.Xr setitimer 2
