NetBSD/src/share/man/man9/kcopy.9
.\"     $NetBSD: kcopy.9,v 1.6.46.1 2017/04/26 02:52:58 pgoyette Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 6, 2017
.Dt KCOPY 9
.Os
.Sh NAME
.Nm kcopy
.Nd copy data with abort on page fault
.Sh SYNOPSIS
.In sys/systm.h
.Ft int
.Fn kcopy "const void *src" "void *dst" "size_t len"
.Sh DESCRIPTION
.Fn kcopy
copies
.Fa len
bytes from
.Fa src
to
.Fa dst ,
aborting if a fatal page fault is encountered.
.Pp
.Fn kcopy
must save and restore the old fault handler since it is called by
.Xr uiomove 9 ,
which may be in the path of servicing a non-fatal page fault.
.Sh RETURN VALUES
.Fn kcopy
returns 0 on success and an error number on failure.
.Sh SEE ALSO
.Xr errno 2 ,
.Xr memcpy 9 ,
.Xr uiomove 9
