NetBSD/src/share/man/man9/log.9
.\"     $NetBSD: log.9,v 1.9.34.1 2008/05/18 12:31:13 yamt Exp $
.\"
.\" Copyright (c) 1997 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Michael Graff.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 12, 1997
.Dt LOG 9
.Os
.Sh NAME
.Nm log
.Nd log a message from the kernel through the
.Pa /dev/klog
device
.Sh SYNOPSIS
.In sys/syslog.h
.Ft void
.Fo "log"
.Fa "int level"
.Fa "const char *format"
.Fa "..."
.Fc
.Sh DESCRIPTION
The
.Fn log
function allows the kernel to send messages to user processes listening
on
.Pa /dev/klog .
Usually
.Xr syslogd 8
monitors
.Pa /dev/klog
for these messages and writes them to a log file.
.Pp
All messages are logged using facility
.Dv LOG_KERN .
See
.Xr syslog 3
for a listing of log levels.
.Sh SEE ALSO
.Xr syslog 3 ,
.Xr syslogd 8
