NetBSD/src/share/man/man9/makeiplcookie.9
.\"	$NetBSD: makeiplcookie.9,v 1.2 2006/12/21 16:09:22 yamt Exp $
.\"
.\" Copyright (c)2006 YAMAMOTO Takashi,
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" ------------------------------------------------------------
.Dd December 22, 2006
.Dt MAKEIPLCOOKIE 9
.Os
.\" ------------------------------------------------------------
.Sh NAME
.Nm makeiplcookie
.Nd compose an ipl cookie.
.\" ------------------------------------------------------------
.Sh SYNOPSIS
.In sys/param.h
.\" - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.Ft ipl_cookie_t
.Fn makeiplcookie \
"ipl_t ipl"
.\" ------------------------------------------------------------
.Sh DESCRIPTION
.Fn makeiplcookie
composes a cookie which can be fed into
.Fa splraiseipl .
.Fa ipl
should be one of
.Dv IPL_
constants.
.\" ------------------------------------------------------------
.Sh RETURN VALUES
.Fn makeiplcookie
returns a composed cookie.
.\" ------------------------------------------------------------
.Sh SEE ALSO
.Xr spl 9 ,
.Xr splraiseipl 9
