NetBSD/src/share/man/man9/microtime.9
.\"     $NetBSD: microtime.9,v 1.8 2002/02/13 08:18:46 ross Exp $
.\"
.\" Copyright (c) 1998 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jeremy Cooper.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 14, 1998
.Dt MICROTIME 9
.Os
.Sh NAME
.Nm microtime
.Nd realtime system clock
.Sh SYNOPSIS
.Fd #include \*[Lt]sys/time.h\*[Gt]
.Ft void
.Fo "microtime"
.Fa "struct timeval *tv"
.Fc
.Sh DESCRIPTION
.Fn microtime
returns the current value of the system realtime clock in the structure
pointed to by the argument
.Fa tv .
The system realtime clock is guaranteed to be monotonically increasing
at all times.
As such,
all calls to
.Fn microtime
are guaranteed to return a system time greater than or equal to the
system time returned in any previous calls.
.Sh SEE ALSO
.Xr settimeofday 2 ,
\" .Xr hardclock 9 ,
.Xr hz 9 ,
.Xr inittodr 9 ,
.Xr time 9
.Sh CODE REFERENCES
The implementation of the
.Fn microtime
function is machine dependent,
hence its location in the source code tree varies from architecture to
architecture.
.Sh BUGS
Despite the guarantee that the system realtime clock will always be
monotonically increasing,
it is always possible for the system clock to be manually reset by the
system administrator to any date.
