NetBSD/src/share/man/man9/nullop.9
.\" $NetBSD: nullop.9,v 1.1.2.2 2010/08/17 06:41:05 uebayasi Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jukka Ruohonen.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 25, 2010
.Dt NULLOP 9
.Os
.Sh NAME
.Nm nullop
.Nd dummy functions
.Sh SYNOPSIS
.In sys/systm.h
.Ft int
.Fn nullop "void *v"
.Ft void
.Fn voidop "void"
.Ft int
.Fn enodev "void"
.Ft int
.Fn enxio "void"
.Ft int
.Fn enoioctl "void"
.Ft int
.Fn enosys "void"
.Ft int
.Fn eopnotsupp "void"
.Sh DESCRIPTION
The
.Fn nullop
function provides a generic
.Dq null operation .
It always returns the value 0.
The
.Fn voidop
function takes no arguments and does nothing.
.Pp
The
.Fn enodev ,
.Fn enxio ,
.Fn enoioctl ,
.Fn enosys ,
and
.Fn eopnotsupp
functions always fail, returning
.Er ENODEV ,
.Er ENXIO ,
.Er ENOTTY ,
.Er ENOSYS ,
and
.Er EOPNOTSUPP ,
respectively.
.Sh EXAMPLES
The following example demonstrates a case where
.Fn nullop
may be useful:
.Bd -literal -offset indent
uint64_t xc;

\&...

xc = xc_broadcast(0, (xcfunc_t)nullop, NULL, NULL);
xc_wait(xc);
.Ed
