NetBSD/src/share/man/man9/panic.9
.\"     $NetBSD: panic.9,v 1.3 1997/07/19 20:05:31 kleink Exp $
.\"
.\" Copyright (c) 1996 Michael Graff.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"      This product includes software developed by Michael Graff
.\"      for the NetBSD Project.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd August 11, 1995
.Dt PANIC 9
.Os
.Sh NAME
.Nm panic
.Nd Bring down system on fatal error
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <sys/systm.h>
.Ft void
.Fn panic "const char *fmt, ..."
.Sh DESCRIPTION
The
.Fn panic
function terminates the NetBSD system.  The message
.Fa fmt
is a
.Xr printf 3
style format string.  The message is printed to the console and the location
.Fa panicstr 
is set to the address of the message text for retrival from the OS
core dump.
.Pp
If the kernel debugger is installed control is passed to it, otherwise
an attempt to save a core dump of the OS to a configured dump device
is made.
.Pp
If
.Fn panic
is called twice (from the disk sync routines, for example) the system is
rebooted without syncing the disks.
.Sh RETURN VALUES
The
.Fn panic
function does not return.
