NetBSD/src/share/man/man9/pathname.9
.\" $NetBSD: pathname.9,v 1.3 2007/04/15 10:36:51 plunky Exp $
.\"
.\" Copyright (c) 2006 Elad Efrat <elad@NetBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 15, 2007
.Dt PATHNAME 9
.Os
.Sh NAME
.Nm pathname
.Nd pathname management interface
.Sh SYNOPSIS
.In sys/namei.h
.In sys/uio.h
.Ft int
.Fn pathname_get "const char *dirp" "enum uio_seg segflg" "pathname_t *pnp"
.Ft const char *
.Fn pathname_path "pathname_t pn"
.Ft void
.Fn pathname_put "pathname_t pn"
.Sh DESCRIPTION
The
.Nm
interface provides an easy way to manage memory buffers used to hold pathnames.
It provides three functions:
.Pp
.Bl -tag -width 6n
.It Fn pathname_get "dirp" "segflg" "pnp"
Takes a path string
.Ar dirp ,
and an argument
.Ar segflg
indicating if the pointer refers to kernel-space
.Pq Dv UIO_SYSSPACE
or user-space
.Pq Dv UIO_USERSPACE .
Upon success, 
.Fn pathname_get
returns 0 and stores a pathname handle
in the location pointed to by
.Ar pnp .
Otherwise an error code is returned to indicate the reason for failure.
.It Fn pathname_path "pn"
Returns a pointer to the path referenced by
.Ar pn .
This pointer is safe to use in the kernel.
.It Fn pathname_put "pn"
Frees all memory associated with
.Ar pn .
.El
.Sh SEE ALSO
.Xr namei 9
.Sh AUTHORS
.An Elad Efrat Aq elad@NetBSD.org
.Sh CAVEATS
If the path string is located in kernel-space,
.Fn pathname_get
will use it rather than making a copy.
.Pp
The
.Nm
interface is experimental and subject to change.
Its existence should not be relied on.
