NetBSD/src/share/man/man9/pci_msi.9
.\" $NetBSD: pci_msi.9,v 1.1 2015/04/27 07:03:57 knakahara Exp $
.\"
.\" Copyright (c) 2015 Internet Initiative Japan Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 8, 2015
.Dt PCI_MSI 9 (DRAFT)
.Os
.Sh NAME (DRAFT)
.Nm pci_msi ,
.Nm pci_msix,
.Nm pci_msi_count ,
.Nm pci_msi_alloc ,
.Nm pci_msi_alloc_exact ,
.Nm pci_msi_release ,
.Nm pci_msi_establish ,
.Nm pci_msi_disestablish ,
.Nm pci_msi_string
.Nm pci_msix_count ,
.Nm pci_msix_alloc ,
.Nm pci_msix_alloc_exact ,
.Nm pci_msix_alloc_map ,
.Nm pci_msix_release ,
.Nm pci_msix_establish ,
.Nm pci_msix_disestablish ,
.Nm pci_intx_alloc ,
.Nm pci_intx_release
.Nd PCI MSI{,-X} manipulation functions
.Sh SYNOPSIS
.In NOTYET
.Ft int
.Fn pci_msi_count "struct pci_attach_args *pa"
.Ft int
.Fn pci_msi_alloc  "struct pci_attach_args *pa" \
"pci_intr_handle_t **ihps" "int *count"
.Ft int
.Fn pci_msi_alloc_exect "struct pci_attach_args *pa" \
"pci_intr_handle_t **ihps" "int count"
.Ft void
.Fn pci_msi_release "pci_intr_handle_t **pihs" "int count"
.Ft void *
.Fn pci_msi_establish "pci_chipset_tag_t pc" "pci_intr_handle_t ih" \
"int level" "int (*func)(void *)" "void *arg"
.Ft void
.Fn pci_msi_disestablish "pci_chipset_tag_t pc" "void *cookie"
.Ft const char *
.Ft pci_msi_string "pci_chipset_tag_t pc" \
"pci_intr_handle_t, char *buf" "size_t len"
.Ft int
.Fn pci_msix_count "struct pci_attach_args *pa"
.Ft int
.Fn pci_msix_alloc  "struct pci_attach_args *pa" \
"pci_intr_handle_t **ihps" "int *count"
.Ft int
.Fn pci_msix_alloc_exect "struct pci_attach_args *pa" \
"pci_intr_handle_t **ihps" "int count"
.Ft int
.Fn pci_msix_alloc_map "struct pci_attach_args *pa" \
"pci_intr_handle_t **ihps" "u_int *table_indexes" "int count"
.Ft void
.Fn pci_msix_release "pci_intr_handle_t **pihs" "int count"
.Ft void *
.Fn pci_msix_establish "pci_chipset_tag_t pc" "pci_intr_handle_t ih" \
"int level" "int (*func)(void *)" "void *arg"
.Fn pci_msix_disestablish "pci_chipset_tag_t pc" "void *cookie"
.Ft int
.Fn pci_intx_alloc  "struct pci_attach_args *pa" \
"pci_intr_handle_t **ihp"
.Ft void
.Fn pci_intx_release "pci_intr_handle_t *pih"
.Sh DESCRIPTION
XXX This decument describes draft APIs. These APIs may change later.
.Pp
The
.Nm
functions exist to allow device drivers to use MSI/MSI-X.
When the system use MSI/MSI-X, it must define a __HAVE_PCI_MSI_MSIX
build option.
.Pp
Each driver has an
.Fn attach
function which has a bus-specific
.Ft attach_args
structure.
Each driver for a PCI device is passed a pointer to an object of type
.Ft struct pci_attach_args
which contains, among other things, information about the location
of the device in the PCI bus topology sufficient to allow interrupts
from the device to be handled.
.Pp
If a driver wishes to establish an MSI handler for the device,
it should pass the
.Ft struct pci_attach_args *
and
.Ft count
.Fn pci_msi_alloc
or
.Fn pci_msi_alloc_exact
functions, which returns zero on success, and nonzero on failure.
When the functions successed, set the pointer to allocated handle
array to
.Ft pihs
whose size is
.Ft count
or less. The difference between
.Fn pci_msi_alloc
and
.Fn pci_msi_alloc_exact
is
.Ft count
can be decremented or not.
.Fn pci_msi_alloc
can decrement
.Ft count ,
and
which is similar to FreeBSD's
.Fn pci_alloc_msi .
In contrast,
.Fn pci_msi_alloc_exact
can not decrement
.Ft count .
.Pp
If the driver wishes to refer to the MSI source in an attach or
error message, it should use the value returned by
.Fn pci_msi_string .
The buffer passed to
.Fn pci_msi_string
should be at least
.Dv PCI_INTRSTR_LEN
bytes.
.Pp
Subsequently, when the driver is prepared to receive MSIs, it
should call
.Fn pci_msi_establish
to actually establish the handler; when the device interrupts,
.Fa intrhand
will be called with a single argument
.Fa intrarg ,
and will run at the interrupt priority level
.Fa ipl .
This is the same as
.Fn pci_intr_establish .
.Pp
The return value of
.Fn pci_msi_establish
may be saved and passed to
.Fn pci_msi_disestablish
to disable the interrupt handler
when the driver is no longer interested in MSIs from the device.
After that, the driver should also
.Fn pci_msi_release
to free resources about MSI.
.Pp
If a driver wishes to establish an MSI-X handler for the device,
it is alomost the same as MSI.
The only differences is
.Fn pci_msix_alloc_map .
This function can assign each handles to MSI-X table entries.
e.g. If the driver want assign each handler to
.Bd -literal
	msix_handler0 => MSI-X table index: 4
	msix_handler1 => MSI-X table index: 5
	msix_handler2 => MSI-X table index: 0
.Ed
, the driver should set
.Bd -literal
	table_indexes[0] = 4;
	table_indexes[1] = 5;
	table_indexes[2] = 0;
.Ed
to
.Ft table_indexes .
.Pp
If the driver want to fallback to INTx, the driver should use
.Fn pci_intx_alloc
and
.Fn pci_intx_release
instead of
.Fn pci_intr_map
to resolve contradiction of the interrupt handler ownership.
i.e.
.Fn pci_intr_map
does not have the ownership (the function just calcurates value),
in contrast,
.Fn pci_msi_alloc
and
.Fn pci_msix_alloc
has the owneship (the functions allocate memory for interrupt
handlers).
