NetBSD/src/share/man/man9/proc_find.9
.\" $NetBSD: proc_find.9,v 1.1.2.2 2010/08/17 06:41:05 uebayasi Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jukka Ruohonen.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 1, 2010
.Dt PROC_FIND 9
.Os
.Sh NAME
.Nm proc_find ,
.Nm pgrp_find
.Nd find process or process group
.Sh SYNOPSIS
.In sys/proc.h
.Ft struct proc *
.Fn proc_find "pid_t pid"
.Ft struct pgrp *
.Fn pgrp_find "pid_t pgid"
.Pp
.Va extern kmutex_t *proc_lock;
.Sh DESCRIPTION
The
.Fn proc_find
and
.Fn pgrp_find
functions retrieve process and process group structures from process
.Tn ID
.Fa pid
and process group
.Tn ID
.Fa pgid .
Both functions must be called by holding a
.Xr mutex 9
on
.Va proc_lock .
.Sh RETURN VALUES
Upon successful completion, the described functions return a pointer to either
.Em struct proc
or
.Em struct pgrp .
Otherwise, if the requested
.Tn ID
was not found,
.Dv NULL
is returned.
.Sh SEE ALSO
.Xr curproc 9
