NetBSD/src/share/man/man9/RUN_ONCE.9
.\"	$NetBSD: RUN_ONCE.9,v 1.1 2005/11/24 08:14:13 yamt Exp $
.\"
.\" Copyright (c)2005 YAMAMOTO Takashi,
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" ------------------------------------------------------------
.Dd November 24, 2005
.Dt RUN_ONCE 9
.Os
.\" ------------------------------------------------------------
.Sh NAME
.Nm RUN_ONCE
.Nd Run a function exactly once
.\" ------------------------------------------------------------
.Sh SYNOPSIS
.In sys/once.h
.\" - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.Vt ONCE_DECL(control);
.\" - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.Ft void
.Fn RUN_ONCE \
"once_t *control" "void (*init_func)(void)"
.\" ------------------------------------------------------------
.Sh DESCRIPTION
.Fn RUN_ONCE
provides a functionality similar to
.Fn pthread_once 3 .
It ensures that
.Fn init_func
is called exactly once for given
.Fa control .
It can sleep if it's called concurrently.
.\" ------------------------------------------------------------
.Sh EXAMPLES
The following example shows how
.Fn RUN_ONCE
is used.
Regardless to how many times
.Fn some_func
is executed,
.Fn init_func
will be executed exactly once.
.Bd -literal
static void
init_func(void)
{

	/*
	 * do some initialization.
	 */
}

int
some_func(void)
{
	static DECL_ONCE(control);

	RUN_ONCE(&control, init_func);

	/*
	 * we are sure that init_func has already been completed here.
	 */
}
.Ed
.\" ------------------------------------------------------------
.Sh SEE ALSO
.Xr intro 9 ,
.Xr ltsleep 9 ,
.Xr pthread_once 3
