NetBSD/src/share/man/man9/scanc.9
.\"	$NetBSD: scanc.9,v 1.2 2011/11/01 23:18:07 wiz Exp $
.\"
.\" Copyright (c)2011 YAMAMOTO Takashi,
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" ------------------------------------------------------------
.Dd November 1, 2011
.Dt SCANC 9
.Os
.\" ------------------------------------------------------------
.Sh NAME
.Nm scanc
.Nd use byte string as lookup table index
.\" ------------------------------------------------------------
.Sh SYNOPSIS
.In lib/libkern/libkern.h
.\" - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.Ft int
.Fn scanc \
"size_t size" "const u_char *cp" "const u_char table[]" "int mask"
.\" ------------------------------------------------------------
.Sh DESCRIPTION
The
.Fn scanc
function scans the byte string
.Fa cp ,
whose length is
.Fa size .
A character in the string is used as an index in the 256-byte
.Fa table .
If a bitwise-AND of the byte from the table and
.Fa mask
isn't zero or the string is exhausted, the scan stops.
.\" ------------------------------------------------------------
.Sh RETURN VALUES
The
.Fn scanc
function returns the number of characters skipped.
.\" ------------------------------------------------------------
.Sh HISTORY
The
.Fn scanc
function emulates a VAX instruction with the same name.
