NetBSD/src/share/man/man9/SCHED_LOCK.9
.\"     $NetBSD: SCHED_LOCK.9,v 1.1 2002/09/22 06:27:17 gmcgarry Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS 
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 21, 2002
.Dt SCHED_LOCK 9
.Os
.Sh NAME
.Nm SCHED_LOCK ,
.Nm SCHED_UNLOCK ,
.Nm sched_lock_idle ,
.Nm sched_unlock_idle
.Nd scheduler lock operations
.Sh SYNOPSIS
.Fd #include \*[Lt]sys/sched.h\*[Gt]
.Ft void
.Fn sched_lock_idle "void"
.Ft void
.Fn sched_unlock_idle "void"
.Ft int
.Fn SCHED_LOCK "void"
.Ft void
.Fn SCHED_UNLOCK "s"
.Sh DESCRIPTION
Access to the system run queue within the scheduler is protected by
the
.Va sched_lock
simplelock and the
.Xr splsched
interrupt priority level.  The
.Fn sched_lock_idle
and
.Fn sched_unlock_idle
are simple functions without arguments which can be called easily from
machine-dependent assembler routines
.Pq such as from Xr cpu_idle 9
to lock and unlock the scheduler.
The macros
.Fn SCHED_LOCK
and
.Fn SCHED_UNLOCK
provide a simple interface for machine-independent routines to
simultaneously acquire
.Va sched_lock
and raise the interrupt priority level to
.Xr splsched 9 .
.Fn SCHED_LOCK
returns the current interrupt priority level which is later passed to
.Fn SCHED_UNLOCK
when the scheduler lock is released.
.Sh SEE ALSO
.Xr scheduler 9 ,
.Xr splsched 9
