NetBSD/src/share/man/man9/secmodel_suser.9
.\" $NetBSD: secmodel_suser.9,v 1.5.6.1 2014/08/20 00:02:37 tls Exp $
.\"
.\" Copyright (c) 2009 Elad Efrat <elad@NetBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 4, 2011
.Dt SECMODEL_SUSER 9
.Os
.Sh NAME
.Nm secmodel_suser
.Nd super-user security model
.Sh DESCRIPTION
.Nm
implements the traditional
.Em super-user
(root) as the user with effective user-id 0.
The
.Em super-user
is the host administrator, considered to have higher privileges than other
users.
.Sh FUNCTIONS
.Nm
exposes a
.Xr secmodel_eval 9
evaluation routine
to test whether a set of credentials can be assimilated to
.Em super-user
credentials or not.
.Pp
The parameters to
.Xr secmodel_eval 9
are:
.Bl -tag -compact -width xxxxx
.It id
the unique identifier of
.Nm :
.Qo Dv org.netbsd.secmodel.suser Qc
.It what
a string,
.Qo Dv is-root Qc .
.It arg
the
.Xr kauth 9
credentials
.Po Fa kauth_cred_t Pc
of the caller.
.It ret
a boolean, set by
.Nm
to
.Dv true
when the credentials are equivalent to
.Em super-user ,
.Dv false
otherwise.
.El
.Sh RETURN TYPES
If successful, the evaluation returns 0 with the
.Fa ret
argument being either
.Dv true
or
.Dv false .
.Sh SEE ALSO
.Xr kauth 9 ,
.Xr secmodel 9 ,
.Xr secmodel_bsd44 9 ,
.Xr secmodel_eval 9
.Sh AUTHORS
.An Elad Efrat Aq Mt elad@NetBSD.org
