NetBSD/src/share/man/man9/selrecord.9
.\"     $NetBSD: selrecord.9,v 1.7 2008/02/14 17:25:51 ad Exp $
.\"
.\" Copyright (C) 2002 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/selrecord.9,v 1.2 2002/05/30 13:29:17 ru Exp $
.\"
.\" FreeBSD: .Dd March 20, 2002
.Dd Febuary 14, 2008
.Dt SELRECORD 9
.Os
.Sh NAME
.Nm selrecord ,
.Nm selwakeup
.Nd record and wakeup select requests
.Sh SYNOPSIS
.In sys/param.h
.In sys/select.h
.Ft void
.Fn selrecord "struct lwp *selector" "struct selinfo *sip"
.Ft void
.Fn selwakeup "struct selinfo *sip"
.Ft void
.Fn selnotify "struct selinfo *sip" "long knhint"
.Sh DESCRIPTION
.Fn selrecord
and
.Fn selwakeup
are the two central functions used by
.Xr select 2 ,
.Xr poll 2 ,
and the objects that are being selected on.
They handle the task of recording which threads are waiting on which objects
and the waking of the proper threads when an event of interest occurs on an
object.
.Pp
.Fn selrecord
records that the calling thread is interested in events related to a given
object.
.Pp
.Fn selwakeup
is called by the underlying object handling code in order to notify any waiting
threads that an event of interest has occurred.
.Pp
.Fn selnotify
calls
.Fn selwakeup
and then calls
.Fn KNOTE
with
.Va knhint .
In most cases,
.Fn selnotify
should be used rather than using
.Fn selwakeup
directly.
.Sh SEE ALSO
.Xr poll 2 ,
.Xr select 2 ,
.Xr knote 9
