NetBSD/src/share/man/man9/SET.9
.\" $NetBSD: SET.9,v 1.1 2010/03/22 10:32:48 jruoho Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jukka Ruohonen.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 22, 2010
.Dt SET 9
.Os
.Sh NAME
.Nm SET
.Nd primitive bit macros
.Sh SYNOPSIS
.In sys/types.h
.Ft void
.Fn SET "val" "x"
.Ft void
.Fn ISSET "val" "x"
.Ft void
.Fn CLR "val" "x"
.Sh DESCRIPTION
These macros define three standard bit-operations:
.Bl -enum -offset indent
.It
.Fn SET
sets the bit
.Fa x
in
.Fa val ;
.It
.Fn CLR
clears the bit
.Fa x
in
.Fa val ;
and
.It
.Fn ISSET
returns 1 if the bit
.Fa x
is set in
.Fa val .
.El
.Pp
The rationale is to provide clarity in the source code,
but arguably these operations are clear enough without the use of the macros.
.Sh SEE ALSO
.Xr bits 3
