NetBSD/src/share/man/man9/setjmp.9
.\"     $NetBSD: setjmp.9,v 1.4 2008/04/30 13:10:58 martin Exp $
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 23, 2002
.Dt SETJMP 9
.Os
.Sh NAME
.Nm setjmp ,
.Nm longjmp
.Nd non-local jumps
.Sh SYNOPSIS
.In machine/types.h
.In sys/systm.h
.Ft int
.Fn setjmp "label_t *label"
.Ft void
.Fn longjmp "label_t *label"
.Sh DESCRIPTION
The
.Fn setjmp
function saves its calling environment in
.Fa label .
It returns zero on success.
The
.Fn longjmp
function restores the environment saved by the most recent
invocation of
.Fn setjmp .
It returns so that kernel execution continues as if
the corresponding invocation of the
.Fn setjmp
had just returned.
.Pp
.Fn setjmp
and
.Fn longjmp
are a machine-independent interface for machine-dependent
implementations.
.Pp
These functions are primarily used by
.Xr ddb 4 .
.Sh SEE ALSO
.Xr ddb 4
