NetBSD/src/share/man/man9/setrunqueue.9
.\"	$NetBSD: setrunqueue.9,v 1.4 2002/07/05 10:46:44 wiz Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 5, 2001
.Dt SETRUNQUEUE 9
.Os
.Sh NAME
.Nm setrunqueue ,
.Nm remrunqueue
.Nd manipulate system run queue
.Sh SYNOPSIS
.Fd #include \*[Lt]sys/proc.h\*[Gt]
.Ft void
.Fn setrunqueue "struct proc *p"
.Ft void
.Fn remrunqueue "struct proc *p"
.Sh DESCRIPTION
The
.Nm setrunqueue
and
.Nm remrunqueue
functions manipulate the system queue of runnable processes. The
system scheduler uses this queue to find the highest-priority process
when a process switch occurs. These functions are machine-dependent in
order to permit efficient implementation of priority-based process
selection.
.Pp
The
.Nm setrunqueue
function places the given process on the system run queue. It is an
error to call
.Nm setrunqueue
with a process that is not runnable or that is already on the system
run queue or sleep queue.
.Pp
The
.Nm remrunqueue
function removes the given process from the system run queue. It is an
error to call
.Nm remrunqueue
with a process that is not on the system run queue.
.Pp
These functions must be called with the scheduler lock held and at the
.Nm splsched
interrupt protection level.  The macros
.Dv SCHED_LOCK(s) ,
.Dv SCHED_UNLOCK(s) ,
and
.Dv SCHED_ASSERT_LOCKED() ,
are provided for this locking interface.
.Sh SEE ALSO
.Xr splsched 9
