NetBSD/src/share/man/man9/workqueue_enqueue.9
.\"	$NetBSD: workqueue_enqueue.9,v 1.4 2007/08/07 20:50:39 wiz Exp $
.\"
.\" Copyright (c)2005 YAMAMOTO Takashi,
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" ------------------------------------------------------------
.Dd August 8, 2007
.Dt WORKQUEUE_ENQUEUE 9
.Os
.\" ------------------------------------------------------------
.Sh NAME
.Nm workqueue_enqueue
.Nd Enqueue a work for later processing
.\" ------------------------------------------------------------
.Sh SYNOPSIS
.In sys/workqueue.h
.\" - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.Ft void
.Fn workqueue_enqueue \
"struct workqueue *wq" "struct work *wk" "struct cpu_info *ci"
.\" ------------------------------------------------------------
.Sh DESCRIPTION
Enqueue the work
.Fa wk
into the workqueue
.Fa wq .
.Pp
If the
.Dv WQ_PERCPU
flag was set on workqueue creation, the
.Fa ci
argument may be used to specify the CPU on which the work should
be enqueued.
Also it may be
.Dv NULL ,
then work will be enqueued on the current CPU.
If
.Dv WQ_PERCPU
flag was not set,
.Fa ci
must be
.Dv NULL .
.Pp
The enqueued work will be processed in a thread context.
A work must not be enqueued again until the callback is called by
the
.Xr workqueue 9
framework.
.\" ------------------------------------------------------------
.Sh SEE ALSO
.Xr intro 9 ,
.Xr workqueue 9
