NetBSD/src/share/man/man9/workqueue_create.9
.\"	$NetBSD: workqueue_create.9,v 1.11 2008/05/06 08:32:27 yamt Exp $
.\"
.\" Copyright (c)2005 YAMAMOTO Takashi,
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" ------------------------------------------------------------
.Dd August 5, 2007
.Dt WORKQUEUE_CREATE 9
.Os
.\" ------------------------------------------------------------
.Sh NAME
.Nm workqueue_create
.Nd Create a workqueue
.\" ------------------------------------------------------------
.Sh SYNOPSIS
.In sys/workqueue.h
.\" - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
.Ft int
.Fn workqueue_create \
"struct workqueue **wqp" "const char *name" \
"void (*func)(struct work *, void *)" "void *arg" \
"pri_t prio" "int ipl" "int flags"
.\" ------------------------------------------------------------
.Sh DESCRIPTION
.Fn workqueue_create
creates a workqueue.
It takes the following arguments.
.Bl -tag -width flags
.It Fa wqp
Specify where to store the created workqueue.
.It Fa name
The name of the workqueue.
.It Fa func
The function to be called for each
.Fa work .
.It Fa arg
An argument to be passed as a second argument of
.Fa func .
.It Fa prio
The process priority to be used when sleeping to wait requests.
.It Fa ipl
The highest IPL at which this workqueue is used.
.It Fa flags
The value of 0 indicates a standard create operation, however the following
flags may be bitwise ORed together:
.Bl -tag -width WQ_MPSAFE
.It Dv WQ_MPSAFE
Specifies that the workqueue is multiprocessor safe and does its own locking,
otherwise the kernel lock will be held while work will be processed.
.It Dv WQ_PERCPU
Specifies that the workqueue should have a separate queue for each CPU,
thus the work could be enqueued on concrete CPUs.
.El
.El
.\" ------------------------------------------------------------
.Sh RETURN VALUES
.Fn workqueue_create
returns 0 on success.
Otherwise, it returns an
.Xr errno 2 .
.\" ------------------------------------------------------------
.Sh SEE ALSO
.Xr errno 2 ,
.Xr condvar 9 ,
.Xr intro 9 ,
.Xr workqueue 9
