NetBSD/src/sbin/mount_cd9660/mount_cd9660.8
.\" $NetBSD: mount_cd9660.8,v 1.8.6.1 2000/06/22 16:05:34 minoura Exp $
.\"
.\" Copyright (c) 1993, 1994
.\"     The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Christopher G. Demetriou.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mount_cd9660.8	8.3 (Berkeley) 3/27/94
.\"
.Dd March 27, 1994
.Dt MOUNT_CD9660 8
.Os BSD 4
.Sh NAME
.Nm mount_cd9660
.Nd mount an ISO-9660 filesystem
.Sh SYNOPSIS
.Nm ""
.Op Fl egjr
.Op Fl o Ar options
.Ar special node
.Sh DESCRIPTION
The
.Nm
command attaches the ISO-9660 filesystem residing on the device
.Pa special
to the global filesystem namespace at the location indicated by
.Pa node .
This command is normally executed by
.Xr mount 8
at boot time.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl e
Enable the use of extended attributes.
.It Fl g
Do not strip version numbers on files and leave the case of the filename
alone.
(By default, uppercase characters are translated to lowercase,
and if there are files with different version numbers on the disk,
only the last one will be listed.)
.Pp
In either case, files may be opened without giving a
version number, in which case you get the last one, or by explicitly
stating a version number (albeit it's quite difficult to know it, if
you are not using the
.Fl g
option), in which case you get the specified version.
.It Fl j
Do not make use of Joliet extensions for long filenames which
may be present in the filesystem.
.Pp
Interpretation of Joliet extensions is enabled by default, but
currently does not support Unicode characters present in some
Joliet filesystems.
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
Besides options mentioned in
.Xr mount 8
man page, following cd9660-specific options are supported:
.Bl -tag -width indent
.It Cm nomaplcase
File names on cd9660 cdrom without Rock Ridge extension present
should be uppercase only. By default, cd9660 recodes file
names read from a non-Rock Ridge disk to all lowercase characters.
.Cm nomaplcase
turns off this mapping.
.El
.It Fl r
Do not use any Rockridge extensions included in the filesystem.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh BUGS
The cd9660 filesystem does not support the original "High Sierra"
("CDROM001") format.
.Pp
POSIX device node mapping is currently not supported.
.Pp
Version numbers are not stripped if Rockridge extensions are in use.
In this case, you have to use the original name of the file as recorded
on disk, i.e. use uppercase and append the version number to the file.
.Pp
There is no ECMA support.
.Sh HISTORY
The
.Nm
utility first appeared
.Bx 4.4 .
