NetBSD/src/share/man/man4/man4.sandpoint/nhpow.4
.\" $NetBSD: nhpow.4,v 1.1 2012/01/15 14:40:15 phx Exp $
.\"
.\" Copyright (c) 2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Frank Wille.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 15, 2012
.Dt NHPOW 4 sandpoint
.Os
.Sh NAME
.Nm nhpow
.Nd driver for the NH-230/231 board control GPIO pins
.Sh SYNOPSIS
.Cd "nhpow0 at mainbus0"
.Cd "gpio* at nhpow0"
.Sh DESCRIPTION
This driver initializes the LEDs and the fan speed during boot and
establishes a reboot and power-off hook in the kernel.
.Pp
.Nm
also detects a soft power-off condition, which is triggered by holding
the front panel power button pressed for several seconds.
This driver can optionally invoke
.Xr powerd 8
to get a finer control over the system shutdown procedure.
It is capable of reporting a power-button-pressed event.
Refer to the
.Xr powerd 8
manual section for more details.
.Pp
The
.Nm
driver provides access to its 8 bidirectional GPIO pins through the
.Xr gpio 4
controller interface.
The pins have the following meaning when being written:
.Bl -column "Pin" "Active level" "Function" -offset indent
.It Sy "Pin" Ta Sy "Active level" Ta Sy "Function"
.It Li "0" Ta "high" Ta "System power off"
.It Li "1" Ta "high" Ta "Assert system reset to all devices"
.It Li "2" Ta "low"  Ta "Status LED"
.It Li "3" Ta "high" Ta "High speed fan"
.It Li "4" Ta "low"  Ta "Debug LED 1"
.It Li "5" Ta "low"  Ta "Debug LED 2"
.It Li "6" Ta "low"  Ta "USB port 1 LED"
.It Li "7" Ta "low"  Ta "USB port 2 LED"
.El
.Pp
When reading, the pins have the following meaning:
.Bl -column "Pin" "Active level" "Function" -offset indent
.It Sy "Pin" Ta Sy "Active level" Ta Sy "Function"
.It Li "0" Ta "low"  Ta "Power button pressed"
.It Li "1" Ta "low"  Ta "Reset/install button pressed"
.It Li "4" Ta "high" Ta "H/W version bit 0"
.It Li "5" Ta "high" Ta "H/W version bit 1"
.It Li "6" Ta "high" Ta "H/W version bit 2"
.It Li "7" Ta "high" Ta "H/W version bit 3"
.El
.Pp
.Nm
attaches automatically for all
.Tn NH-230/231
compatible products:
.Bl -bullet -compact
.It
Allnet 6250
.It
Allnet 6260
.It
Encore ENNHD-1000
.It
Fujitsu-Siemens AMS150
.It
Fujitsu-Siemens SBLAN2
.It
Longshine LCS-8311
.It
Netronix NH-230
.It
Netronix NH-231
.It
Planex NAS-01G
.El
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 3
variables are available:
.Bl -tag -width indent
.It machdep.nhpow.fan
Sets the fan speed to high (1) or low (0).
.El
.Sh FILES
.Bl -tag -width /dev/powerX -compact
.It Pa /dev/power
event notify channel to
.Xr powerd 8 .
.El
.Sh SEE ALSO
.Xr gpio 4 ,
.Xr gpioctl 8 ,
.Xr powerd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 6.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Frank Wille .
