NetBSD/src/share/man/man4/man4.sandpoint/satmgr.4
.\" $NetBSD: satmgr.4,v 1.5 2012/01/15 20:27:58 wiz Exp $
.\"
.\" Copyright (c) 2011-2012 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Tohru Nishimura.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 15, 2012
.Dt SATMGR 4 sandpoint
.Os
.Sh NAME
.Nm satmgr
.Nd driver for satellite processor, controlling power, front panel LEDs, and buttons
.Sh SYNOPSIS
.Cd "satmgr0 at eumb? unit 0"
.Cd "satmgr0 at eumb? unit 1"
.Sh DESCRIPTION
This driver provides an interface to the
.Tn NAS
builtin satellite microprocessor which controls the power, front
panel LEDs, and push buttons.
Communication is performed through character sequences, whose
definition and usage depend on the
.Tn NAS
product models.
.Pp
The device file
.Pa /dev/satmgr
can be written to control the satellite processor and the LEDs.
Reading it will return single characters for button press events.
This facility was designed to implement a
.Tn NAS
control
.Tn CGI
program.
.Pp
.Nm
detects a soft power-off condition, which is triggered by holding
the front panel power button pressed for several seconds.
This driver can optionally invoke
.Xr powerd 8
to get a finer control over the system shutdown procedure.
It is capable of reporting a power-button-pressed event.
Refer to the
.Xr powerd 8
manual section for more details.
.Pp
.Tn NAS
products supported by
.Nm :
.Bl -bullet -compact
.It
Buffalo LinkStation
.It
Conceptronic CH3WNAS
.It
D-Link DSM-G600 (Rev. B)
.It
Iomega StorCenter
.It
KuroBox
.It
LevelOne FNS-5000B
.It
QNAP TurboStation
.It
Synology DiskStation
.El
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 3
variables are available for
.Tn "Kurobox/Linkstation"
.Tn NAS
products:
.Bl -tag -width indent
.It machdep.satmgr.hwwdog_enable
Toggle the system watchdog on (1) or off (0).
.El
.Pp
For the
.Tn "Iomega StorCenter"
the following variables have been defined:
.Bl -tag -width indent
.It machdep.satmgr.fan_low_temp
Set the temperature below which the fan is turned off.
.It machdep.satmgr.fan_high_temp
Set the temperature above which the fan is turned on.
.El
.Sh FILES
.Bl -tag -width /dev/satmgrX -compact
.It Pa /dev/satmgr
communication inferface to
.Nm .
.It Pa /dev/power
event notify channel to
.Xr powerd 8 .
.El
.Sh SEE ALSO
.Xr powerd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Nx 6.0 .
