NetBSD/src/share/man/man4/man4.sandpoint/satmgr.4
.\" $NetBSD: satmgr.4,v 1.3.2.2 2011/02/08 18:15:42 bouyer Exp $
.\"
.\" Copyright (c) 2011 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Tohru Nishimura.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd January 26, 2011
.Dt SATMGR 4 sandpoint
.Os
.Sh NAME
.Nm satmgr
.Nd driver for satellite processor, controlling power, front panel LEDs, and buttons
.Sh SYNOPSIS
.Cd "satmgr0 at eumb? unit 0"
.Cd "satmgr0 at eumb? unit 1"
.Sh DESCRIPTION
This driver provides an interface to the
.Tn NAS
builtin satellite microprocessor which controls the power, front
panel LEDs, and push buttons.
Communication is performed through character sequences, whose
definition and usage depend on the
.Tn NAS
product models.
.Pp
The device file
.Pa /dev/satmgr
can be written to control the satellite processor and the LEDs.
Reading it will return single characters for button press events.
This facility was designed to implement a
.Tn NAS
control
.Tn CGI
program.
.Pp
.Nm
detects a soft power-off condition, which is triggered by holding
the front panel power button pressed for several seconds.
This driver can optionally invoke
.Xr powerd 8
to get a finer control over the system shutdown procedure.
It is capable of reporting a power-button-pressed event.
Refer to the
.Xr powerd 8
manual section for more details.
.Pp
For
.Tn "Kurobox/Linkstation"
.Tn NAS
products it also provides a way to toggle the system watchdog with the
.Xr sysctl 8
utility.
The usage is:
.Bd -literal -offset indent
# sysctl -w machdep.satmgr.hwwdog_enable=1
# sysctl -w machdep.satmgr.hwwdog_enable=0
.Ed
.Pp
.Tn NAS
products currently supported by
.Nm :
.Bl -bullet -compact
.It
KuroBox
.It
Buffalo LinkStation
.It
Synology DiskStation
.El
.Sh FILES
.Bl -tag -width /dev/satmgrX -compact
.It Pa /dev/satmgr
communication inferface to
.Nm .
.It Pa /dev/power
event notify channel to
.Xr powerd 8 .
.El
.Sh SEE ALSO
.Xr powerd 8
.Sh HISTORY
The
.Nm
driver
first appeared in
.Nx 6.0 .
