NetBSD/src/share/man/man8/man8.atari/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.atari/MAKEDEV and
.\" *** src/share/man/man8/man8.atari/MAKEDEV.8.template
.\" *** 
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\"	$NetBSD: MAKEDEV.8,v 1.6 1999/11/03 14:10:40 leo Exp $
.\"
.\" Copyright (c) 1995 Leo Weppelman
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Leo Weppelman.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"	from: @(#)MAKEDEV.8	5.2 (Berkeley) 3/22/91
.\"
.Dd October 10, 1995
.Dt MAKEDEV 8 atari
.Os
.Sh NAME
.Nm MAKEDEV ,
.Nm makedev
.Nd create system and device special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar name
.Op Ar ...
.Sh DESCRIPTION
The shell script
.Nm MAKEDEV ,
found in the
.Pa /dev
directory, is used to create
the common special
files.
.\" See
.\" .Xr special 8
.\" for a more complete discussion of special files.
.Pp
.Nm MAKEDEV
takes any number of device names as arguments,
where the names are the common abbreviation for
the device.  There are several special device names:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
Makes all known devices, including local devices, Tries to make the ``standard'' number of each.
.It Ar fd
Makes fd/* for the fdescfs.
.It Ar floppy
Devices needed for install floppies
.It Ar std
Standard devices
.It Ar local
Configuration specific devices
.El
.Pp
The Atari supports the following devices.
Where a device name is followed by a hash
sign ("#"), the hash sign must be replaced
by a unit number.
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar st#
SCSI tapes
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar fd#
Floppy disks (fdxa: 360Kb, fdxb: 720Kb, fdxc: 1.44Mb)
. It Ar sd#
SCSI disks, includes flopticals
. It Ar cd#
SCSI cdrom discs
. It Ar vnd#
``file'' pseudo-disks
. It Ar ccd#
Concatenated disk driver
. It Ar raid#
RAIDframe disk driver
. It Ar md#
Memory pseudo-disk driver
. It Ar wd#
IDE disks
. El
.It Console ports:
. Bl -tag -width 0123456789 -compact
. It Ar ttye#
Ite bitmapped consoles
. El
.It Pointing devices:
. Bl -tag -width 0123456789 -compact
. It Ar mouse#
Atari mice
. El
.It Printer:
. Bl -tag -width 0123456789 -compact
. It Ar lpt0
Centronics printer
. El
.It Terminal ports:
. Bl -tag -width 0123456789 -compact
. It Ar ttyA0
8530 Channel A (formerly ser02)
. It Ar ttyA1
8530 Channel B (formerly mdm02)
. It Ar ttyB0
UART on first 68901 (formerly mdm01)
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar aconf
Autoconfig information (not yet)
. It Ar audio#
Audio devices
. It Ar bpf#
Berkeley Packet Filter
. It Ar ch
SCSI changer
. It Ar grf#
Motherboard bitmapped video.
. It Ar ipl
IP Filter devices
. It Ar kbd
Atari keyboard.
. It Ar lkm
Loadable kernel modules interface
. It Ar random
Random number generator
. It Ar rtc
Atari RealTimeClock
. It Ar scsibus#
SCSI busses, see
.Xr scsictl 8 ,
.Xr scsi 4 
. It Ar ss#
SCSI scanner
. It Ar tun#
Network tunnel driver
. It Ar uk#
SCSI unknown
. It Ar view#
Generic interface to graphic displays.
. El
.It Video devices:
. Bl -tag -width 0123456789 -compact
. It Ar etvme
Tseng et-compatible cards on VME
. It Ar leo
Circad Leonardo VME-bus true color
. El
.El
.Pp
.Sh FILES
.Bl -tag -width /dev -compact
.It Pa /dev
The special file directory.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.\" .Xr special 8
