NetBSD/src/share/man/man8/man8.amiga/MAKEDEV.8
.\" *** ------------------------------------------------------------------
.\" *** This file was generated automatically
.\" *** from src/etc/etc.amiga/MAKEDEV and
.\" *** src/share/man/man8/MAKEDEV.8.template
.\" ***
.\" *** DO NOT EDIT - any changes will be lost!!!
.\" *** ------------------------------------------------------------------
.\"
.\" $NetBSD: MAKEDEV.8,v 1.14 2001/06/26 02:11:55 hubertf Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Thomas Klausner.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 21, 1994
.Dt MAKEDEV 8 amiga
.Os
.Sh NAME
.Nm MAKEDEV
.Nd create system and device special files
.Sh SYNOPSIS
.Nm
.Ar special Op Ar ...

.Nm
.Ar device Op Ar ...
.Sh DESCRIPTION
.Nm
is used to create system and device special files.
As arguments it takes the names of known devices, like
.Ar sd0 ,
or of special targets, like
.Pa all
or
.Pa std ,
which create a collection of device special files.
.Pp
The script is in
.Pa /dev/MAKEDEV
and must be called from the
.Pa /dev
directory.
.Pp
The special targets supported on
.Nx Ns / Ns amiga
are:
.Pp
.\" @@@SPECIAL@@@
.Bl -tag -width 01234567 -compact
.It Ar all
Makes all known devices, including local devices. Tries to make the ``standard'' number of each.
.It Ar fd
Makes fd/* for the fdescfs.
.It Ar floppy
Devices needed for install floppies
.It Ar std
Standard devices
.It Ar local
Configuration specific devices
.It Ar isdn
Make ISDN devices
.El
.Pp
Please note that any hash marks
.Pq Dq #
in the following list of supported device targets must be replaced by
digits when calling
.Nm "" :
.Pp
.\" @@@DEVICES@@@
.Bl -tag -width 01
.It Tapes:
. Bl -tag -width 0123456789 -compact
. It Ar st#
SCSI tapes, see
.Xr s\&t 4
. El
.It Disks:
. Bl -tag -width 0123456789 -compact
. It Ar fd#
Floppy disks, see
.Xr f\&dc 4
. It Ar wd#
IDE disks, see
.Xr w\&d 4
. It Ar sd#
SCSI disks, includes flopticals, see
.Xr s\&d 4
. It Ar cd#
SCSI cdrom discs, see
.Xr c\&d 4
. It Ar vnd#
``file'' pseudo-disks, see
.Xr v\&nd 4
. It Ar ccd#
Concatenated disk driver, see
.Xr c\&cd 4
. It Ar raid#
RAIDframe disk driver, see
.Xr r\&aid 4
. It Ar md#
Memory pseudo-disk devices, see
.Xr m\&d 4
. El
.It Console ports:
. Bl -tag -width 0123456789 -compact
. It Ar ttye#
Ite bitmapped consoles
. It Ar ttyE#
Wscons
. El
.It Pointing devices:
. Bl -tag -width 0123456789 -compact
. It Ar mouse#
Amiga mice
. El
.It Terminal ports:
. Bl -tag -width 0123456789 -compact
. It Ar tty00
Standard serial port, see
.Xr t\&ty 4
. It Ar ttyA#
Mfc serial ports
. It Ar ttyB#
Msc serial ports
. It Ar ttyC#
Com style serial ports (DraCo, HyperCom) On the DraCo, units 0 and 1 are the builtin ``modem'' and ``mouse'' ports, if configured.
. El
.It Pseudo terminals:
. Bl -tag -width 0123456789 -compact
. It Ar pty#
Set of 16 master and slave pseudo terminals, see
.Xr p\&ty 4
. El
.It Printers:
. Bl -tag -width 0123456789 -compact
. It Ar par0
Amiga motherboard parallel port
. It Ar lpt#
Lpt parallel port (DraCo mainboard, HyperCom etc.)
. El
.It ISDN devices:
. Bl -tag -width 0123456789 -compact
. It Ar i4b
Comunication between userland isdnd and kernel
. It Ar i4bctl
Control device
. It Ar i4brbch#
Raw b-channel access
. It Ar i4btel#
Telephonie device
. It Ar i4btrc#
Trace device
. El
.It Special purpose devices:
. Bl -tag -width 0123456789 -compact
. It Ar grf#
Custom chip (grf0), Retina Z2/Z3 (grf1/grf2), Cirrus boards (grf3), A2410 (grf4) video, CyberVision 64 (grf5), ET4000 boards (grf6) or CyberVision 64/3D (grf7).
. It Ar kbd
Amiga keyboard
. It Ar wskbd#
Wscons keyboard events, see
.Xr w\&skbd 4
. It Ar view#
Generic interface to graphic displays
. It Ar lkm
Loadable kernel modules interface, see
.Xr l\&km 4
. It Ar ipl
IP filter
. It Ar random
Random number generator
. It Ar bpf#
Berkeley Packet Filter, see
.Xr b\&pf 4
. It Ar tun#
Network tunnel driver, see
.Xr t\&un 4
. It Ar scsibus#
SCSI busses, see
.Xr s\&csictl 8 ,
.Xr s\&csi 4
. It Ar ss#
SCSI scanner, see
.Xr s\&s 4
. It Ar uk#
SCSI unknown, see
.Xr u\&k 4
. It Ar ch#
SCSI changer, see
.Xr c\&h 4
. It Ar audio#
One unit of the audio device. On Amiga machines, Unit 0 is custom chip audio, if configured, see
.Xr a\&udio 4
. El
.El
.Sh FILES
.Bl -tag -width "/dev/MAKEDEV" -compact
.It Pa /dev
special device files directory
.It Pa /dev/MAKEDEV
script described in this man page
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.Sh BUGS
This man page is generated automatically from the same sources
as
.Pa /dev/MAKEDEV ,
in which the device files are not always sorted, which may result
in an unusual (non-alphabetical) order.
