NetBSD/src/usr.bin/kdump/ioctlprint.1
.\" $NetBSD: ioctlprint.1,v 1.5 2020/04/03 06:12:48 wiz Exp $
.\"
.\" Copyright (c) 2020 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Kamil Rytarowski.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 2, 2020
.Dt IOCTLPRINT 1
.Os
.Sh NAME
.Nm ioctlprint
.Nd display descriptive ioctl value
.Sh SYNOPSIS
.Nm
.Op Fl l
.Op Fl e Ar emulation
.Op Fl f Ar format
.Op Ar arg ...
.Sh DESCRIPTION
The
.Nm
utility displays information about the file ioctl operation pointed
to by one or more
.Ar arg
arguments.
The argument can either be an
.Xr ioctl 2
symbolic name or the ioctl value.
.Pp
The options are as follows:
.Bl -tag -width 12n
.It Fl e Ar emulation
If an emulation of a process is unknown,
interpret system call maps assuming the named emulation instead of
default "netbsd".
.It Fl f Ar format
The argument is a
.Xr printf 3
style format string that allows customization of
.Nm ioctlprint Ap s
output.
.Pp
The following conversion characters can be used:
.Bl -tag -width 9n
.It \&%E
Symbolic decoded ioctl string.
.It \&%e
Decoded ioctl string with hex values.
.It \&%n
Descriptive ioctl operation name.
.It \&%x
Hexadecimal ioctl number.
.It \&%o
Octal ioctl number.
.It \&%d or \&%i
Decimal ioctl number.
.El
.Pp
The default format is:
.Bd -literal -offset indent
"%n %e %x\\n"
.Ed
.It Fl l
List all known
.Xr ioctl 2
requests.
.El
.Sh SEE ALSO
.Xr kdump 1 ,
.Xr ktrace 1
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 10 .
.Sh AUTHORS
.An Kamil Rytarowski Aq Mt kamil@NetBSD.org
