NetBSD/src/usr.sbin/flashctl/flashctl.8
.\"	$NetBSD: flashctl.8,v 1.2.6.2 2011/07/26 03:22:30 matt Exp $
.\"
.\" Copyright (c) 2011 Department of Software Engineering,
.\"		       University of Szeged, Hungary
.\" Copyright (c) 2011 Adam Hoka <ahoka@NetBSD.org>
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by the Department of Software Engineering, University of Szeged, Hungary
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 27, 2011
.Dt FLASHCTL 8
.Os
.Sh NAME
.Nm flashctl
.Nd a program to manipulate flash devices
.Sh SYNOPSIS
.Nm
.Ar device
.Ar command
.Oo
.Ar arg Oo ...
.Oc
.Oc
.Sh DESCRIPTION
.Nm
could be used to invoke low level operations specific to flash devices.
It is used by specifying a device to manipulate,
the command to perform, and any arguments the command may require.
.Sh DEVICE COMMANDS
The following commands may be used on flash devices:
.Bl -tag -width erase_offset_size
.It Cm badblocks
List the bad blocks on the device.
.It Cm erase Ar offset Ar size
Erase
.Ar size
amount of flash memory from
.Ar offset .
Size could be
.Ar all ,
which means the rest of the flash after
.Ar offset
will be erased.
.It Cm identify
Identify the specified device, displaying the device's vendor, product
strings, and the device's capabilities.
.It Cm markbad Ar offset
Mark the block given by its
.Ar offset
as bad.
.El
.Sh SEE ALSO
.Xr flash 4
.Sh HISTORY
The
.Nm
command first appeared in
.Nx 6.0 .
.Sh AUTHORS
The
.Nm
command was written by
.An Adam Hoka .
